#pragma once

// Name: Arise, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Enums
//---------------------------------------------------------------------------

// Enum Arise.EBtlAnimationBlendType
enum class EBtlAnimationBlendType : uint8_t
{
	BLEND_NORMAL                   = 0,
	BLEND_NONE                     = 1,
	BLEND_LONG                     = 2,
	BLEND_INVALID                  = 3,
	BLEND_MAX                      = 4
};


// Enum Arise.EBtlVoiceHandleState
enum class EBtlVoiceHandleState : uint8_t
{
	Waiting                        = 0,
	Reserving                      = 1,
	Playing                        = 2,
	EBtlVoiceHandleState_MAX       = 3
};


// Enum Arise.EBtlVoiceState
enum class EBtlVoiceState : uint8_t
{
	NON                            = 0,
	BAD                            = 1,
	SPE                            = 2,
	REC                            = 3,
	GOD                            = 4,
	DAM                            = 5,
	ATK                            = 6,
	ETC                            = 7,
	RES                            = 8,
	EBtlVoiceState_MAX             = 9
};


// Enum Arise.EBtlVoiceType
enum class EBtlVoiceType : uint8_t
{
	VBS                            = 0,
	VBM                            = 1,
	EBtlVoiceType_MAX              = 2
};


// Enum Arise.EAriseRelationship
enum class EAriseRelationship : uint8_t
{
	NON                            = 0,
	SYS                            = 1,
	SB1                            = 2,
	SB2                            = 3,
	UQ1                            = 4,
	UQ2                            = 5,
	SPC                            = 6,
	SB3                            = 7,
	EAriseRelationship_MAX         = 8
};


// Enum Arise.EBtlVoiceCharaID
enum class EBtlVoiceCharaID : uint8_t
{
	INVALID                        = 0,
	ARI                            = 1,
	SIO                            = 2,
	NNA                            = 3,
	ZGU                            = 4,
	MNK                            = 5,
	YRA                            = 6,
	ZFA                            = 7,
	BEZ                            = 8,
	KIL                            = 9,
	YRB                            = 10,
	AGM                            = 11,
	DFN                            = 12,
	DFO                            = 13,
	LSW                            = 14,
	LHI                            = 15,
	LGU                            = 16,
	LLA                            = 17,
	ELS                            = 18,
	KRO                            = 19,
	EDN                            = 20,
	EIZ                            = 21,
	KLZ                            = 22,
	DAR                            = 23,
	FRU                            = 24,
	GRA                            = 25,
	ELM                            = 26,
	CBK                            = 27,
	CBA                            = 28,
	SGU                            = 29,
	EMOTION                        = 30,
	SELF                           = 31,
	ALLPEOPLE                      = 32,
	PARTY                          = 33,
	ALLY                           = 34,
	ENEMY                          = 35,
	PUBLIC                         = 36,
	OBJECT                         = 37,
	EBtlVoiceCharaID_MAX           = 38
};


// Enum Arise.EBtlVoiceUsage
enum class EBtlVoiceUsage : uint8_t
{
	NONE                           = 0,
	ONLY_ONCE_IN_BATTLE            = 1,
	ONLY_ONCE_IN_LEVEL             = 2,
	ONLY_ONCE_IN_PLAY              = 3,
	ONLY_ONCE                      = 4,
	INTERVAL_SLOT00                = 5,
	INTERVAL_SLOT01                = 6,
	INTERVAL_SLOT02                = 7,
	INTERVAL_SLOT03                = 8,
	INTERVAL_SLOT04                = 9,
	INTERVAL_SLOT05                = 10,
	INTERVAL_SLOT06                = 11,
	INTERVAL_SLOT07                = 12,
	EBtlVoiceUsage_MAX             = 13
};


// Enum Arise.EBtlVoiceCondition
enum class EBtlVoiceCondition : uint8_t
{
	NON                            = 0,
	NORMAL                         = 1,
	FIRE                           = 2,
	WATER                          = 3,
	WIND                           = 4,
	EARTH                          = 5,
	LIGHT                          = 6,
	DARK                           = 7,
	DAMAGE_PERCENT                 = 8,
	DEAD                           = 9,
	ABNORMAL                       = 10,
	TARGET                         = 11,
	SPELL_DAMAGE                   = 12,
	OVERLIMIT                      = 13,
	STRIKEABLE                     = 14,
	USE_ITEM                       = 15,
	COMBO_COUNT                    = 16,
	ESCAPE                         = 17,
	SUPPORT_RECOVERY               = 18,
	RECOVERY                       = 19,
	DAMAGE                         = 20,
	ENCOUNT                        = 21,
	GUARDBREAK                     = 22,
	GUARDBREAK_DOWN                = 23,
	FLASHRAID                      = 24,
	SPECIAL_DOWN                   = 25,
	BLOW                           = 26,
	TEAM_MANY                      = 27,
	VOICE_END                      = 28,
	TP_PERCENT                     = 29,
	CORE_BREAK                     = 30,
	CORE_BREAK_OR_DOWN             = 31,
	UNIQUE_DAMAGE                  = 32,
	JUST_AVOIDANCE                 = 33,
	SINGLE_ENCOUNT_PLAYED          = 34,
	UNIT_COUNT_BELOW               = 35,
	PLAY_SEQUENTIAL                = 36,
	UNIT_INCREASE                  = 37,
	ATTACK_RECEIVE                 = 38,
	PHASE_CHANGED                  = 39,
	STRIKE_SMASH_POSSIBLE          = 40,
	STRIKE_SMASH_PLAYED            = 41,
	STRIKE_SMASH_KILL              = 42,
	ARTS_INSPIRATION               = 43,
	STRATEGY_CHANGED               = 44,
	REVIVAL                        = 45,
	CORE_BREAKE_GUIDANCE           = 46,
	CONDITION_VOICE_END            = 47,
	AVOIDANCE_RETURN               = 48,
	UNIQUE_SKILL                   = 49,
	OVERLIMITE_REACTION            = 50,
	WIN                            = 51,
	LEVEL_UP                       = 52,
	ITEM_DROP                      = 53,
	WEAPON_GUIDE                   = 54,
	BATTLE_BONUS_MAX               = 55,
	BOOST_ATTACK_GUIDE_SIO         = 56,
	BOOST_ATTACK_GUIDE_NNA         = 57,
	BOOST_ATTACK_GUIDE_ZGU         = 58,
	BOOST_ATTACK_GUIDE_MNK         = 59,
	BOOST_ATTACK_GUIDE_YRA         = 60,
	EBtlVoiceCondition_MAX         = 61
};


// Enum Arise.EBtlVoiceTarget
enum class EBtlVoiceTarget : uint8_t
{
	NON                            = 0,
	FRONT_ALL                      = 1,
	PARTY_ANY                      = 2,
	FRONT_ANY                      = 3,
	BACK_CHARA                     = 4,
	ANY_NOT_PLAYER                 = 5,
	FRONT_NOT_PLAYER               = 6,
	BACK_NOT_PLAYER                = 7,
	ANY_NOT_SELF                   = 8,
	FRONT_NOT_SELF                 = 9,
	BACK_NOT_SELF                  = 10,
	PLAYER                         = 11,
	THIS_CHARA                     = 12,
	MAGIC_CHARA                    = 13,
	ENEMY                          = 14,
	ZAKO_ENEMY                     = 15,
	POWER_ENEMY                    = 16,
	ARI                            = 17,
	SIO                            = 18,
	NNA                            = 19,
	ZGU                            = 20,
	MNK                            = 21,
	YRA                            = 22,
	OTHER                          = 23,
	EBtlVoiceTarget_MAX            = 24
};


// Enum Arise.EBtlVoiceEnableFalgBit
enum class EBtlVoiceEnableFalgBit : uint8_t
{
	ScenarioVoice                  = 0,
	CutScene                       = 1,
	TalkVoice                      = 2,
	Script                         = 3,
	DebugEnable                    = 4,
	EBtlVoiceEnableFalgBit_MAX     = 5
};


// Enum Arise.EBtlArtsFinishedPosition
enum class EBtlArtsFinishedPosition : uint8_t
{
	GROUND                         = 0,
	AIR                            = 1,
	EBtlArtsFinishedPosition_MAX   = 2
};


// Enum Arise.EBtlMagicRank
enum class EBtlMagicRank : uint8_t
{
	NONE                           = 0,
	LOW                            = 1,
	MIDDLE                         = 2,
	HIGH                           = 3,
	EBtlMagicRank_MAX              = 4
};


// Enum Arise.EBtlArtsUniqueParam
enum class EBtlArtsUniqueParam : uint8_t
{
	NONE                           = 0,
	POISON                         = 1,
	FROZEN                         = 2,
	PARALYSIS                      = 3,
	CURSE                          = 4,
	BUFF_TIME                      = 5,
	ATK                            = 6,
	EATK                           = 7,
	DEF                            = 8,
	EDEF                           = 9,
	PENETRATE                      = 10,
	ENDURANCE                      = 11,
	AG_RECOVERY_SPEED              = 12,
	EBtlArtsUniqueParam_MAX        = 13
};


// Enum Arise.EBtlElementType
enum class EBtlElementType : uint8_t
{
	NORMAL                         = 0,
	FIRE                           = 1,
	WATER                          = 2,
	WIND                           = 3,
	EARTH                          = 4,
	LIGHT                          = 5,
	DARK                           = 6,
	ELEMENT_MAX                    = 7,
	EBtlElementType_MAX            = 8
};


// Enum Arise.EBtlArtsAction
enum class EBtlArtsAction : uint8_t
{
	ATTACK                         = 0,
	HEAL                           = 1,
	CURE                           = 2,
	REBIRTH                        = 3,
	BUFF                           = 4,
	OTHER                          = 5,
	HEAL_CP                        = 6,
	EBtlArtsAction_MAX             = 7
};


// Enum Arise.EBtlArtsType
enum class EBtlArtsType : uint8_t
{
	ATK0                           = 0,
	ATK1                           = 1,
	ATK2                           = 2,
	ATK3                           = 3,
	ATK4                           = 4,
	ATK_AIR0                       = 5,
	ATK_AIR1                       = 6,
	ATK_AIR2                       = 7,
	ATK_AIR3                       = 8,
	ATK_AIR4                       = 9,
	ARTS                           = 10,
	ARTS_AIR                       = 11,
	MAGIC                          = 12,
	STR_ATK                        = 13,
	STR_ATK_AIR                    = 14,
	STR_ATK_SUB                    = 15,
	STR_SMASH                      = 16,
	MYSTIC                         = 17,
	FLASH_RAID                     = 18,
	FLASH_RAID_AIR                 = 19,
	OVER_LIMIT                     = 20,
	STR_ATK_AIR_SUB                = 21,
	BRAKE                          = 22,
	RETURN                         = 23,
	SUPER_AVOID                    = 24,
	DOWN                           = 25,
	PRE_SMASH                      = 26,
	PRE_SMASH_AIR                  = 27,
	MYSTIC_SECOND                  = 28,
	MYSTIC_THIRD                   = 29,
	MYSTIC_FOURTH                  = 30,
	MYSTIC_SPECIAL                 = 31,
	EBtlArtsType_MAX               = 32
};


// Enum Arise.EBtlBaseRefType
enum class EBtlBaseRefType : uint8_t
{
	FriendUnit                     = 0,
	RivalUnit                      = 1,
	WorldOrigin                    = 2,
	EBtlBaseRefType_MAX            = 3
};


// Enum Arise.EBtlRank
enum class EBtlRank : uint8_t
{
	BTL_RANK_STORY                 = 0,
	BTL_RANK_NORMAL                = 1,
	BTL_RANK_SECOND                = 2,
	BTL_RANK_HARD                  = 3,
	BTL_RANK_CHAOS                 = 4,
	BTL_RANK_EASIEST               = 5,
	BTL_RANK_UNKNOWN               = 6,
	BTL_RANK_MAX                   = 7
};


// Enum Arise.EBtlTacticsHow
enum class EBtlTacticsHow : uint8_t
{
	None                           = 0,
	TpUpperPercent                 = 1,
	TpLowerPercent                 = 2,
	Always                         = 3,
	ItemUpper                      = 4,
	ItemLower                      = 5,
	PeopleUpper                    = 6,
	PeopleLower                    = 7,
	Once                           = 8,
	OnceParty                      = 9,
	EnemyUpper                     = 10,
	TYPE_MAX                       = 11,
	EBtlTacticsHow_MAX             = 12
};


// Enum Arise.EBtlTacticsAction
enum class EBtlTacticsAction : uint8_t
{
	None                           = 0,
	Attack                         = 1,
	Idle                           = 2,
	Heal                           = 3,
	UseItem                        = 4,
	Rebirth                        = 5,
	HealBadStatus                  = 6,
	Buff                           = 7,
	TYPE_MAX                       = 8,
	EBtlTacticsAction_MAX          = 9
};


// Enum Arise.EBtlTacticsCondition
enum class EBtlTacticsCondition : uint8_t
{
	None                           = 0,
	PartyHpLowerEqual              = 1,
	PartyHpLowerEqualPercent       = 2,
	PartyHpUpperEqual              = 3,
	PartyHpUpperEqualPercent       = 4,
	TpLowerEqualPercent            = 5,
	TpUpperEqualPercent            = 6,
	Always                         = 7,
	OwnerHpLowerEqual              = 8,
	OwnerHpLowerEqualPercent       = 9,
	OwnerHpUpperEqual              = 10,
	OwnerHpUpperEqualPercent       = 11,
	EnemyNumUpperEqual             = 12,
	EnemyNumLowerEqual             = 13,
	PartyDead                      = 14,
	PartyCondition                 = 15,
	EnemyLevel                     = 16,
	TYPE_MAX                       = 17,
	EBtlTacticsCondition_MAX       = 18
};


// Enum Arise.EBtlTacticsCategory
enum class EBtlTacticsCategory : uint8_t
{
	NONE                           = 0,
	CONDITION                      = 1,
	ACTION                         = 2,
	HOW                            = 3,
	TYPE_MAX                       = 4,
	EBtlTacticsCategory_MAX        = 5
};


// Enum Arise.EBtlStrikeType
enum class EBtlStrikeType : uint8_t
{
	FIRE_SWORD                     = 0,
	FLY_BREAK                      = 1,
	CHANT_BREAK                    = 2,
	ARMOR_BREAK                    = 3,
	RUSH_BREAK                     = 4,
	AVOID_BREAK                    = 5,
	EBtlStrikeType_MAX             = 6
};


// Enum Arise.EBtlEffectSizeType
enum class EBtlEffectSizeType : uint8_t
{
	PC                             = 0,
	SS                             = 1,
	S                              = 2,
	M                              = 3,
	L                              = 4,
	XL                             = 5,
	PCM                            = 6,
	PCL                            = 7,
	XL2                            = 8,
	XL3                            = 9,
	XL4                            = 10,
	EBtlEffectSizeType_MAX         = 11
};


// Enum Arise.EBtlStateMachine
enum class EBtlStateMachine : uint8_t
{
	PlayerCharacter                = 0,
	Human                          = 1,
	Moster                         = 2,
	BigMonster                     = 3,
	GigantMonster                  = 4,
	MapObject                      = 5,
	Max                            = 6
};


// Enum Arise.EBtlPositionType
enum class EBtlPositionType : uint8_t
{
	FRONT                          = 0,
	MIDDLE                         = 1,
	BACK                           = 2,
	EBtlPositionType_MAX           = 3
};


// Enum Arise.EBtlLaunchCharacterType
enum class EBtlLaunchCharacterType : uint8_t
{
	NORMAL                         = 0,
	Z_IGNORE_EXCLUDE_CUTSCENE      = 1,
	Z_IGNORE_ALWAYS                = 2,
	EBtlLaunchCharacterType_MAX    = 3
};


// Enum Arise.EBtlUnitFlag
enum class EBtlUnitFlag : uint8_t
{
	Boss                           = 0,
	Dragon                         = 1,
	CorpseLeft                     = 2,
	UseMagic                       = 3,
	UseGuard                       = 4,
	UseStep                        = 5,
	FixPosition                    = 6,
	Fly                            = 7,
	UnTargetable                   = 8,
	Armor                          = 9,
	SuperAvoid                     = 10,
	SuperiorRank                   = 11,
	LibraryInfo                    = 12,
	Overlimit                      = 13,
	ExtinctionCheck                = 14,
	Gigant                         = 15,
	UnknownHp                      = 16,
	ShowBossHp                     = 17,
	UseFacial                      = 18,
	OverlimitCamera                = 19,
	EncountInfoShow                = 20,
	Flag21                         = 21,
	Flag22                         = 22,
	Flag23                         = 23,
	Flag24                         = 24,
	Flag25                         = 25,
	Flag26                         = 26,
	Flag27                         = 27,
	Flag28                         = 28,
	Flag29                         = 29,
	Flag30                         = 30,
	Flag31                         = 31,
	EBtlUnitFlag_MAX               = 32
};


// Enum Arise.EBattleState
enum class EBattleState : uint8_t
{
	StateNone                      = 0,
	StateInitialize                = 1,
	StatePrev                      = 2,
	StateMain                      = 3,
	StatePostMain                  = 4,
	StateMenu                      = 5,
	StateEvent                     = 6,
	StateGameover                  = 7,
	StateRetry                     = 8,
	StateResult                    = 9,
	StateRunaway                   = 10,
	StateTutorial                  = 11,
	StatePause                     = 12,
	StateFinalize                  = 13,
	EBattleState_MAX               = 14
};


// Enum Arise.EAlphaMask
enum class EAlphaMask : uint8_t
{
	Visible                        = 0,
	Invisible                      = 1,
	FadeIn                         = 2,
	FadeOut                        = 3,
	EAlphaMask_MAX                 = 4
};


// Enum Arise.EBattleActionState
enum class EBattleActionState : uint8_t
{
	STATE_INVALID                  = 0,
	STATE_MOVE                     = 1,
	STATE_JUMP                     = 2,
	STATE_FALL                     = 3,
	STATE_LAND                     = 4,
	STATE_STEP                     = 5,
	STATE_TURN                     = 6,
	STATE_GUARD                    = 7,
	STATE_DAMAGE                   = 8,
	STATE_BLOW                     = 9,
	STATE_DOWN                     = 10,
	STATE_ARISE                    = 11,
	STATE_REACT                    = 12,
	STATE_DEAD                     = 13,
	STATE_MAGIC                    = 14,
	STATE_ITEM                     = 15,
	STATE_ADVENT                   = 16,
	STATE_ATTACK                   = 17,
	STATE_MAX                      = 18
};


// Enum Arise.EBtlAvoidAction
enum class EBtlAvoidAction : uint8_t
{
	NONE                           = 0,
	STEP                           = 1,
	GUARD                          = 2,
	EBtlAvoidAction_MAX            = 3
};


// Enum Arise.EBtlInOutState
enum class EBtlInOutState : uint8_t
{
	NONE                           = 0,
	BTL_IN_PROGRESS                = 1,
	BTL_OUT_PROGRESS               = 2,
	EBtlInOutState_MAX             = 3
};


// Enum Arise.EBtlFlashRaidState
enum class EBtlFlashRaidState : uint8_t
{
	NONE                           = 0,
	FLASH_RAID_IN                  = 1,
	WAIT_FLASH_RAID_IN             = 2,
	WAIT_MOVING                    = 3,
	REQUEST_FLASH_RAID             = 4,
	FLASH_RAID                     = 5,
	EBtlFlashRaidState_MAX         = 6
};


// Enum Arise.EBtlHitFilter
enum class EBtlHitFilter : uint8_t
{
	GROUP_UNKNOWN                  = 0,
	GROUP_PARTY                    = 1,
	GROUP_ENEMY                    = 2,
	GROUP_ANY                      = 3,
	GROUP_MAX                      = 4
};


// Enum Arise.EBtlStrikeAttackState
enum class EBtlStrikeAttackState : uint8_t
{
	NONE                           = 0,
	STRIKE_ATTACK_IN               = 1,
	STRIKE_ATTACK_WAIT_FADEOUT     = 2,
	STRIKE_ATTACK_WARP             = 3,
	STRIKE_ATTACK                  = 4,
	STRIKE_ATTACK_BEGIN_ARTS       = 5,
	STRIKE_ATTACK_ARTS             = 6,
	EBtlStrikeAttackState_MAX      = 7
};


// Enum Arise.EBtlUnitGroup
enum class EBtlUnitGroup : uint8_t
{
	GROUP_UNKNOWN                  = 0,
	GROUP_PARTY                    = 1,
	GROUP_ENEMY                    = 2,
	GROUP_GUEST                    = 3,
	GROUP_MAX                      = 4
};


// Enum Arise.EBtlWaitDeathStrokeState
enum class EBtlWaitDeathStrokeState : uint8_t
{
	NONE                           = 0,
	WAIT_DEATH_STROKE_BEGIN        = 1,
	WAIT_DEATH_STROKE              = 2,
	WAIT_DEATH_STROKE_END          = 3,
	EBtlWaitDeathStrokeState_MAX   = 4
};


// Enum Arise.EAbnormalType
enum class EAbnormalType : uint8_t
{
	POISON                         = 0,
	FROZEN                         = 1,
	PARALYSIS                      = 2,
	CURSE                          = 3,
	SEAL                           = 4,
	NONE                           = 5,
	EAbnormalType_MAX              = 6
};


// Enum Arise.EBtlSimpleBuffType
enum class EBtlSimpleBuffType : uint8_t
{
	Atk                            = 0,
	ElementAtk                     = 1,
	Def                            = 2,
	ElementDef                     = 3,
	PenetratePow                   = 4,
	EndurancePow                   = 5,
	ArtsPower                      = 6,
	ArtsHealPower                  = 7,
	EBtlSimpleBuffType_MAX         = 8
};


// Enum Arise.EBtlStatusBuffParameterType
enum class EBtlStatusBuffParameterType : uint8_t
{
	Atk                            = 0,
	ElementAtk                     = 1,
	Def                            = 2,
	ElementDef                     = 3,
	PenetratePow                   = 4,
	EndurancePow                   = 5,
	AGRegeneration                 = 6,
	EBtlStatusBuffParameterType_MAX = 7
};


// Enum Arise.EBtlResultType
enum class EBtlResultType : uint8_t
{
	PENDING                        = 0,
	WIN                            = 1,
	LOSS                           = 2,
	RUNWARY                        = 3,
	EBtlResultType_MAX             = 4
};


// Enum Arise.EBtlInputEventType
enum class EBtlInputEventType : uint8_t
{
	ButtonPressed                  = 0,
	ButtonJustPressed              = 1,
	ButtonJustReleased             = 2,
	ButtonRepeated                 = 3,
	EBtlInputEventType_MAX         = 4
};


// Enum Arise.EBattleHudAbnormalType
enum class EBattleHudAbnormalType : uint8_t
{
	NONE                           = 0,
	POISON                         = 1,
	FROZEN                         = 2,
	PARALYSIS                      = 3,
	CURSE                          = 4,
	SEAL                           = 5,
	ARMOR_BREAK                    = 6,
	RUSH_BREAK                     = 7,
	FLYING_BREAK                   = 8,
	SUPER_AVOID_Break              = 9,
	ARMOR_BUFF                     = 10,
	RUSH_BUFF                      = 11,
	FLYING_BUFF                    = 12,
	SUPER_AVOID_BUFF               = 13,
	ATK_BUFF                       = 14,
	ELEMENT_ATK_BUFF               = 15,
	DEF_BUFF                       = 16,
	ELEMENT_DEF_BUFF               = 17,
	PENETRATE_POW_BUFF             = 18,
	ENDURANCE_POW_BUFF             = 19,
	AG_REGENERATION_BUFF           = 20,
	SURROUNDED_ATK_BUFF            = 21,
	EBattleHudAbnormalType_MAX     = 22
};


// Enum Arise.EBattleHudNotifyTextPriority
enum class EBattleHudNotifyTextPriority : uint8_t
{
	DEFAULT                        = 0,
	ITEM                           = 1,
	CUTSCENE                       = 2,
	SYSTEM                         = 3,
	EBattleHudNotifyTextPriority_MAX = 4
};


// Enum Arise.EBtlMagicRelativeType
enum class EBtlMagicRelativeType : uint8_t
{
	OWNER                          = 0,
	TARGET                         = 1,
	PARENT_MAGIC                   = 2,
	BATTLE_WORLD                   = 3,
	OWNER_TO_TARGET                = 4,
	OWNER_TO_TARGET_Z_AXIS         = 5,
	TARGET_TO_OWNER                = 6,
	TARGET_TO_OWNER_Z_AXIS         = 7,
	PARENT                         = 8,
	PARENT_TO_TARGET               = 9,
	PARENT_TO_TARGET_Z_AXIS        = 10,
	TARGET_TO_PARENT               = 11,
	TARGET_TO_PARENT_Z_AXIS        = 12,
	SELF_TO_TARGET                 = 13,
	BATTLE_WORLD_OFFSET_PARENT     = 14,
	EBtlMagicRelativeType_MAX      = 15
};


// Enum Arise.EBtlMagicNodeState
enum class EBtlMagicNodeState : uint8_t
{
	None                           = 0,
	Begin                          = 1,
	Execute                        = 2,
	End                            = 3,
	MAX                            = 4
};


// Enum Arise.EBtlMagicConditionType
enum class EBtlMagicConditionType : uint8_t
{
	And                            = 0,
	Or                             = 1,
	EBtlMagicConditionType_MAX     = 2
};


// Enum Arise.EAriseGuestID
enum class EAriseGuestID : uint8_t
{
	SIO                            = 0,
	NNA                            = 1,
	ZGU                            = 2,
	MNK                            = 3,
	YRA                            = 4,
	ZFA                            = 5,
	INVALID                        = 6,
	EAriseGuestID_MAX              = 7
};


// Enum Arise.EBtlCutSceneReserveAction
enum class EBtlCutSceneReserveAction : uint8_t
{
	NONE                           = 0,
	SPECIAL_STRIKE                 = 1,
	SMASH                          = 2,
	MYSTIC                         = 3,
	EVENT_CAPTCHA_WAIT             = 4,
	EVENT                          = 5,
	SEQUENCER_PLAY                 = 6,
	SEQUENCER_PLAY_WAIT            = 7,
	EBtlCutSceneReserveAction_MAX  = 8
};


// Enum Arise.EBtlStrikeSmashState
enum class EBtlStrikeSmashState : uint8_t
{
	NONE                           = 0,
	STRIKE_SMASH_IN                = 1,
	STRIKE_SMASH_WAIT_FADEOUT      = 2,
	STRIKE_SMASH_PRE_ACTION_PLAYER = 3,
	STRIKE_SMASH_PRE_ACTION_PAIR   = 4,
	STRIKE_SMASH_WAIT_LOADING      = 5,
	STRIKE_SMASH                   = 6,
	STRIKE_SMASH_PLAYING           = 7,
	STRIKE_SMASH_PLAY_END          = 8,
	EBtlStrikeSmashState_MAX       = 9
};


// Enum Arise.ETacticsIndex
enum class ETacticsIndex : uint8_t
{
	TACTICS                        = 0,
	TACTICS01                      = 1,
	TACTICS02                      = 2,
	TACTICS03                      = 3,
	TACTICS_MAX                    = 4
};


// Enum Arise.EOperationMode
enum class EOperationMode : uint8_t
{
	OPERATION_MODE_AUTO            = 0,
	OPERATION_MODE_SEMI_AUTO       = 1,
	OPERATION_MODE_MANUAL          = 2,
	OPERATION_MODE_MAX             = 3
};


// Enum Arise.EBtlSemiautoPhase
enum class EBtlSemiautoPhase : uint8_t
{
	SEMIAUTO_NONE                  = 0,
	SEMIAUTO_IDLE                  = 1,
	SEMIAUTO_MOVE                  = 2,
	SEMIAUTO_STEP                  = 3,
	SEMIAUTO_ARTS_MAGIC            = 4,
	SEMIAUTO_AUTOGUARD             = 5,
	SEMIAUTO_AUTOSTEP              = 6,
	SEMIAUTO_START_COMBO           = 7,
	SEMIAUTO_WAIT_NEXT_COMBO       = 8,
	SEMIAUTO_JUMP                  = 9,
	SEMIAUTO_JUMP_TO_POINT         = 10,
	SEMIAUTO_MOVE_AWAY_FROM_TARGET = 11,
	SEMIAUTO_MOVE_TO_SAFE_PLACE    = 12,
	SEMIAUTO_COMBO_END             = 13,
	SEMIAUTO_MAX                   = 14
};


// Enum Arise.FBtlChangeOrderType
enum class EFBtlChangeOrderType : uint8_t
{
	INVALID                        = 0,
	ORDER1                         = 1,
	ORDER2                         = 2,
	ORDER3                         = 3,
	MAX                            = 4
};


// Enum Arise.EPCOrder
enum class EPCOrder : uint8_t
{
	ORDER_1ST                      = 0,
	ORDER_2ND                      = 1,
	ORDER_3RD                      = 2,
	ORDER_4TH                      = 3,
	ORDER_5TH                      = 4,
	ORDER_6TH                      = 5,
	ORDER_7TH                      = 6,
	ORDER_8TH                      = 7,
	ORDER_MAX                      = 8
};


// Enum Arise.EBtlCameraMode
enum class EBtlCameraMode : uint8_t
{
	NORMAL                         = 0,
	LOCKON                         = 1,
	STRIKE_ATTACK                  = 2,
	FLASH_RAID                     = 3,
	STRIKE_SMASH                   = 4,
	FOCUS_UNIT                     = 5,
	SPECIAL_STRIKE_ATTACK          = 6,
	EVENT                          = 7,
	CUTSCENE_TO                    = 8,
	FOCUS_LOCATION                 = 9,
	NORMAL_BATTLE_WIN              = 10,
	OVERLIMIT                      = 11,
	INSPIRATION                    = 12,
	MODE_END                       = 13,
	EBtlCameraMode_MAX             = 14
};


// Enum Arise.EAriseGameState
enum class EAriseGameState : uint8_t
{
	GameState_Pause                = 0,
	GameState_ScreenMask           = 1,
	GameState_Nowloading           = 2,
	GameState_StreamingLevelLoading = 3,
	GameState_PlayerFreeLock       = 4,
	GameState_PlayCutSceneEvent    = 5,
	GameState_MapChanging          = 6,
	GameState_Battle               = 7,
	GameState_BattleTraining       = 8,
	GameState_PlayEvent            = 9,
	GameState_PlayQuest            = 10,
	GameState_PlayLongChat         = 11,
	GameState_EventFade            = 12,
	GameState_ActionLadder         = 13,
	GameState_ActionSwim           = 14,
	GameState_ActionGrab           = 15,
	GameState_Fishing              = 16,
	GameState_AutoSaving           = 17,
	GameState_EventContinue        = 18,
	GameState_EncountLock          = 19,
	GameState_ActionDash           = 20,
	GameState_ActionFloating       = 21,
	GameState_PlayScript           = 22,
	GameState_Camp                 = 23,
	GameState_QuestContinue        = 24,
	GameState_PlayLookAtCamera     = 25,
	GameState_BattleResultShowHud  = 26,
	GameState_PlayInteract         = 27,
	GameState_ExecuteEnableControlDelegate = 28,
	GameState_RequestEnableControlDelegate = 29,
	GameState_Menu                 = 30,
	GameState_MenuClosing          = 31,
	GameState_NearMapLink          = 32,
	GameState_DoFastTravel         = 33,
	GameState_GoBackToTitle        = 34,
	GameState_UIControl            = 35,
	GameState_Encounting           = 36,
	GameState_PostGameDataLoaded   = 37,
	GameState_PassBlocked          = 38,
	GameState_PlayerFreeLockUntilMapJump = 39,
	GameState_SaveLoading          = 40,
	GameState_TextureStreaming     = 41,
	GameState_QuestAutoSaveProcess = 42,
	GameState_DebugMenuOpen        = 43,
	GameState_Sandbox              = 44,
	GameState_FlyMode              = 45,
	GameState_MAX                  = 46
};


// Enum Arise.EArtsKey
enum class EArtsKey : uint8_t
{
	INDEX                          = 0,
	INDEX01                        = 1,
	INDEX02                        = 2,
	INDEX_0_SUB                    = 3,
	INDEX_1_SUB                    = 4,
	INDEX_2_SUB                    = 5,
	MAX                            = 6
};


// Enum Arise.EAriseUIOrder
enum class EAriseUIOrder : uint8_t
{
	Bottom                         = 0,
	Default                        = 1,
	HUD                            = 2,
	Menu                           = 3,
	LongChat                       = 4,
	Middle                         = 5,
	System                         = 6,
	Top                            = 7,
	TopMost                        = 8,
	EAriseUIOrder_MAX              = 9
};


// Enum Arise.EBtlUnitFilterType
enum class EBtlUnitFilterType : uint8_t
{
	NONE                           = 0,
	HP_LOWER_EQUAL                 = 1,
	HP_LOWER_EQUAL_PERCENT         = 2,
	HP_UPPER_EQUAL                 = 3,
	HP_UPPER_EQUAL_PERCENT         = 4,
	EBtlUnitFilterType_MAX         = 5
};


// Enum Arise.EAriseDebugSaveRoot
enum class EAriseDebugSaveRoot : uint8_t
{
	DEBUG_SAVE_ROOT_PC             = 0,
	DEBUG_SAVE_ROOT_USB            = 1,
	DEBUG_SAVE_ROOT_HDD            = 2,
	DEBUG_SAVE_ROOT_MAX            = 3
};


// Enum Arise.EAriseSaveResult
enum class EAriseSaveResult : uint8_t
{
	SAVE_RESULT_SUCCESS            = 0,
	SAVE_RESULT_CANCEL             = 1,
	SAVE_RESULT_FAILED             = 2,
	SAVE_RESULT_NOT_EXIST          = 3,
	SAVE_RESULT_MAX                = 4
};


// Enum Arise.EAriseSaveVerify
enum class EAriseSaveVerify : uint8_t
{
	VERIFY_SUCCESS                 = 0,
	VERIFY_UNKNOWN_FAILED          = 1,
	VERIFY_UNKNOWN_ENTITLEMENTS    = 2,
	VERIFY_INVAILD_ENTITLEMENTS    = 3,
	VERIFY_ROLLBACK_ITEMS          = 4,
	VERIFY_MAX                     = 5
};


// Enum Arise.EAriseSaveToDoMessage
enum class EAriseSaveToDoMessage : uint8_t
{
	SAVE_TODO_MESSAGE_NOT_SHOW     = 0,
	SAVE_TODO_MESSAGE_SUCCESS      = 1,
	SAVE_TODO_MESSAGE_VERSION      = 2,
	SAVE_TODO_MESSAGE_BROKEN       = 3,
	SAVE_TODO_MESSAGE_NOT_EXIST    = 4,
	SAVE_TODO_MESSAGE_VERIFY       = 5,
	SAVE_TODO_MESSAGE_CONDITIONALY_SUCCESS_VERIFY = 6,
	SAVE_TODO_MESSAGE_FAILED       = 7,
	SAVE_TODO_MESSAGE_MAX          = 8
};


// Enum Arise.EAriseSaveType
enum class EAriseSaveType : uint8_t
{
	SAVE_TYPE_EMPTY                = 0,
	SAVE_TYPE_MANUAL               = 1,
	SAVE_TYPE_AUTO                 = 2,
	SAVE_TYPE_MAX                  = 3
};


// Enum Arise.EAriseSaveThumbneilType
enum class EAriseSaveThumbneilType : uint8_t
{
	SAVE_THUMBNEIL_CAPTURE         = 0,
	SAVE_THUMBNEIL_NONE            = 1,
	SAVE_THUMBNEIL_AUTO_SAVE       = 2,
	SAVE_THUMBNEIL_CLEARED         = 3,
	SAVE_THUMBNEIL_MAX             = 4
};


// Enum Arise.ENewsInfoPurpose
enum class ENewsInfoPurpose : uint8_t
{
	DLC_Top                        = 0,
	News                           = 1,
	MAX                            = 2
};


// Enum Arise.EMenuTopCharaType
enum class EMenuTopCharaType : uint8_t
{
	TOP_CHARA_NONE                 = 0,
	TOP_CHARA_DEFAULT              = 1,
	TOP_CHARA_FRONT                = 2,
	TOP_CHARA_BACK                 = 3,
	TOP_CHARA_MAX                  = 4
};


// Enum Arise.EQuestGuideLocationRole
enum class EQuestGuideLocationRole : uint8_t
{
	None                           = 0,
	MainQuest_TargetActor          = 1,
	SubQuest_OwnerActor_CanOrder   = 2,
	SubQuest_OwnerActor_InOrder    = 3,
	SubQuest_OwnerActor_Report     = 4,
	SubQuest_TargetActor           = 5,
	EQuestGuideLocationRole_MAX    = 6
};


// Enum Arise.EPFNpcFacilityType
enum class EPFNpcFacilityType : uint8_t
{
	NPC_FACILITY_NONE              = 0,
	NPC_FACILITY_ITEM_SHOP         = 1,
	NPC_FACILITY_INN               = 2,
	NPC_FACILITY_INFORMATION_SHOP  = 3,
	NPC_FACILITY_WEAPON_SHOP       = 4,
	NPC_FACILITY_ACCESSORY_SHOP    = 5,
	NPC_FACILITY_SHIP_SHOP         = 6,
	NPC_FACILITY_OWL_SHOP          = 7,
	NPC_FACILITY_UTILITY_SHOP      = 8,
	NPC_FACILITY_RECOVERY_SHOP     = 9,
	NPC_FACILITY_FARM              = 10,
	NPC_FACILITY_COLOSSEUM         = 11,
	NPC_FACILITY_GENERAL_STORE     = 12,
	NPC_FACILITY_INJURED_PERSON    = 13,
	NPC_FACILITY_FISHING_TACKLE_SHOP = 14,
	NPC_FACILITY_PERCH             = 15,
	NPC_FACILITY_MAX               = 16
};


// Enum Arise.EPlacementNpcPointRole
enum class EPlacementNpcPointRole : uint8_t
{
	Unknown                        = 0,
	HasMainEvent                   = 1,
	HasQuest                       = 2,
	HasShortChat                   = 3,
	HasTalk                        = 4,
	HasImportantTalk               = 5,
	HasFacility                    = 6,
	EPlacementNpcPointRole_MAX     = 7
};


// Enum Arise.EInteractionModelDraw
enum class EInteractionModelDraw : uint8_t
{
	Base                           = 0,
	Gathered                       = 1,
	Hide                           = 2,
	EInteractionModelDraw_MAX      = 3
};


// Enum Arise.EInteractionModelBounds
enum class EInteractionModelBounds : uint8_t
{
	Component                      = 0,
	Vertices                       = 1,
	EInteractionModelBounds_MAX    = 2
};


// Enum Arise.EAlphaMaskBranch
enum class EAlphaMaskBranch : uint8_t
{
	Visible                        = 0,
	Fadeing                        = 1,
	Invisible                      = 2,
	EAlphaMaskBranch_MAX           = 3
};


// Enum Arise.EAlphaMaskFlagCategory
enum class EAlphaMaskFlagCategory : uint8_t
{
	Default                        = 0,
	Event                          = 1,
	Battle                         = 2,
	BattleEvent                    = 3,
	Development                    = 4,
	EAlphaMaskFlagCategory_MAX     = 5
};


// Enum Arise.EAlphaMaskDirection
enum class EAlphaMaskDirection : uint8_t
{
	OneToZero                      = 0,
	ZeroToOne                      = 1,
	EAlphaMaskDirection_MAX        = 2
};


// Enum Arise.EPFNpcCharacterBuildType
enum class EPFNpcCharacterBuildType : uint8_t
{
	Async                          = 0,
	Sync                           = 1,
	Queue                          = 2,
	EPFNpcCharacterBuildType_MAX   = 3
};


// Enum Arise.EMapChangeReason
enum class EMapChangeReason : uint8_t
{
	MapChangeByUnknown             = 0,
	MapChangeByMapLink             = 1,
	MapChangeByFastTravel          = 2,
	MapChangeByQuestScript         = 3,
	MapChangeByAnyScript           = 4,
	MapChangeByPostTitle           = 5,
	MapChangeByPostEvent           = 6,
	MapChangeByPostDataLoad        = 7,
	MapChangeByReloadFunc          = 8,
	MapChangeByDebugFunc           = 9,
	MapChangeByAnyFunc             = 10,
	EMapChangeReason_MAX           = 11
};


// Enum Arise.ESceneRunType
enum class ESceneRunType : uint8_t
{
	RunTypeStandardScene           = 0,
	RunTypeTemporaryScene          = 1,
	RunTypeCleanUpScene            = 2,
	RunTypePrevScene               = 3,
	ESceneRunType_MAX              = 4
};


// Enum Arise.EARISE_MEM_PEAKVALUE
enum class EARISE_MEM_PEAKVALUE : uint8_t
{
	PV_FREE_MAINMEMORY             = 0,
	PV_TEXTURE_TOTAL_USE           = 1,
	PV_TEXTURE_TOTAL_DISC          = 2,
	PV_WORLD_TEXTURE_TOTAL_USE     = 3,
	PV_CHARACTER_TEXTURE_TOTAL_USE = 4,
	PV_PS4_CPU                     = 5,
	PV_PS4_Garlic                  = 6,
	PV_MAX                         = 7
};


// Enum Arise.EAriseGameScene
enum class EAriseGameScene : uint8_t
{
	Title                          = 0,
	DebugMap                       = 1,
	Field                          = 2,
	Battle                         = 3,
	Menu                           = 4,
	BattleMenu                     = 5,
	Camp                           = 6,
	LongChat                       = 7,
	Movie                          = 8,
	Fishing                        = 9,
	PlayerFree                     = 10,
	Event                          = 11,
	Quest                          = 12,
	Ending                         = 13,
	Boot                           = 14,
	Login                          = 15,
	ToLogin                        = 16,
	TitleBack                      = 17,
	MaxScene                       = 18,
	None                           = 19,
	EAriseGameScene_MAX            = 20
};


// Enum Arise.EARISE_DROPMIPS_TYPE
enum class EARISE_DROPMIPS_TYPE : uint8_t
{
	DROPMIPS_FULL                  = 0,
	DROPMIPS_UNUSED                = 1,
	DROPMIPS_WORLDANDCHAR          = 2,
	DROPMIPS_WORLDONLY             = 3,
	DROPMIPS_CHARONLY              = 4,
	DROPMIPS_DEFAULT               = 5,
	DROPMIPS_MAX                   = 6
};


// Enum Arise.EGameSection
enum class EGameSection : uint8_t
{
	None                           = 0,
	InitSystem                     = 1,
	Boot                           = 2,
	Title                          = 3,
	MainGame                       = 4,
	MAX                            = 5
};


// Enum Arise.ESceneInitializeMode
enum class ESceneInitializeMode : uint8_t
{
	OnRunScene                     = 0,
	OnReservedScene                = 1,
	ESceneInitializeMode_MAX       = 2
};


// Enum Arise.ESceneFinalizeReason
enum class ESceneFinalizeReason : uint8_t
{
	FinalizeAtChangeScene          = 0,
	FinalizeAtRemove               = 1,
	FinalizeAtCleanup              = 2,
	ESceneFinalizeReason_MAX       = 3
};


// Enum Arise.ESceneControllerWorkState
enum class ESceneControllerWorkState : uint8_t
{
	Nothing                        = 0,
	WaitSceneInitialize            = 1,
	WaitSceneFinalize              = 2,
	WaitAssetLoad                  = 3,
	WaitAssetUnload                = 4,
	WaitScreenMaskOn               = 5,
	WaitScreenMaskOff              = 6,
	ESceneControllerWorkState_MAX  = 7
};


// Enum Arise.ESceneControllerState
enum class ESceneControllerState : uint8_t
{
	SceneNone                      = 0,
	SceneInitilize                 = 1,
	SceneSleep                     = 2,
	SceneWakeup                    = 3,
	SceneRun                       = 4,
	SceneFinalize                  = 5,
	SceneDestroy                   = 6,
	ESceneControllerState_MAX      = 7
};


// Enum Arise.ECameraFadeType
enum class ECameraFadeType : uint8_t
{
	FADE_IN                        = 0,
	FADE_OUT                       = 1,
	FADE_MAX                       = 2
};


// Enum Arise.EAINavLinkType
enum class EAINavLinkType : uint8_t
{
	None                           = 0,
	Jump                           = 1,
	EAINavLinkType_MAX             = 2
};


// Enum Arise.EAlphaMaskCameraFadeTaskMethod
enum class EAlphaMaskCameraFadeTaskMethod : uint8_t
{
	None                           = 0,
	DistanceBoundingSphere         = 1,
	DistanceBoundingBox            = 2,
	CameraFade                     = 3,
	EAlphaMaskCameraFadeTaskMethod_MAX = 4
};


// Enum Arise.EAriseBlueprintAssetCreateMethod
enum class EAriseBlueprintAssetCreateMethod : uint8_t
{
	NewObject                      = 0,
	SpawnActor                     = 1,
	EAriseBlueprintAssetCreateMethod_MAX = 2
};


// Enum Arise.EAriseBlueprintAssetCategory
enum class EAriseBlueprintAssetCategory : uint8_t
{
	System                         = 0,
	Boot                           = 1,
	Title                          = 2,
	Menu                           = 3,
	Field                          = 4,
	Fishing                        = 5,
	Longchat                       = 6,
	Battle                         = 7,
	Manual                         = 8,
	Debug                          = 9,
	Finalize                       = 10,
	EAriseBlueprintAssetCategory_MAX = 11
};


// Enum Arise.EAriseBlueprintAssetLoadPolicy
enum class EAriseBlueprintAssetLoadPolicy : uint8_t
{
	Async                          = 0,
	Sync                           = 1,
	EAriseBlueprintAssetLoadPolicy_MAX = 2
};


// Enum Arise.EAriseChunkInstallPriority
enum class EAriseChunkInstallPriority : uint8_t
{
	CHUNK_INSTALL_PRIORITY_IMMEDIATE = 0,
	CHUNK_INSTALL_PRIORITY_HIGH    = 1,
	CHUNK_INSTALL_PRIORITY_SLOW    = 2,
	CHUNK_INSTALL_PRIORITY_MAX     = 3
};


// Enum Arise.EAriseChunkInstallSpeed
enum class EAriseChunkInstallSpeed : uint8_t
{
	CHUNK_INSTALL_SPEED_PAUSE      = 0,
	CHUNK_INSTALL_SPEED_SLOW       = 1,
	CHUNK_INSTALL_SPEED_HIGH       = 2,
	CHUNK_INSTALL_SPEED_MAX        = 3
};


// Enum Arise.EAriseChunkLocation
enum class EAriseChunkLocation : uint8_t
{
	CHUNK_LOCATION_NOT_EXIST       = 0,
	CHUNK_LOCATION_NOT_INSTALLED   = 1,
	CHUNK_LOCATION_LOCAL_SLOW      = 2,
	CHUNK_LOCATION_LOCAL_FAST      = 3,
	CHUNK_LOCATION_MAX             = 4
};


// Enum Arise.EAriseChunkNo
enum class EAriseChunkNo : uint8_t
{
	CHUNK_NO_00                    = 0,
	CHUNK_NO_01                    = 1,
	CHUNK_NO_02                    = 2,
	CHUNK_NUM                      = 3,
	CHUNK_MAX                      = 4
};


// Enum Arise.EAriseCommerceResult
enum class EAriseCommerceResult : uint8_t
{
	COMMERCE_RESULT_SUCCESS        = 0,
	COMMERCE_RESULT_CANCEL         = 1,
	COMMERCE_RESULT_FAILED         = 2,
	COMMERCE_RESULT_MAX            = 3
};


// Enum Arise.EAriseSoundOutputType
enum class EAriseSoundOutputType : uint8_t
{
	STEREO                         = 0,
	SURROUND                       = 1,
	EAriseSoundOutputType_MAX      = 2
};


// Enum Arise.EAriseAdvanceInputType
enum class EAriseAdvanceInputType : uint8_t
{
	ADVANCE_INPUT_SHORT            = 0,
	ADVANCE_INPUT_LONG             = 1,
	ADVANCE_INPUT_MAX              = 2
};


// Enum Arise.EAriseCameraControlType
enum class EAriseCameraControlType : uint8_t
{
	CAMERA_CONTROL_NORMAL          = 0,
	CAMERA_CONTROL_REVERSE         = 1,
	CAMERA_CONTROL_MAX             = 2
};


// Enum Arise.EDLCAcquireItemType
enum class EDLCAcquireItemType : uint8_t
{
	Unknown                        = 0,
	Item                           = 1,
	EDLCAcquireItemType_MAX        = 2
};


// Enum Arise.EAriseGameProcessState
enum class EAriseGameProcessState : uint8_t
{
	Begin                          = 0,
	Main                           = 1,
	End                            = 2,
	EAriseGameProcessState_MAX     = 3
};


// Enum Arise.EAriseKpiVoiceLanguage
enum class EAriseKpiVoiceLanguage : uint8_t
{
	JA                             = 0,
	EN                             = 1,
	EAriseKpiVoiceLanguage_MAX     = 2
};


// Enum Arise.EAriseKpiDlcShopResult
enum class EAriseKpiDlcShopResult : uint8_t
{
	Nothing                        = 0,
	Transition                     = 1,
	EAriseKpiDlcShopResult_MAX     = 2
};


// Enum Arise.EAriseKpiExDungeonType
enum class EAriseKpiExDungeonType : uint8_t
{
	EXD_ALIEN_VISITOR              = 0,
	EXD_RECOLLECTION               = 1,
	EXD_MAX                        = 2
};


// Enum Arise.EAriseKpiExDungeonData
enum class EAriseKpiExDungeonData : uint8_t
{
	Clear                          = 0,
	Visit                          = 1,
	EAriseKpiExDungeonData_MAX     = 2
};


// Enum Arise.EAriseKpiAccessoryShop
enum class EAriseKpiAccessoryShop : uint8_t
{
	Create                         = 0,
	Strengthen                     = 1,
	Synthesis                      = 2,
	EAriseKpiAccessoryShop_MAX     = 3
};


// Enum Arise.EAriseLogCategory
enum class EAriseLogCategory : uint8_t
{
	EEvent                         = 0,
	ELongChat                      = 1,
	BattleRegulation               = 2,
	Num                            = 3,
	EAriseLogCategory_MAX          = 4
};


// Enum Arise.EAriseMiningItemType
enum class EAriseMiningItemType : uint8_t
{
	Basic                          = 0,
	Artifact                       = 1,
	EAriseMiningItemType_MAX       = 2
};


// Enum Arise.EGuestOrder
enum class EGuestOrder : uint8_t
{
	GUEST_1ST                      = 0,
	GUEST_2ND                      = 1,
	GUEST_3RD                      = 2,
	GUEST_4TH                      = 3,
	GUEST_MAX                      = 4
};


// Enum Arise.EBackupOrder
enum class EBackupOrder : uint8_t
{
	BACKUP_1ST                     = 0,
	BACKUP_2ND                     = 1,
	BACKUP_3RD                     = 2,
	BACKUP_4TH                     = 3,
	BACKUP_MAX                     = 4
};


// Enum Arise.EControlPlayer
enum class EControlPlayer : uint8_t
{
	PLAYER_1P                      = 0,
	PLAYER_2P                      = 1,
	PLAYER_3P                      = 2,
	PLAYER_4P                      = 3,
	PLAYER_MAX                     = 4
};


// Enum Arise.EBottleEffect
enum class EBottleEffect : uint8_t
{
	BOTTLE_EFFECT_NONE             = 0,
	BOTTLE_EFFECT_HOLY             = 1,
	BOTTLE_EFFECT_DARK             = 2,
	BOTTLE_EFFECT_MAX              = 3
};


// Enum Arise.EEquipCategory
enum class EEquipCategory : uint8_t
{
	WEAPON                         = 0,
	ARMOR                          = 1,
	ACCESSORY                      = 2,
	MAX                            = 3
};


// Enum Arise.EAriseRelationshipSeriousCheck
enum class EAriseRelationshipSeriousCheck : uint8_t
{
	NON                            = 0,
	SERIOUS_ENABLE                 = 1,
	SERIOUS_DISABLE                = 2,
	EAriseRelationshipSeriousCheck_MAX = 3
};


// Enum Arise.EAriseResidentAssetCategory
enum class EAriseResidentAssetCategory : uint8_t
{
	System                         = 0,
	Boot                           = 1,
	Title                          = 2,
	Menu                           = 3,
	Field                          = 4,
	Fishing                        = 5,
	Longchat                       = 6,
	Battle                         = 7,
	Manual                         = 8,
	Debug                          = 9,
	EAriseResidentAssetCategory_MAX = 10
};


// Enum Arise.EAriseResidentAssetLoadPolicy
enum class EAriseResidentAssetLoadPolicy : uint8_t
{
	Async                          = 0,
	Sync                           = 1,
	EAriseResidentAssetLoadPolicy_MAX = 2
};


// Enum Arise.EAriseSaveFlag
enum class EAriseSaveFlag : uint8_t
{
	SAVE_FLAG_LOCK                 = 0,
	SAVE_FLAG_MAX                  = 1
};


// Enum Arise.EAriseSaveParameterIndex
enum class EAriseSaveParameterIndex : uint8_t
{
	SAVE_PARAMETER_INDEX_FLAG      = 0,
	SAVE_PARAMETER_INDEX_MAX       = 1
};


// Enum Arise.EAriseScenarioVariableSerialize
enum class EAriseScenarioVariableSerialize : uint8_t
{
	None                           = 0,
	Save                           = 1,
	Load                           = 2,
	EAriseScenarioVariableSerialize_MAX = 3
};


// Enum Arise.EAriseScriptSaveDataType
enum class EAriseScriptSaveDataType : uint8_t
{
	SCRIPT_SAVEDATA_TYPE_BOOL      = 0,
	SCRIPT_SAVEDATA_TYPE_FLOAT     = 1,
	SCRIPT_SAVEDATA_TYPE_INT32     = 2,
	SCRIPT_SAVEDATA_TYPE_INT64     = 3,
	SCRIPT_SAVEDATA_TYPE_MAX       = 4
};


// Enum Arise.EStatusConstraint
enum class EStatusConstraint : uint8_t
{
	Nothing                        = 0,
	Advantaged                     = 1,
	Disadvantaged                  = 2,
	Locked                         = 3,
	EStatusConstraint_MAX          = 4
};


// Enum Arise.ESavedDlcCheckIcon
enum class ESavedDlcCheckIcon : uint8_t
{
	SAVE_DLC_NEW_ICON_CHECK_NOSTORE = 0,
	SAVE_DLC_NEW_ICON_CHECK_YET    = 1,
	SAVE_DLC_NEW_ICON_CHECK_CONFIRMED = 2,
	SAVE_DLC_NEW_ICON_CHECK_MAX    = 3
};


// Enum Arise.ESavedVoiceLanguage
enum class ESavedVoiceLanguage : uint8_t
{
	SAVE_VOICE_NOT_SET             = 0,
	SAVE_VOICE_JAPANESE            = 1,
	SAVE_VOICE_ENGLISH             = 2,
	SAVE_VOICE_MAX                 = 3
};


// Enum Arise.ESavedCEBankAgreement
enum class ESavedCEBankAgreement : uint8_t
{
	SAVE_CE_BANK_NOT_YET           = 0,
	SAVE_CE_BANK_AGREE             = 1,
	SAVE_CE_BANK_DISAGREE          = 2,
	SAVE_CE_BANK_MAX               = 3
};


// Enum Arise.ESavedPPAgreement
enum class ESavedPPAgreement : uint8_t
{
	SAVE_PP_NOT_YET                = 0,
	SAVE_PP_AGREE                  = 1,
	SAVE_PP_DISAGREE               = 2,
	SAVE_PP_MAX                    = 3
};


// Enum Arise.ESavedEulaAgreement
enum class ESavedEulaAgreement : uint8_t
{
	SAVE_EULA_NOT_YET              = 0,
	SAVE_EULA_AGREE                = 1,
	SAVE_EULA_DISAGREE             = 2,
	SAVE_EULA_MAX                  = 3
};


// Enum Arise.BtlHudFaceIcon
enum class EBtlHudFaceIcon : uint8_t
{
	BTLHUD_FACEICON_ARI            = 0,
	BTLHUD_FACEICON_SIO            = 1,
	BTLHUD_FACEICON_NNA            = 2,
	BTLHUD_FACEICON_ZGU            = 3,
	BTLHUD_FACEICON_MNK            = 4,
	BTLHUD_FACEICON_YRA            = 5,
	BTLHUD_FACEICON_ARI01          = 6,
	BTLHUD_FACEICON_ARI02          = 7,
	BTLHUD_FACEICON_ARI03          = 8,
	BTLHUD_FACEICON_ARI04          = 9,
	BTLHUD_FACEICON_ARI05          = 10,
	BTLHUD_FACEICON_ARI06          = 11,
	BTLHUD_FACEICON_SIO01          = 12,
	BTLHUD_FACEICON_DLC            = 13,
	BTLHUD_FACEICON_DLC01          = 14,
	BTLHUD_FACEICON_MAX            = 15
};


// Enum Arise.EBtlAliasCountDefine
enum class EBtlAliasCountDefine : uint8_t
{
	STRIKE_COUNT                   = 0,
	STRIKE_SUCCESS_COUNT           = 1,
	COOK_COUNT                     = 2,
	EAT_FOOD_COUNT                 = 3,
	EAT_FAVORITE_FOOD_COUNT        = 4,
	MAX                            = 5
};


// Enum Arise.EBtlAliasDefine
enum class EBtlAliasDefine : uint8_t
{
	NONE                           = 0,
	STRIKE_COUNT                   = 1,
	STRIKE_SUCCESS_COUNT           = 2,
	COOK_COUNT                     = 3,
	EAT_FOOD_COUNT                 = 4,
	EAT_FAVORITE_FOOD_COUNT        = 5,
	SPECIAL_SIO_COUNT              = 6,
	BIG_FISHING_COUNT              = 7,
	ANY_LIKABLE_COUNT              = 8,
	WEAPON_KIND_MAKE_COUNT         = 9,
	SPECIAL_WEAPON_MAKE            = 10,
	SPECIAL_ACCESSORY_MAKE         = 11,
	SPECIAL_FISHING                = 12,
	ACCESSORY_MAKE_COUNT           = 13,
	ITEM_COLLECTION                = 14,
	OWL_COLLECTION                 = 15,
	ARTIFACT_COUNT                 = 16,
	LEG_SKILL_COUNT                = 17,
	HEAVY_SKILL_COUNT              = 18,
	MAGIC_SKILL_COUNT              = 19,
	PASTURE_COLLECTION             = 20,
	HEALING_SKILL_COUNT            = 21,
	SPECIAL_COOK                   = 22,
	QUEST_CLEAR                    = 23,
	EBtlAliasDefine_MAX            = 24
};


// Enum Arise.EBtlArenaClass
enum class EBtlArenaClass : uint8_t
{
	Low                            = 0,
	Middle                         = 1,
	High                           = 2,
	Expert                         = 3,
	EBtlArenaClass_MAX             = 4
};


// Enum Arise.EAriseCharaIconID
enum class EAriseCharaIconID : uint8_t
{
	INVALID                        = 0,
	ARI                            = 1,
	SIO                            = 2,
	NNA                            = 3,
	ZGU                            = 4,
	MNK                            = 5,
	YRA                            = 6,
	ZFA                            = 7,
	BEZ                            = 8,
	KIL                            = 9,
	AGM                            = 10,
	DFN                            = 11,
	SOL                            = 12,
	LHI                            = 13,
	NPC                            = 14,
	NPC01                          = 15,
	NPC02                          = 16,
	NPC03                          = 17,
	NPC04                          = 18,
	NPC05                          = 19,
	NPC06                          = 20,
	NPC07                          = 21,
	NPC08                          = 22,
	FRU                            = 23,
	MRS                            = 24,
	DNS                            = 25,
	ODT                            = 26,
	CCL                            = 27,
	KRN                            = 28,
	EDN                            = 29,
	EIZ                            = 30,
	KLZ                            = 31,
	DAR                            = 32,
	LSW                            = 33,
	LGU                            = 34,
	LLA                            = 35,
	DOC                            = 36,
	ELS                            = 37,
	ELM                            = 38,
	SGU                            = 39,
	CBK                            = 40,
	CBA                            = 41,
	EAriseCharaIconID_MAX          = 42
};


// Enum Arise.EBtlArenaType
enum class EBtlArenaType : uint8_t
{
	Single                         = 0,
	Party                          = 1,
	Special                        = 2,
	EBtlArenaType_MAX              = 3
};


// Enum Arise.EBtlSkillUnit
enum class EBtlSkillUnit : uint8_t
{
	VALUE                          = 0,
	PERCENT                        = 1,
	EBtlSkillUnit_MAX              = 2
};


// Enum Arise.EBtlSkillDefine
enum class EBtlSkillDefine : uint8_t
{
	NONE                           = 0,
	ICON                           = 1,
	SE_VOICE                       = 2,
	EBtlSkillDefine_MAX            = 3
};


// Enum Arise.EBtlSkillCategory
enum class EBtlSkillCategory : uint8_t
{
	ATTACK                         = 0,
	DEFENSE                        = 1,
	SUPPORT                        = 2,
	UNIQUE                         = 3,
	ACTION                         = 4,
	ARTS                           = 5,
	EBtlSkillCategory_MAX          = 6
};


// Enum Arise.EBtlSkillType
enum class EBtlSkillType : uint8_t
{
	PASSIVE                        = 0,
	ACTIVE                         = 1,
	SKILL                          = 2,
	RANDOM                         = 3,
	COOK                           = 4,
	ARTIFACT                       = 5,
	WEAPON                         = 6,
	ACCESSORY                      = 7,
	BASIC                          = 8,
	EBtlSkillType_MAX              = 9
};


// Enum Arise.EActionCriticalStatus
enum class EActionCriticalStatus : uint8_t
{
	UNCALCULATED                   = 0,
	SUCCESS                        = 1,
	FAIL                           = 2,
	EActionCriticalStatus_MAX      = 3
};


// Enum Arise.EBtlCameraAnimStartType
enum class EBtlCameraAnimStartType : uint8_t
{
	BATTLE_WORLD                   = 0,
	OWNER_CHARACTER                = 1,
	EBtlCameraAnimStartType_MAX    = 2
};


// Enum Arise.EBtlArtsRangeType
enum class EBtlArtsRangeType : uint8_t
{
	FORWARD_SINGLE_SHORT           = 0,
	FORWARD_SINGLE_LONG            = 1,
	FORWARD_WIDE_SHORT             = 2,
	FORWARD_WIDE_LONG              = 3,
	CIRCLE_SHORT                   = 4,
	CIRCLE_LONG                    = 5,
	FULL_AREA                      = 6,
	EBtlArtsRangeType_MAX          = 7
};


// Enum Arise.EBtlSmashType
enum class EBtlSmashType : uint8_t
{
	BLOW                           = 0,
	DOWN                           = 1,
	BREAK                          = 2,
	EBtlSmashType_MAX              = 3
};


// Enum Arise.EBtlBuffOverlap
enum class EBtlBuffOverlap : uint8_t
{
	Overlap                        = 0,
	NewBuffOverride                = 1,
	EBtlBuffOverlap_MAX            = 2
};


// Enum Arise.EBtlBuffType
enum class EBtlBuffType : uint8_t
{
	None                           = 0,
	Buff                           = 1,
	ActiveSkill                    = 2,
	PassiveSkill                   = 3,
	Weapon                         = 4,
	Accessory                      = 5,
	Cooking                        = 6,
	Basic                          = 7,
	EBtlBuffType_MAX               = 8
};


// Enum Arise.EBtlStatusBuffType
enum class EBtlStatusBuffType : uint8_t
{
	Event                          = 0,
	Tickable                       = 1,
	Intervention                   = 2,
	EBtlStatusBuffType_MAX         = 3
};


// Enum Arise.EBtlCameraEasingState
enum class EBtlCameraEasingState : uint8_t
{
	Easing_IN                      = 0,
	Easing_KEEP                    = 1,
	Easing_OUT                     = 2,
	Easing_END                     = 3,
	Easing_MAX                     = 4
};


// Enum Arise.EBtlCameraFocusLocationState
enum class EBtlCameraFocusLocationState : uint8_t
{
	NONE                           = 0,
	FOCUS_LOCATION_IN              = 1,
	FOCUS_LOCATION_KEEP            = 2,
	FOCUS_LOCATION_OUT             = 3,
	EBtlCameraFocusLocationState_MAX = 4
};


// Enum Arise.EBtlArtsCategory
enum class EBtlArtsCategory : uint8_t
{
	NORMAL_ATTACK                  = 0,
	SKILL                          = 1,
	SECRET_SKILL                   = 2,
	CHANT_MAGIC                    = 3,
	HEAL_MAGIC                     = 4,
	SPIRIT_MAGIC                   = 5,
	EBtlArtsCategory_MAX           = 6
};


// Enum Arise.EBtlAttackCollisionPlotType
enum class EBtlAttackCollisionPlotType : uint8_t
{
	OWNER                          = 0,
	TARGET                         = 1,
	OTHER                          = 2,
	EBtlAttackCollisionPlotType_MAX = 3
};


// Enum Arise.EAriseSkillState
enum class EAriseSkillState : uint8_t
{
	Disable                        = 0,
	Enable                         = 1,
	Effective                      = 2,
	EAriseSkillState_MAX           = 3
};


// Enum Arise.EBtl_DecalMaterilParameterType
enum class EBtl_DecalMaterilParameterType : uint8_t
{
	Unknown                        = 0,
	Scolar                         = 1,
	ScolarCurve                    = 2,
	ScolarSimple                   = 3,
	Vector                         = 4,
	VectorCurve                    = 5,
	VectorSimple                   = 6,
	Texture                        = 7,
	EBtl_MAX                       = 8
};


// Enum Arise.EBtlInputConfigType
enum class EBtlInputConfigType : uint8_t
{
	InputEnable                    = 0,
	BattleFinish                   = 1,
	MainStateOnly                  = 2,
	CutScene                       = 3,
	Pause                          = 4,
	DebugWindow                    = 5,
	Tutorial                       = 6,
	SystemPause                    = 7,
	MetaScript                     = 8,
	PlayerChangeFormation          = 9,
	MapChange                      = 10,
	BoostStrike                    = 11,
	EBtlInputConfigType_MAX        = 12
};


// Enum Arise.EBtlRequestDarknessPhase
enum class EBtlRequestDarknessPhase : uint8_t
{
	NONE                           = 0,
	IN_DARKNESS                    = 1,
	OUT_DARKNESS                   = 2,
	EBtlRequestDarknessPhase_MAX   = 3
};


// Enum Arise.EBtlDebugPresetGetRP
enum class EBtlDebugPresetGetRP : uint8_t
{
	RP_Little                      = 0,
	RP_Normal                      = 1,
	RP_Many                        = 2,
	RP_MAX                         = 3
};


// Enum Arise.EBtlSoundPostEvent
enum class EBtlSoundPostEvent : uint8_t
{
	NONE                           = 0,
	SND_BTL_BREAK                  = 1,
	SND_BTL_MYSTIC_SAFE            = 2,
	SND_BTL_FINISH_SAFE            = 3,
	SND_BOOST1_START               = 4,
	SND_BOOST1_END                 = 5,
	SND_BOOST2_START               = 6,
	SND_BOOST2_END                 = 7,
	SND_BTL_ARTS_LOOP_STOP         = 8,
	EBtlSoundPostEvent_MAX         = 9
};


// Enum Arise.EBtlHitEffectOffsetRotationType
enum class EBtlHitEffectOffsetRotationType : uint8_t
{
	Addition                       = 0,
	Combine                        = 1,
	EBtlHitEffectOffsetRotationType_MAX = 2
};


// Enum Arise.EBtlHitEffectCalculateRotationType
enum class EBtlHitEffectCalculateRotationType : uint8_t
{
	DamageToAttackerUnitDirection  = 0,
	AttackerCollisionRotation      = 1,
	EBtlHitEffectCalculateRotationType_MAX = 2
};


// Enum Arise.EBtlUnitDirectionType
enum class EBtlUnitDirectionType : uint8_t
{
	NONE                           = 0,
	FORWARD                        = 1,
	RIGHT                          = 2,
	LEFT                           = 3,
	BACKWARD                       = 4,
	EBtlUnitDirectionType_MAX      = 5
};


// Enum Arise.EBtlFadeFilter
enum class EBtlFadeFilter : uint8_t
{
	OWNER                          = 0,
	PARTY                          = 1,
	ENEMY                          = 2,
	ANY                            = 3,
	EBtlFadeFilter_MAX             = 4
};


// Enum Arise.EBtlMoveType
enum class EBtlMoveType : uint8_t
{
	MOVE_RUN                       = 0,
	MOVE_RUN_TARGET_LOCK           = 1,
	MOVE_WALK                      = 2,
	MOVE_WALK_TARGET_LOCK          = 3,
	MOVE_FLY                       = 4,
	MOVE_FLY_DIRECTION_LOCK        = 5,
	MOVE_FLY_TARGET_LOCK           = 6,
	MOVE_MAX                       = 7
};


// Enum Arise.EBtlChangeGameScene
enum class EBtlChangeGameScene : uint8_t
{
	CHANGE_PREV_GAMESCENE          = 0,
	CHANGE_TO_TITLE                = 1,
	CHANGE_TO_PF                   = 2,
	CHANGE_TO_ENDING               = 3,
	CHANGE_MAX                     = 4
};


// Enum Arise.EBtlArenaState
enum class EBtlArenaState : uint8_t
{
	NONE                           = 0,
	ARENA_BTL                      = 1,
	ARENA_BTL01                    = 2,
	ARENA_BTL02                    = 3,
	ARENA_FINALIZE                 = 4,
	EBtlArenaState_MAX             = 5
};


// Enum Arise.EBtlTimeOperationPreProcessType
enum class EBtlTimeOperationPreProcessType : uint8_t
{
	None                           = 0,
	LastOperationAllClear          = 1,
	EBtlTimeOperationPreProcessType_MAX = 2
};


// Enum Arise.EBtlFacialType
enum class EBtlFacialType : uint8_t
{
	DEFAULT                        = 0,
	DEAD                           = 1,
	DAMAGE                         = 2,
	ATTACK                         = 3,
	ATTACK_NO_VOICE                = 4,
	EBtlFacialType_MAX             = 5
};


// Enum Arise.EBtlDefaultAttackCollisionType
enum class EBtlDefaultAttackCollisionType : uint8_t
{
	Sphere                         = 0,
	Capsule                        = 1,
	EBtlDefaultAttackCollisionType_MAX = 2
};


// Enum Arise.EBtlDestructibleParticleAction
enum class EBtlDestructibleParticleAction : uint8_t
{
	None                           = 0,
	Destory                        = 1,
	EBtlDestructibleParticleAction_MAX = 2
};


// Enum Arise.EBtlDestructMeshFilter
enum class EBtlDestructMeshFilter : uint8_t
{
	NonDestruct                    = 0,
	PlayerParty_Level0             = 1,
	PlayerParty_Level1             = 2,
	PlayerParty_Level2             = 3,
	PlayerParty_Level3             = 4,
	PlayerParty_Level4             = 5,
	PlayerParty_Level5             = 6,
	PlayerParty_Level6             = 7,
	PlayerParty_Level7             = 8,
	PlayerParty_Level8             = 9,
	PlayerParty_Level9             = 10,
	EnemyParty_Level0              = 11,
	EnemyParty_Level1              = 12,
	EnemyParty_Level2              = 13,
	EnemyParty_Level3              = 14,
	EnemyParty_Level4              = 15,
	EnemyParty_Level5              = 16,
	EnemyParty_Level6              = 17,
	EnemyParty_Level7              = 18,
	EnemyParty_Level8              = 19,
	EnemyParty_Level9              = 20,
	AnyParty_Level0                = 21,
	AnyParty_Level1                = 22,
	AnyParty_Level2                = 23,
	AnyParty_Level3                = 24,
	AnyParty_Level4                = 25,
	AnyParty_Level5                = 26,
	AnyParty_Level6                = 27,
	AnyParty_Level7                = 28,
	AnyParty_Level8                = 29,
	AnyParty_Level9                = 30,
	EBtlDestructMeshFilter_MAX     = 31
};


// Enum Arise.EBtlDestructFilterLevel
enum class EBtlDestructFilterLevel : uint8_t
{
	NonDestruct                    = 0,
	Level0                         = 1,
	Level1                         = 2,
	Level2                         = 3,
	Level3                         = 4,
	Level4                         = 5,
	Level5                         = 6,
	Level6                         = 7,
	Level7                         = 8,
	Level8                         = 9,
	Level9                         = 10,
	EBtlDestructFilterLevel_MAX    = 11
};


// Enum Arise.EDestructibleType
enum class EDestructibleType : uint8_t
{
	NONE                           = 0,
	SOFT_POWER                     = 1,
	MIDDLE_POWER                   = 2,
	STRONG_POWER                   = 3,
	EDestructibleType_MAX          = 4
};


// Enum Arise.EBtlSystemEffectRank
enum class EBtlSystemEffectRank : uint8_t
{
	Default                        = 0,
	Upper                          = 1,
	Lower                          = 2,
	EBtlSystemEffectRank_MAX       = 3
};


// Enum Arise.EBtlEffectType
enum class EBtlEffectType : uint8_t
{
	Default                        = 0,
	HitEffect                      = 1,
	EBtlEffectType_MAX             = 2
};


// Enum Arise.UBtlEncountEffectWidgetState
enum class EUBtlEncountEffectWidgetState : uint8_t
{
	None                           = 0,
	Start                          = 1,
	Loop                           = 2,
	End                            = 3,
	UBtlEncountEffectWidgetState_MAX = 4
};


// Enum Arise.EBtlFieldAreaDecalActor
enum class EBtlFieldAreaDecalActor : uint8_t
{
	Visible                        = 0,
	Invisible                      = 1,
	FadeIn                         = 2,
	FadeOut                        = 3,
	EBtlFieldAreaDecalActor_MAX    = 4
};


// Enum Arise.EBtlFieldAreaDecal
enum class EBtlFieldAreaDecal : uint8_t
{
	Visible                        = 0,
	Invisible                      = 1,
	FadeIn                         = 2,
	FadeOut                        = 3,
	EBtlFieldAreaDecal_MAX         = 4
};


// Enum Arise.EBtlKnockBackDirectionType
enum class EBtlKnockBackDirectionType : uint8_t
{
	AttackUnitToTarget             = 0,
	AttackCollisionToTarget        = 1,
	TargetToAttackCollision        = 2,
	AttackUnitForward              = 3,
	EBtlKnockBackDirectionType_MAX = 4
};


// Enum Arise.EBtlLearnType_YRA
enum class EBtlLearnType_YRA : uint8_t
{
	STICK                          = 0,
	MAGIC                          = 1,
	HEAL                           = 2,
	NONE                           = 3,
	EBtlLearnType_MAX              = 4
};


// Enum Arise.EBtlLearnType_MNK
enum class EBtlLearnType_MNK : uint8_t
{
	SHIELD                         = 0,
	HEAVY_ATTACK                   = 1,
	COUNTER_ATTACK                 = 2,
	NONE                           = 3,
	EBtlLearnType_MAX              = 4
};


// Enum Arise.EBtlLearnType_ZGU
enum class EBtlLearnType_ZGU : uint8_t
{
	HAND                           = 0,
	FOOT                           = 1,
	KI                             = 2,
	NONE                           = 3,
	EBtlLearnType_MAX              = 4
};


// Enum Arise.EBtlLearnType_NNA
enum class EBtlLearnType_NNA : uint8_t
{
	LIGHT                          = 0,
	WIND                           = 1,
	WATER                          = 2,
	NONE                           = 3,
	EBtlLearnType_MAX              = 4
};


// Enum Arise.EBtlLearnType_SIO
enum class EBtlLearnType_SIO : uint8_t
{
	GUN                            = 0,
	BOMB                           = 1,
	HEAL                           = 2,
	NONE                           = 3,
	EBtlLearnType_MAX              = 4
};


// Enum Arise.EBtlLearnType_ARI
enum class EBtlLearnType_ARI : uint8_t
{
	SWORD                          = 0,
	AIR                            = 1,
	FIRE_SWORD                     = 2,
	NONE                           = 3,
	EBtlLearnType_MAX              = 4
};


// Enum Arise.EBtlLearnType
enum class EBtlLearnType : uint8_t
{
	NONE                           = 0,
	SWORD                          = 1,
	AIR                            = 2,
	FIRE_SWORD                     = 3,
	GUN                            = 4,
	BOMB                           = 5,
	HEAL                           = 6,
	LIGHT                          = 7,
	WIND                           = 8,
	WATER                          = 9,
	HAND                           = 10,
	FOOT                           = 11,
	KI                             = 12,
	SHIELD                         = 13,
	HEAVY_ATTACK                   = 14,
	COUNTER_ATTACK                 = 15,
	STICK                          = 16,
	MAGIC                          = 17,
	EBtlLearnType_MAX              = 18
};


// Enum Arise.EBtlSmashRotateOption
enum class EBtlSmashRotateOption : uint8_t
{
	ROTATE_PLAYER                  = 0,
	ROTATE_FIX                     = 1,
	ROTATE_MAX                     = 2
};


// Enum Arise.EBtlMagicCondition_TurnTargetType
enum class EBtlMagicCondition_TurnTargetType : uint8_t
{
	EnableCorrectionCheck          = 0,
	DisableCorrectionCheck         = 1,
	ManualInputDisableCorrectionCheck = 2,
	EBtlMagicCondition_MAX         = 3
};


// Enum Arise.EBtlMagicConditionCategory
enum class EBtlMagicConditionCategory : uint8_t
{
	Collision                      = 0,
	Extra                          = 1,
	EBtlMagicConditionCategory_MAX = 2
};


// Enum Arise.EBtlMagicTaskCategory
enum class EBtlMagicTaskCategory : uint8_t
{
	Movement                       = 0,
	MovementFilter                 = 1,
	Position                       = 2,
	Rotation                       = 3,
	Collision                      = 4,
	Particle                       = 5,
	SpawnMagic                     = 6,
	Sound                          = 7,
	Mesh                           = 8,
	Development                    = 9,
	Extra                          = 10,
	EBtlMagicTaskCategory_MAX      = 11
};


// Enum Arise.EBtlMagicDestoryFlags
enum class EBtlMagicDestoryFlags : uint8_t
{
	NoFlags                        = 0,
	Down                           = 1,
	CutScene                       = 2,
	UseAllFlags                    = 3,
	DefaultFlags                   = 4,
	EBtlMagicDestoryFlags_MAX      = 5
};


// Enum Arise.EBtlMagicTickingGroup
enum class EBtlMagicTickingGroup : uint8_t
{
	Notify                         = 0,
	NonDependence                  = 1,
	Movement                       = 2,
	MovementFilter                 = 3,
	PostMovement                   = 4,
	Rotation                       = 5,
	PostRotation                   = 6,
	Finalize                       = 7,
	EBtlMagicTickingGroup_MAX      = 8
};


// Enum Arise.EBtlMagicVisiableAdjust
enum class EBtlMagicVisiableAdjust : uint8_t
{
	None                           = 0,
	OwnerUnit                      = 1,
	TargetUnit                     = 2,
	EBtlMagicVisiableAdjust_MAX    = 3
};


// Enum Arise.EBtlMagicRotationOrigin
enum class EBtlMagicRotationOrigin : uint8_t
{
	World                          = 0,
	SELF                           = 1,
	PARENT                         = 2,
	OWNER                          = 3,
	TARGET                         = 4,
	SELF_TO_TARGET                 = 5,
	TARGET_TO_SELF                 = 6,
	EBtlMagicRotationOrigin_MAX    = 7
};


// Enum Arise.EBtlMagicRotationType
enum class EBtlMagicRotationType : uint8_t
{
	ROTATION_OWNER                 = 0,
	ROTATION_TARGET                = 1,
	ROTATION_OWNER_SOCKET          = 2,
	ROTATION_TARGET_SOCKET         = 3,
	ROTATION_MAGIC                 = 4,
	ROTATION_WORLD                 = 5,
	ROTATION_MAX                   = 6
};


// Enum Arise.EBtlMagicLocationType
enum class EBtlMagicLocationType : uint8_t
{
	LOCATION_OWNER                 = 0,
	LOCATION_TARGET                = 1,
	LOCATION_OWNER_SOCKET          = 2,
	LOCATION_TARGET_SOCKET         = 3,
	LOCATION_MAGIC                 = 4,
	LOCATION_WORLD                 = 5,
	LOCATION_MAX                   = 6
};


// Enum Arise.EBtlMagicSpawnCandidateTarget
enum class EBtlMagicSpawnCandidateTarget : uint8_t
{
	PARENT_MAGIC                   = 0,
	OWNER_UNIT_TARGET              = 1,
	EBtlMagicSpawnCandidateTarget_MAX = 2
};


// Enum Arise.EBtlMagicTaskAbortType
enum class EBtlMagicTaskAbortType : uint8_t
{
	SelfOnly                       = 0,
	ChildAll                       = 1,
	All                            = 2,
	EBtlMagicTaskAbortType_MAX     = 3
};


// Enum Arise.EBtlParameterType
enum class EBtlParameterType : uint8_t
{
	Basic                          = 0,
	Skill                          = 1,
	EBtlParameterType_MAX          = 2
};


// Enum Arise.EBtl_NPC_VISMode
enum class EBtl_NPC_VISMode : uint8_t
{
	Default                        = 0,
	ForceTrue                      = 1,
	ForceFalse                     = 2,
	MAX                            = 3
};


// Enum Arise.EBtlDeveloperSettingsLoadType
enum class EBtlDeveloperSettingsLoadType : uint8_t
{
	Default                        = 0,
	Minimal                        = 1,
	PartyLearn_EnemyAll            = 2,
	PartyOnly                      = 3,
	PartyLearnOnly                 = 4,
	EBtlDeveloperSettingsLoadType_MAX = 5
};


// Enum Arise.ERunawayPhase
enum class ERunawayPhase : uint8_t
{
	None                           = 0,
	Runaway                        = 1,
	Successful                     = 2,
	ERunawayPhase_MAX              = 3
};


// Enum Arise.EBattleStateAction
enum class EBattleStateAction : uint8_t
{
	None                           = 0,
	Initialize                     = 1,
	WaitComplete                   = 2,
	Activate                       = 3,
	Execute                        = 4,
	Finalize                       = 5,
	WaitFinalize                   = 6,
	EBattleStateAction_MAX         = 7
};


// Enum Arise.EBtlTimeDilationCategory
enum class EBtlTimeDilationCategory : uint8_t
{
	Default                        = 0,
	FlashRaid                      = 1,
	HitStop                        = 2,
	EBtlTimeDilationCategory_MAX   = 3
};


// Enum Arise.EBtlUnitEventType
enum class EBtlUnitEventType : uint8_t
{
	ARI_FIRE_STATE_CHANGED         = 0,
	SIO_BULLET_COUNT_CHANGED       = 1,
	NNA_STOCK_CHANGED              = 2,
	NNA_MAGIC_CANCELE_RESERVED     = 3,
	ZGU_AWAKE_RANK_CHANGED         = 4,
	MNK_GUARD_IGNITION_RANK_CHANGED = 5,
	MNK_GUARD_IGNITION_STATUS_CHANGED = 6,
	YRA_EXTENSION_RANK_CHANGED     = 7,
	SPELL_SKIPPED                  = 8,
	Num                            = 9,
	EBtlUnitEventType_MAX          = 10
};


// Enum Arise.EAriseSkillEffectScope
enum class EAriseSkillEffectScope : uint8_t
{
	Staying                        = 0,
	BattleOnly                     = 1,
	EAriseSkillEffectScope_MAX     = 2
};


// Enum Arise.EAriseSkillSupportUnit
enum class EAriseSkillSupportUnit : uint8_t
{
	Invalid                        = 0,
	SHARED                         = 1,
	ARI                            = 2,
	SIO                            = 3,
	NNA                            = 4,
	ZGU                            = 5,
	MNK                            = 6,
	YRA                            = 7,
	ARI_MNK                        = 8,
	PARTY                          = 9,
	RESIDENT                       = 10,
	ENEMY                          = 11,
	ALL                            = 12,
	EAriseSkillSupportUnit_MAX     = 13
};


// Enum Arise.EBtlVoiceRelationship
enum class EBtlVoiceRelationship : uint8_t
{
	NON                            = 0,
	SYS                            = 1,
	SB1                            = 2,
	SB2                            = 3,
	UQ1                            = 4,
	UQ2                            = 5,
	SPC                            = 6,
	SB3                            = 7,
	EBtlVoiceRelationship_MAX      = 8
};


// Enum Arise.ECharacterCapturePose
enum class ECharacterCapturePose : uint8_t
{
	CCP_BasePose                   = 0,
	CCP_MAX                        = 1
};


// Enum Arise.EBtlSurfaceParticleSize
enum class EBtlSurfaceParticleSize : uint8_t
{
	SMALL                          = 0,
	MIDDLE                         = 1,
	BIG                            = 2,
	EBtlSurfaceParticleSize_MAX    = 3
};


// Enum Arise.EColKEYCategoryType
enum class EColKEYCategoryType : uint8_t
{
	CATEGORY000                    = 0,
	CATEGORY001                    = 1,
	CATEGORY002                    = 2,
	EColKEYCategoryType_MAX        = 3
};


// Enum Arise.EConfigKey
enum class EConfigKey : uint8_t
{
	CONFIG_SCREEN_MODE             = 0,
	CONFIG_RESOLUTION              = 1,
	CONFIG_VERTIAL_SYNC            = 2,
	CONFIG_FRAMERATE_LIMIT         = 3,
	CONFIG_BLOOM                   = 4,
	CONFIG_MOTION_BLUR             = 5,
	CONFIG_DRAW_SCALE              = 6,
	CONFIG_DRAW_DISTANCE_NPC       = 7,
	CONFIG_DRAW_DISTANCE_OBJECT    = 8,
	CONFIG_DRAW_DISTANCE_GRASS     = 9,
	CONFIG_ANTIALIASING            = 10,
	CONFIG_SHADOW_QUALITY          = 11,
	CONFIG_TEXTURE_QUALITY         = 12,
	CONFIG_EFFECT_QUALITY          = 13,
	CONFIG_POSTPROCESS_QUALITY     = 14,
	CONFIG_SCREEN_SPACE_REFLECTION = 15,
	CONFIG_OCCLUSION_CULLING       = 16,
	CONFIG_ANISOTROPY_FILTERING    = 17,
	CONFIG_FONT_SIZE               = 18,
	CONFIG_DIFFICULTY_LEVEL        = 19,
	CONFIG_PRECEDING_INPUT_TIME    = 20,
	CONFIG_CONTROLLER_VIBRATION    = 21,
	CONFIG_NAVIMAP_ROTATION        = 22,
	CONFIG_QUEST_MARKER_MAIN       = 23,
	CONFIG_QUEST_MARKER_SUB        = 24,
	CONFIG_SUBTITLE_DISPLAY        = 25,
	CONFIG_BTL_CAMERA_SPEED        = 26,
	CONFIG_PF_CAMERA_SPEED         = 27,
	CONFIG_PF_CAMERA_YAW           = 28,
	CONFIG_PF_CAMERA_PITCH         = 29,
	CONFIG_KEY_CONFIGURATION       = 30,
	CONFIG_LIGHT_ADJUST            = 31,
	CONFIG_ANALYSIS_CONFIGURATION  = 32,
	CONFIG_SOUND_OUTPUT            = 33,
	CONFIG_BGM_VOLUME              = 34,
	CONFIG_SE_VOLUME               = 35,
	CONFIG_VOICE_VOLUME            = 36,
	CONFIG_BTL_BGM                 = 37,
	CONFIG_BTL_BGM_DETAILED        = 38,
	CONFIG_INITIAL_SETTING         = 39,
	CONFIG_AMBIENT_OCCLUSION       = 40,
	CONFIG_VOLUMETRIC_LIGHTING     = 41,
	CONFIG_SCREEN_SPACE_SHADOW     = 42,
	CONFIG_GLOBAL_ILLUMINATION     = 43,
	CONFIG_DEPTH_OF_FIELD          = 44,
	CONFIG_LIGHT_SETTING           = 45,
	CONFIG_BTL_BGM_SETTING         = 46,
	CONFIG_GRAPHIC                 = 47,
	CONFIG_GRAPHIC_INITIAL_SETTING = 48,
	CONFIG_CONTROLLER_CONFIGURATOR = 49,
	CONFIG_BTL_CAMERA_CORRECTION_ATTACK = 50,
	CONFIG_BTL_CAMERA_CORRECTION_MOVE = 51,
	CONFIG_BTL_CAMERA_AUTO_UNLOCK  = 52,
	CONFIG_MENU_TEXTURE_QUALITY    = 53,
	TYPE_MAX                       = 54,
	EConfigKey_MAX                 = 55
};


// Enum Arise.ESetting
enum class ESetting : uint8_t
{
	CHOICE                         = 0,
	INT                            = 1,
	CHECKBOX                       = 2,
	GAUGE                          = 3,
	SCENE_CHANGE                   = 4,
	INITIAL                        = 5,
	ANALYSIS                       = 6,
	TYPE_MAX                       = 7,
	ESetting_MAX                   = 8
};


// Enum Arise.EConfigCategory
enum class EConfigCategory : uint8_t
{
	GRAPHICS                       = 0,
	GAME                           = 1,
	LIGHT_SETTING                  = 2,
	BTL_BGM_SETTING                = 3,
	TYPE_MAX                       = 4,
	EConfigCategory_MAX            = 5
};


// Enum Arise.EEncountSymbolState
enum class EEncountSymbolState : uint8_t
{
	ENCSYM_NONE                    = 0,
	ENCSYM_SLEEP                   = 1,
	ENCSYM_ACTIVE                  = 2,
	ENCSYM_ENCOUNT                 = 3,
	ENCSYM_MAX                     = 4
};


// Enum Arise.EEnSymGroupActiveCondision
enum class EEnSymGroupActiveCondision : uint8_t
{
	Always                         = 0,
	Noon                           = 1,
	Night                          = 2,
	EEnSymGroupActiveCondision_MAX = 3
};


// Enum Arise.EULA_Language
enum class EULA_Language : uint8_t
{
	JPN                            = 0,
	ENG                            = 1,
	BRP                            = 2,
	NSP                            = 3,
	FRA                            = 4,
	ITA                            = 5,
	GER                            = 6,
	ESP                            = 7,
	RUS                            = 8,
	TC                             = 9,
	KOR                            = 10,
	EULA_MAX                       = 11
};


// Enum Arise.EEventAssetType
enum class EEventAssetType : uint8_t
{
	Asset_LevelSequencerLoaded     = 0,
	Asset_LevelSequencerManualLoad = 1,
	Asset_StreamLevelManualLoad    = 2,
	Asset_PlayLongChat             = 3,
	Asset_PlayMovie                = 4,
	Asset_EmptyEvent               = 5,
	Asset_MAX                      = 6
};


// Enum Arise.EEventCategory
enum class EEventCategory : uint8_t
{
	MEP                            = 0,
	SUB                            = 1,
	LCH                            = 2,
	SBQ                            = 3,
	SYS                            = 4,
	DBG                            = 5,
	EEventCategory_MAX             = 6
};


// Enum Arise.EEventStreamLoadingState
enum class EEventStreamLoadingState : uint8_t
{
	ESLS_None                      = 0,
	ESLS_Loading                   = 1,
	ESLS_Loaded                    = 2,
	ESLS_Unloading                 = 3,
	ESLS_Unloaded                  = 4,
	ESLS_MAX                       = 5
};


// Enum Arise.EEventPlayState
enum class EEventPlayState : uint8_t
{
	EVST_Standby                   = 0,
	EVST_WaitLoading               = 1,
	EVST_Loaded                    = 2,
	EVST_PreFade                   = 3,
	EVST_PlayingSequencer          = 4,
	EVST_PlayingLongchat           = 5,
	EVST_PlayingMovie              = 6,
	EVST_PlayEnd                   = 7,
	EVST_PostFade                  = 8,
	EVST_LoadingScript             = 9,
	EVST_RunScript                 = 10,
	EVST_ErrorEnd                  = 11,
	EVST_MAX                       = 12
};


// Enum Arise.EEventType
enum class EEventType : uint8_t
{
	BC                             = 0,
	PF                             = 1,
	MV                             = 2,
	AN                             = 3,
	S                              = 4,
	A                              = 5,
	B1                             = 6,
	B2                             = 7,
	NLC                            = 8,
	LC                             = 9,
	SC                             = 10,
	BT                             = 11,
	EEventType_MAX                 = 12
};


// Enum Arise.EFadeMusic
enum class EFadeMusic : uint8_t
{
	None                           = 0,
	FadeIn                         = 1,
	FadeOut                        = 2,
	DuckIn                         = 3,
	DuckOut                        = 4,
	EFadeMusic_MAX                 = 5
};


// Enum Arise.EHelpCategory
enum class EHelpCategory : uint8_t
{
	System                         = 0,
	Battle                         = 1,
	EHelpCategory_MAX              = 2
};


// Enum Arise.EFishingSE
enum class EFishingSE : uint8_t
{
	SE_SYS_FISHING_PUSH            = 0,
	SE_SYS_FISHING_GOOD            = 1,
	SE_SYS_FISHING_EXCELLENT       = 2,
	SE_SYS_FISHING_BAD             = 3,
	SE_SYS_FISHING_QTE_ON          = 4,
	SE_SYS_FISHING_QTE_SUCCESS     = 5,
	SE_SYS_FISHING_DAMAGE_01       = 6,
	SE_SYS_FISHING_DAMAGE_02       = 7,
	SE_SYS_FISHING_DANGER          = 8,
	SE_SYS_FISHING_GET_UNCOMMON    = 9,
	SE_SYS_FISHING_GET             = 10,
	SE_SYS_FISHING_STAR            = 11,
	SE_FOL_FISHING_SWING           = 12,
	SE_FOL_FISHING_LINE            = 13,
	SE_FOL_FISHING_REEL_LOOP       = 14,
	SE_FOL_FISHING_REEL_01         = 15,
	SE_FOL_FISHING_SPLASH_OUT_S_01 = 16,
	SE_FOL_FISHING_SPLASH_OUT_S_02 = 17,
	SE_FOL_FISHING_SPLASH_OUT_S_03 = 18,
	SE_FOL_FISHING_SPLASH_OUT_L_01 = 19,
	SE_FOL_FISHING_SPLASH_OUT_L_02 = 20,
	SE_FOL_FISHING_SPLASH_OUT_L_03 = 21,
	SE_FOL_FISHING_SPLASH_IN_S_01  = 22,
	SE_FOL_FISHING_SPLASH_IN_S_02  = 23,
	SE_FOL_FISHING_SPLASH_IN_S_03  = 24,
	SE_FOL_FISHING_SPLASH_IN_L_01  = 25,
	SE_FOL_FISHING_SPLASH_IN_L_02  = 26,
	SE_FOL_FISHING_SPLASH_IN_L_03  = 27,
	SE_FOL_FISHING_FISH_SWIM_01    = 28,
	SE_FOL_FISING_FISH_MOVE_01     = 29,
	FISHING_SE_MAX                 = 30,
	EFishingSE_MAX                 = 31
};


// Enum Arise.EFishScScene
enum class EFishScScene : uint8_t
{
	FisSCScenePreCast              = 0,
	FisSCScenePreCastRe            = 1,
	FisSCSceneCasting              = 2,
	FisSCScenePickup               = 3,
	FisSCSceneHooking              = 4,
	FisSCSceneFighting             = 5,
	FisSCSceneHookout              = 6,
	FisSCSceneResult               = 7,
	FisSCSceneResultRe             = 8,
	FisSCSceneSizeEval             = 9,
	FisSCSceneSizeEvalRe           = 10,
	EFishScScene_MAX               = 11
};


// Enum Arise.ELureAction
enum class ELureAction : uint8_t
{
	LureActPause                   = 0,
	LureActReel                    = 1,
	LureActTwich                   = 2,
	LureActJark                    = 3,
	ELureAction_MAX                = 4
};


// Enum Arise.ELureType
enum class ELureType : uint8_t
{
	LurePopper                     = 0,
	LurePencil                     = 1,
	LureMinnow                     = 2,
	LureCrank                      = 3,
	LureVibration                  = 4,
	LureMetal                      = 5,
	ELureType_MAX                  = 6
};


// Enum Arise.EFishType
enum class EFishType : uint8_t
{
	FISH_NONE                      = 0,
	FISH_001                       = 1,
	FISH_002                       = 2,
	FISH_003                       = 3,
	FISH_004                       = 4,
	FISH_005                       = 5,
	FISH_006                       = 6,
	FISH_007                       = 7,
	FISH_008                       = 8,
	FISH_009                       = 9,
	FISH_010                       = 10,
	FISH_011                       = 11,
	FISH_012                       = 12,
	FISH_013                       = 13,
	FISH_014                       = 14,
	FISH_015                       = 15,
	FISH_016                       = 16,
	FISH_017                       = 17,
	FISH_018                       = 18,
	FISH_019                       = 19,
	FISH_020                       = 20,
	FISH_021                       = 21,
	FISH_022                       = 22,
	FISH_023                       = 23,
	FISH_024                       = 24,
	FISH_025                       = 25,
	FISH_026                       = 26,
	FISH_027                       = 27,
	FISH_028                       = 28,
	FISH_029                       = 29,
	FISH_030                       = 30,
	FISH_031                       = 31,
	FISH_032                       = 32,
	FISH_033                       = 33,
	FISH_034                       = 34,
	FISH_035                       = 35,
	FISH_036                       = 36,
	FISH_037                       = 37,
	FISH_038                       = 38,
	FISH_039                       = 39,
	FISH_040                       = 40,
	FISH_041                       = 41,
	FISH_042                       = 42,
	FISH_043                       = 43,
	FISH_044                       = 44,
	FISH_045                       = 45,
	FISH_046                       = 46,
	FISH_047                       = 47,
	FISH_048                       = 48,
	FISH_049                       = 49,
	FISH_050                       = 50,
	FISH_MAX                       = 51
};


// Enum Arise.EFishingHotSpotType
enum class EFishingHotSpotType : uint8_t
{
	StaticPoint                    = 0,
	DynamicPoint                   = 1,
	EFishingHotSpotType_MAX        = 2
};


// Enum Arise.EFunctionMountState
enum class EFunctionMountState : uint8_t
{
	UnMount                        = 0,
	UnMounting                     = 1,
	Mount                          = 2,
	Mounting                       = 3,
	EFunctionMountState_MAX        = 4
};


// Enum Arise.EGCManagerCondition
enum class EGCManagerCondition : uint8_t
{
	UsedRelativeBaseline           = 0,
	FreeAbsolute                   = 1,
	EGCManagerCondition_MAX        = 2
};


// Enum Arise.EGCManagerUsage
enum class EGCManagerUsage : uint8_t
{
	GUI                            = 0,
	PF                             = 1,
	USAGE_MAX                      = 2,
	EGCManagerUsage_MAX            = 3
};


// Enum Arise.EItemIconTypeList
enum class EItemIconTypeList : uint8_t
{
	NONE                           = 0,
	DLC                            = 1,
	GUMMI                          = 2,
	BOTTLE                         = 3,
	MATERIAL                       = 4,
	ACCESSORY                      = 5,
	SWORD                          = 6,
	RIFFLE                         = 7,
	BOOK                           = 8,
	GAUNTLET                       = 9,
	SHIELD                         = 10,
	ROD                            = 11,
	ARU                            = 12,
	SIO                            = 13,
	RIN                            = 14,
	ROU                            = 15,
	KIS                            = 16,
	TYU                            = 17,
	BANGLE                         = 18,
	CHECK                          = 19,
	TALISMAN                       = 20,
	EARRING                        = 21,
	NECKLACE                       = 22,
	RING                           = 23,
	MIRACLE                        = 24,
	COSTUME                        = 25,
	HAIR                           = 26,
	ATTACHMENT                     = 27,
	VALUE                          = 28,
	LEAF                           = 29,
	GRAIN                          = 30,
	VEGGIE                         = 31,
	FRUIT                          = 32,
	DAIRYPRODUCT                   = 33,
	MEAT                           = 34,
	SEAFOOD                        = 35,
	MUSHROOM                       = 36,
	SEASONING                      = 37,
	OTHER                          = 38,
	TPJIZO                         = 39,
	POSTCARD                       = 40,
	PIECE                          = 41,
	STATUE                         = 42,
	ANIMAL                         = 43,
	SUBHUM                         = 44,
	INSECT                         = 45,
	NATURE                         = 46,
	WINGED                         = 47,
	DEABLO                         = 48,
	SOLDIER                        = 49,
	SUNDRIES                       = 50,
	RECIPE                         = 51,
	CASH                           = 52,
	FISHING_ROD                    = 53,
	LURE                           = 54,
	ARTIFACT                       = 55,
	EItemIconTypeList_MAX          = 56
};


// Enum Arise.EItemMaxNum
enum class EItemMaxNum : uint8_t
{
	MAXNUM_NONE                    = 0,
	MAXNUM                         = 1,
	MAXNUM01                       = 2,
	MAXNUM02                       = 3,
	MAXNUM03                       = 4,
	MAXNUM04                       = 5,
	MAXNUM_MAX                     = 6
};


// Enum Arise.EItemParameter
enum class EItemParameter : uint8_t
{
	NONE                           = 0,
	HEAL_HP                        = 1,
	HEAL_ALL_HP                    = 2,
	UP_MAX_HP                      = 3,
	RECOVERY                       = 4,
	REVIVE                         = 5,
	GROW_HP                        = 6,
	GROW_PHYSICAL_OFFENSE          = 7,
	GROW_PHYSICAL_DEFENSE          = 8,
	GROW_ELEMENTAL_OFFENSE         = 9,
	GROW_ELEMENTAL_DEFENSE         = 10,
	GROW_PENETRATABILITY           = 11,
	UP_PHYSICAL_OFFENSE            = 12,
	UP_PHYSICAL_DEFENSE            = 13,
	UP_ELEMENTAL_OFFENSE           = 14,
	UP_ELEMENTAL_DEFENSE           = 15,
	UP_PENETRATABILITY             = 16,
	DEF_FILE                       = 17,
	SE_FILE                        = 18,
	BGM_FILE                       = 19,
	HOLY_BOTTLE                    = 20,
	DARK_BOTTLE                    = 21,
	HEAL_TP                        = 22,
	GROW_TP                        = 23,
	GROW_SP                        = 24,
	GROW_DURABILITY                = 25,
	UP_DURABILITY                  = 26,
	PRICE_BUY                      = 27,
	PRICE_SELL                     = 28,
	SPIRIT_BOTTLE                  = 29,
	INGREDIENT_STATUS              = 30,
	RAIRTY                         = 31,
	DISH_COST                      = 32,
	MATERIAL_TYPE                  = 33,
	MATERIAL_ELEMENTAL             = 34,
	ACCESSORY_TYPE                 = 35,
	ACCESSORY_SLOT                 = 36,
	DLC_ID                         = 37,
	STATUE_NEEDAMOUNT              = 38,
	ATTACHED_CHAR                  = 39,
	ATTACHED_ID                    = 40,
	HEAL_ALL_HP_PERCENTAGE         = 41,
	RANDOM_SKILL_RAIRTY            = 42,
	SKILL_ID                       = 43,
	RANDOM_SKILL_RAIRTY_DIRECT     = 44,
	ENABLE_SBF                     = 45,
	JUDGE_CORRECTION               = 46,
	DAMAGE_TO_FISH                 = 47,
	TENSION_CORRECTION             = 48,
	RARITY_CORRECTION              = 49,
	LURE_SCORE                     = 50,
	LURE_TYPE                      = 51,
	ACCESSORY_CATEGORY             = 52,
	VISUALDB_LABEL                 = 53,
	RANDOM_SKILL_RAIRTY_FIX        = 54,
	LURE_TARGET1                   = 55,
	LURE_TARGET2                   = 56,
	LURE_TARGET3                   = 57,
	LURE_TARGET4                   = 58,
	SHARE_PROTECTED                = 59,
	ALL_PARTY_BASE_HP_UP           = 60,
	ALL_PARTY_LEVEL_UP             = 61,
	EItemParameter_MAX             = 62
};


// Enum Arise.EItemCategory
enum class EItemCategory : uint8_t
{
	NONE                           = 0,
	TOOL                           = 1,
	MATERIAL                       = 2,
	WEAPON                         = 3,
	ARMOR                          = 4,
	ACCESSORY                      = 5,
	VALUE                          = 6,
	COSTUME                        = 7,
	DLC                            = 8,
	COOK                           = 9,
	OTHER                          = 10,
	UNIQUE                         = 11,
	EItemCategory_MAX              = 12
};


// Enum Arise.EItemParamStrIndex
enum class EItemParamStrIndex : uint8_t
{
	ITEM_PARAM                     = 0,
	ITEM_PARAM01                   = 1,
	ITEM_PARAM_MAX                 = 2
};


// Enum Arise.EItemParamValueIndex
enum class EItemParamValueIndex : uint8_t
{
	ITEM_PARAM                     = 0,
	ITEM_PARAM01                   = 1,
	ITEM_PARAM02                   = 2,
	ITEM_PARAM03                   = 3,
	ITEM_PARAM_MAX                 = 4
};


// Enum Arise.EItemUnusedType
enum class EItemUnusedType : uint8_t
{
	ITEM_UNUSED_NONE               = 0,
	ITEM_UNUSED_HP_MAX             = 1,
	ITEM_UNUSED_SP_MAX             = 2,
	ITEM_UNUSED_TP_MAX             = 3,
	ITEM_UNUSED_DEAD               = 4,
	ITEM_UNUSED_NO_DEAD            = 5,
	ITEM_UNUSED_ABNORMAL           = 6,
	ITEM_UNUSED_INVALID_ABNORMAL   = 7,
	ITEM_UNUSED_GROW_LIMIT         = 8,
	ITEM_UNUSED_MAX                = 9
};


// Enum Arise.EItemCommonFlag
enum class EItemCommonFlag : uint8_t
{
	ITEM_FLAG_MOVE_USE             = 0,
	ITEM_FLAG_BATTLE_USE           = 1,
	ITEM_FLAG_NO_DROP              = 2,
	ITEM_FLAG_NO_BOOK              = 3,
	ITEM_FLAG_LIMIT_RELEASE        = 4,
	ITEM_FLAG_DELETE_ITEM          = 5,
	ITEM_FLAG_SYSTEM               = 6,
	ITEM_FLAG_COPYRIGHT            = 7,
	ITEM_FLAG_DLC                  = 8,
	ITEM_FLAG_MAX                  = 9
};


// Enum Arise.EItemWorkCategory
enum class EItemWorkCategory : uint8_t
{
	Accessory                      = 0,
	Ore                            = 1,
	EItemWorkCategory_MAX          = 2
};


// Enum Arise.EFastTravelState
enum class EFastTravelState : uint8_t
{
	FT_NOT_FOUND                   = 0,
	FT_ENABLED                     = 1,
	FT_DISABLED                    = 2,
	FT_MAX                         = 3
};


// Enum Arise.EIconDataUsage
enum class EIconDataUsage : uint8_t
{
	USAGE_COMPASS                  = 0,
	USAGE_NAVIGATION_MAP           = 1,
	USAGE_LOCATION_MAP_ICON        = 2,
	USAGE_LOCATION_MAP_FOCUSABLE   = 3,
	USAGE_LOCATION_MAP_STATIC      = 4,
	USAGE_LOCATION_MAP_DYNAMIC     = 5,
	USAGE_MAX                      = 6
};


// Enum Arise.EMapGimmickType
enum class EMapGimmickType : uint8_t
{
	NONE                           = 0,
	CHR_ARI_FIRESWORD              = 1,
	CHR_SIO_HEAL                   = 2,
	CHR_RIN_ELECSHOCK              = 3,
	CHR_LAW_PUNCH                  = 4,
	CHR_KSR_SHIELD                 = 5,
	CHR_TEO_PLANTACTIVE            = 6,
	GNR_ORB                        = 7,
	GNR_ORBSTAND                   = 8,
	MAX                            = 9
};


// Enum Arise.EMapIconPictureEnum
enum class EMapIconPictureEnum : uint8_t
{
	MapIcon_PlayerCharacter        = 0,
	MapIcon_MapIn                  = 1,
	MapIcon_Footprint              = 2,
	MapIcon_KeepOut                = 3,
	MapIcon_MapLink                = 4,
	MapIcon_MainEvent              = 5,
	MapIcon_SubEvent               = 6,
	MapIcon_NPCChat                = 7,
	MapIcon_StrongEnemy            = 8,
	MapIcon_Camp                   = 9,
	MapIcon_Treasure               = 10,
	MapIcon_TreasureOpened         = 11,
	MapIcon_SearchPoint            = 12,
	MapIcon_BreakPoint             = 13,
	MapIcon_SubBefore              = 14,
	MapIcon_SubProgress            = 15,
	MapIcon_SubComplete            = 16,
	MapIcon_OwlPoint               = 17,
	MapIcon_FastTravelPoint        = 18,
	MapIcon_FastTravelPointClear   = 19,
	MapIcon_Inn                    = 20,
	MapIcon_Shop                   = 21,
	MapIcon_WeaponShop             = 22,
	MapIcon_AccessoryShop          = 23,
	MapIcon_Kitchen                = 24,
	MapIcon_QuestDesk              = 25,
	MapIcon_NormalEnemy            = 26,
	MapIcon_FishingPoint           = 27,
	MapIcon_Base                   = 28,
	MapIcon_Hawkers                = 29,
	MapIcon_Gimmick                = 30,
	MapIcon_ShipBefore             = 31,
	MapIcon_ShipAfter              = 32,
	MapIcon_Ladder                 = 33,
	MapIcon_Fall                   = 34,
	MapIcon_Harbor                 = 35,
	MapIcon_Farm                   = 36,
	MapIcon_Fishman                = 37,
	MapIcon_OwlKing                = 38,
	MapIcon_Training               = 39,
	MapIcon_NPCIChat               = 40,
	MapIcon_Elevator               = 41,
	MapIcon_SearchPointGet         = 42,
	MapIcon_BreakPointGet          = 43,
	MapIcon_Hierarchy              = 44,
	MapIcon_None                   = 45,
	MapIcon_MAX                    = 46
};


// Enum Arise.EMapIconType
enum class EMapIconType : uint8_t
{
	None                           = 0,
	MapLink                        = 1,
	KeepOut                        = 2,
	Dungeon                        = 3,
	MapName                        = 4,
	MapIn                          = 5,
	PlayerCharacter                = 6,
	Footprint                      = 7,
	PlayerCamera                   = 8,
	MainEvent                      = 9,
	SubEvent                       = 10,
	SubBefore                      = 11,
	SubProgress                    = 12,
	SubComplete                    = 13,
	NPCChat                        = 14,
	StrongEnemy                    = 15,
	Camp                           = 16,
	Treasure                       = 17,
	TreasureOpened                 = 18,
	SearchPoint                    = 19,
	SearchPointGet                 = 20,
	BreakPoint                     = 21,
	BreakPointGet                  = 22,
	OwlPoint                       = 23,
	FastTravelPoint                = 24,
	FastTravelPointClear           = 25,
	Inn                            = 26,
	Shop                           = 27,
	WeaponShop                     = 28,
	AccessoryShop                  = 29,
	Kitchen                        = 30,
	Harbor                         = 31,
	Farm                           = 32,
	QuestDesk                      = 33,
	NormalEnemy                    = 34,
	FishingPoint                   = 35,
	Base                           = 36,
	Gimmick                        = 37,
	Ladder                         = 38,
	Elevator                       = 39,
	Fall                           = 40,
	Fishman                        = 41,
	OwlKing                        = 42,
	Training                       = 43,
	Hawkers                        = 44,
	NPCIChat                       = 45,
	BothQuest                      = 46,
	RangeArea                      = 47,
	Hierarchy                      = 48,
	ShipBefore                     = 49,
	ShipAfter                      = 50,
	EMapIconType_MAX               = 51
};


// Enum Arise.EMapOrderFolderRegion
enum class EMapOrderFolderRegion : uint8_t
{
	FOLDER_DEBUG                   = 0,
	FOLDER_SHIPPING                = 1,
	FOLDER_DLC1                    = 2,
	FOLDER_MAX                     = 3
};


// Enum Arise.EAriseLLMTag
enum class EAriseLLMTag : uint8_t
{
	Used                           = 0,
	Engine                         = 1,
	UObject                        = 2,
	Animation                      = 3,
	Meshes                         = 4,
	Textures                       = 5,
	RenderTargets                  = 6,
	Particles                      = 7,
	UI                             = 8,
	PhysX                          = 9,
	Audio                          = 10,
	FileSystem                     = 11,
	AsyncLoading                   = 12,
	DerivedDataCache               = 13,
	AssetRegistry                  = 14,
	AriseMisc                      = 15,
	Others                         = 16,
	Untagged                       = 17,
	Free                           = 18,
	EAriseLLMTag_MAX               = 19
};


// Enum Arise.MenuArenaBattleRule
enum class EMenuArenaBattleRule : uint8_t
{
	BattleRule_Single              = 0,
	BattleRule_DownOnly            = 1,
	BattleRule_Fall                = 2,
	BattleRule_Rematch             = 3,
	BattleRule_MAX                 = 4
};


// Enum Arise.MenuArenaStageRank
enum class EMenuArenaStageRank : uint8_t
{
	Rank_Low                       = 0,
	Rank_Middle                    = 1,
	Rank_High                      = 2,
	Rank_Expert                    = 3,
	Rank_MAX                       = 4
};


// Enum Arise.MenuArenaListType
enum class EMenuArenaListType : uint8_t
{
	Type_Character                 = 0,
	Type_Difficulty                = 1,
	Type_MAX                       = 2
};


// Enum Arise.MenuArenaCategory
enum class EMenuArenaCategory : uint8_t
{
	Category_Single                = 0,
	Category_Party                 = 1,
	Category_Special               = 2,
	Category_MAX                   = 3
};


// Enum Arise.EMenuArtsParentType
enum class EMenuArtsParentType : uint8_t
{
	None                           = 0,
	Base                           = 1,
	Derived                        = 2,
	Connect                        = 3,
	EMenuArtsParentType_MAX        = 4
};


// Enum Arise.EMenuArtsPositionType
enum class EMenuArtsPositionType : uint8_t
{
	NoData                         = 0,
	Ground                         = 1,
	Air                            = 2,
	EMenuArtsPositionType_MAX      = 3
};


// Enum Arise.EMenuArtsType
enum class EMenuArtsType : uint8_t
{
	Ground                         = 0,
	Air                            = 1,
	Strike                         = 2,
	Mystic                         = 3,
	ArtsList                       = 4,
	Magic                          = 5,
	AntiAir                        = 6,
	AntiGround                     = 7,
	NoData                         = 8,
	EMenuArtsType_MAX              = 9
};


// Enum Arise.EMenuBattleOperateType
enum class EMenuBattleOperateType : uint8_t
{
	Operate_Auto                   = 0,
	Operate_Semiauto               = 1,
	Operate_Manual                 = 2,
	Operate_MAX                    = 3
};


// Enum Arise.MenuModelMotionType
enum class EMenuModelMotionType : uint8_t
{
	Normal                         = 0,
	DLC1                           = 1,
	DLC2                           = 2,
	DLC3                           = 3,
	DLC4                           = 4,
	DLC5                           = 5,
	DLC6                           = 6,
	DLC7                           = 7,
	DLC8                           = 8,
	DLC9                           = 9,
	None                           = 10,
	MenuModelMotionType_MAX        = 11
};


// Enum Arise.EMenuTopModelSortType
enum class EMenuTopModelSortType : uint8_t
{
	ID                             = 0,
	Order                          = 1,
	EMenuTopModelSortType_MAX      = 2
};


// Enum Arise.EMenuVisualSlotType
enum class EMenuVisualSlotType : uint8_t
{
	Hair                           = 0,
	Costume                        = 1,
	Attach1                        = 2,
	Attach2                        = 3,
	Weapon                         = 4,
	EMenuVisualSlotType_MAX        = 5
};


// Enum Arise.EMenuEquipItemSortType
enum class EMenuEquipItemSortType : uint8_t
{
	None                           = 0,
	Default                        = 1,
	Attack                         = 2,
	ElementAttack                  = 3,
	Defence                        = 4,
	ElementDefence                 = 5,
	Penetrate                      = 6,
	Endurance                      = 7,
	New                            = 8,
	EMenuEquipItemSortType_MAX     = 9
};


// Enum Arise.EFarmAnimalType
enum class EFarmAnimalType : uint8_t
{
	AnimalType_Farm                = 0,
	AnimalType_Support             = 1,
	AnimalType_Other               = 2,
	AnimalType_MAX                 = 3
};


// Enum Arise.PFAnimalNo
enum class EPFAnimalNo : uint8_t
{
	None                           = 0,
	Cow                            = 1,
	Pig                            = 2,
	Chicken                        = 3,
	Horse                          = 4,
	Sheep                          = 5,
	Bousagi                        = 6,
	Dog                            = 7,
	Cat                            = 8,
	Mouse                          = 9,
	MAX                            = 10
};


// Enum Arise.PFAnimalGender
enum class EPFAnimalGender : uint8_t
{
	Male                           = 0,
	Female                         = 1,
	Other                          = 2,
	MAX                            = 3
};


// Enum Arise.PFAnimalGrowState
enum class EPFAnimalGrowState : uint8_t
{
	Child                          = 0,
	Adult                          = 1,
	MAX                            = 2
};


// Enum Arise.PFAnimalArea
enum class EPFAnimalArea : uint8_t
{
	Area_Outdoor                   = 0,
	Area_Indoor                    = 1,
	MAX                            = 2
};


// Enum Arise.MenuFarmMessageType
enum class EMenuFarmMessageType : uint8_t
{
	None                           = 0,
	Complete                       = 1,
	Failure                        = 2,
	Damage                         = 3,
	SubErase_Dog                   = 4,
	SubErase_Cat                   = 5,
	SubErase_Multi                 = 6,
	AnimalPlus                     = 7,
	SpacePlus                      = 8,
	MenuFarmMessageType_MAX        = 9
};


// Enum Arise.MenuFarmPlantStatus
enum class EMenuFarmPlantStatus : uint8_t
{
	None                           = 0,
	NoLeave                        = 1,
	Leave                          = 2,
	Complete                       = 3,
	Failure                        = 4,
	MenuFarmPlantStatus_MAX        = 5
};


// Enum Arise.EMenuItemUsableType
enum class EMenuItemUsableType : uint8_t
{
	Unuse                          = 0,
	HP                             = 1,
	Status                         = 2,
	Other                          = 3,
	AddItem                        = 4,
	EMenuItemUsableType_MAX        = 5
};


// Enum Arise.EMapOrderManager_MapVisibledResult
enum class EMapOrderManager_MapVisibledResult : uint8_t
{
	VisibledAllLevel               = 0,
	Error_UnknownMap               = 1,
	Error_LevelNotValid            = 2,
	Error_LevelNotVisibled         = 3,
	EMapOrderManager_MAX           = 4
};


// Enum Arise.EMenuItemFilterType
enum class EMenuItemFilterType : uint8_t
{
	None                           = 0,
	Recovery                       = 1,
	Using                          = 2,
	StatusUp                       = 3,
	Eat                            = 4,
	Food                           = 5,
	Material                       = 6,
	Weapon_ARI                     = 7,
	Weapon_SIO                     = 8,
	Weapon_NNA                     = 9,
	Weapon_ZGU                     = 10,
	Weapon_MNK                     = 11,
	Weapon_YRA                     = 12,
	Protecter_Man                  = 13,
	Protecter_Woman                = 14,
	Protecter_Combinate            = 15,
	Armor_ARI                      = 16,
	Armor_SIO                      = 17,
	Armor_NNA                      = 18,
	Armor_ZGU                      = 19,
	Armor_MNK                      = 20,
	Armor_YRA                      = 21,
	Skill_A                        = 22,
	Skill_B                        = 23,
	Skill_C                        = 24,
	EMenuItemFilterType_MAX        = 25
};


// Enum Arise.EMenuItemSortType
enum class EMenuItemSortType : uint8_t
{
	ItemID                         = 0,
	NewGet                         = 1,
	Rarity                         = 2,
	Price                          = 3,
	Num                            = 4,
	Attack                         = 5,
	MAttack                        = 6,
	Penetrate                      = 7,
	Defence                        = 8,
	MDefence                       = 9,
	Endurance                      = 10,
	HP                             = 11,
	SP                             = 12,
	Rank                           = 13,
	Skill                          = 14,
	Cost                           = 15,
	Name                           = 16,
	Sall                           = 17,
	EMenuItemSortType_MAX          = 18
};


// Enum Arise.MenuCategoryUsingType
enum class EMenuCategoryUsingType : uint8_t
{
	NONE                           = 0,
	HEAL_HP                        = 1,
	HEAL_HP_ALL                    = 2,
	BOOST_HP                       = 3,
	HEAL_TP                        = 4,
	HP_UP                          = 5,
	SP_UP                          = 6,
	ATK_UP                         = 7,
	DEF_UP                         = 8,
	EAT_UP                         = 9,
	EDF_UP                         = 10,
	PEN_UP                         = 11,
	END_UP                         = 12,
	HOLY_BOTTLE                    = 13,
	DARK_BOTTLE                    = 14,
	SPIRIT_BOTTLE                  = 15,
	GROW_TP                        = 16,
	HEAL_HP_ALL01                  = 17,
	REVIVE                         = 18,
	HEAL_HP_FULL                   = 19,
	RECOVERY                       = 20,
	LV_UP                          = 21,
	CP_UP                          = 22,
	HP_UP_ALL                      = 23,
	MenuCategoryUsingType_MAX      = 24
};


// Enum Arise.EMenuItemCategory
enum class EMenuItemCategory : uint8_t
{
	None                           = 0,
	Use                            = 1,
	Material                       = 2,
	Weapon                         = 3,
	Protector                      = 4,
	Accessory                      = 5,
	Visual                         = 6,
	Valuable                       = 7,
	Download                       = 8,
	Other                          = 9,
	Battle                         = 10,
	Cook                           = 11,
	New                            = 12,
	Material_Acc                   = 13,
	EMenuItemCategory_MAX          = 14
};


// Enum Arise.EMenuDlcItemCategory
enum class EMenuDlcItemCategory : uint8_t
{
	None                           = 0,
	Use                            = 1,
	Material                       = 2,
	Weapon                         = 3,
	Visual                         = 4,
	Artifact                       = 5,
	Music                          = 6,
	Other                          = 7,
	New                            = 8,
	EMenuDlcItemCategory_MAX       = 9
};


// Enum Arise.EWidgetUse
enum class EWidgetUse : uint8_t
{
	LEVEL                          = 0,
	CAPTURE                        = 1,
	BTL_BG                         = 2,
	STARMAP                        = 3,
	WORLDMAP                       = 4,
	MAIN                           = 5,
	HELP                           = 6,
	FRAME                          = 7,
	MENU_SC                        = 8,
	HEADER                         = 9,
	HEADER3D                       = 10,
	TOP_BG                         = 11,
	TOP_PARTICLE                   = 12,
	POST_PROC                      = 13,
	LIGHT                          = 14,
	EWidgetUse_MAX                 = 15
};


// Enum Arise.MenuSEType
enum class EMenuSEType : uint8_t
{
	MENU_IN                        = 0,
	MENU_OUT                       = 1,
	CURSOR                         = 2,
	CURSOR_TOP                     = 3,
	CURSOR_SUB                     = 4,
	DECISION                       = 5,
	CANCEL                         = 6,
	BEEP                           = 7,
	HEAL_HP                        = 8,
	TYPE_END                       = 9,
	MenuSEType_MAX                 = 10
};


// Enum Arise.MenuPad
enum class EMenuPad : uint8_t
{
	LEFT_UP                        = 0,
	LEFT_DOWN                      = 1,
	LEFT_LEFT                      = 2,
	LEFT_RIGHT                     = 3,
	RIGHT_UP                       = 4,
	RIGHT_DOWN                     = 5,
	RIGHT_LEFT                     = 6,
	RIGHT_RIGHT                    = 7,
	L1                             = 8,
	L2                             = 9,
	L3                             = 10,
	R1                             = 11,
	R2                             = 12,
	R3                             = 13,
	START                          = 14,
	SELECT                         = 15,
	DECIDE                         = 16,
	CANCEL                         = 17,
	LS_UP                          = 18,
	LS_DOWN                        = 19,
	LS_LEFT                        = 20,
	LS_RIGHT                       = 21,
	RS_UP                          = 22,
	RS_DOWN                        = 23,
	RS_LEFT                        = 24,
	RS_RIGHT                       = 25,
	NUM                            = 26,
	MenuPad_MAX                    = 27
};


// Enum Arise.EMenuModelPositionSaveType
enum class EMenuModelPositionSaveType : uint8_t
{
	Equip                          = 0,
	Visual                         = 1,
	Weapon                         = 2,
	Status                         = 3,
	DLC                            = 4,
	EMenuModelPositionSaveType_MAX = 5
};


// Enum Arise.EMenuFarmAreaType
enum class EMenuFarmAreaType : uint8_t
{
	Stock                          = 0,
	Farm                           = 1,
	All                            = 2,
	EMenuFarmAreaType_MAX          = 3
};


// Enum Arise.ESaveDataHeaderParam
enum class ESaveDataHeaderParam : uint8_t
{
	PARAM_PACKED_00                = 0,
	PARAM_LEVEL                    = 1,
	PARAM_PACKED_01                = 2,
	PARAM_LOCATION_ID              = 3,
	PARAM_IMAGE_ENABLED            = 4,
	PARAM_MAIN_QUEST_ID            = 5,
	PARAM_RESERVED                 = 6,
	PARAM_APP_VERSION              = 7,
	PARAM_SC                       = 8,
	PARAM_MAX                      = 9
};


// Enum Arise.ETitleDemoMovieType
enum class ETitleDemoMovieType : uint8_t
{
	DEMO_MOVIE_NONE                = 0,
	DEMO_MOVIE_01                  = 1,
	DEMO_MOVIE_02                  = 2,
	DEMO_MOVIE_MAX                 = 3
};


// Enum Arise.MenuCategoryIconType
enum class EMenuCategoryIconType : uint8_t
{
	ICON_USE                       = 0,
	ICON_MATERIAL                  = 1,
	ICON_VALUE                     = 2,
	ICON_OTHER                     = 3,
	ICON_ALL                       = 4,
	ICON_WEAPON                    = 5,
	ICON_ARMOR                     = 6,
	ICON_ACCESSORY                 = 7,
	ICON_QUEST_MAIN                = 8,
	ICON_QUEST_SUB                 = 9,
	ICON_QUEST_WANTED              = 10,
	ICON_CHECK                     = 11,
	ICON_TALISMAN                  = 12,
	ICON_JEWEL                     = 13,
	ICON_BOOTS                     = 14,
	ICON_FEATHER                   = 15,
	ICON_CROSS                     = 16,
	ICON_SPECIAL                   = 17,
	ICON_CHAT                      = 18,
	ICON_MOVIE                     = 19,
	ICON_MEAT                      = 20,
	ICON_FISH                      = 21,
	ICON_VEGETABLE                 = 22,
	ICON_GRAIN                     = 23,
	ICON_DESSERT                   = 24,
	ICON_ENEMY                     = 25,
	ICON_BOSS                      = 26,
	ICON_SYSTEM                    = 27,
	ICON_BATTLE                    = 28,
	ICON_COLLECTION                = 29,
	ICON_SELECT                    = 30,
	ICON_EFFECTGUARD               = 31,
	ICON_STATE_UP                  = 32,
	ICON_ETC                       = 33,
	ICON_NEW                       = 34,
	ICON_BLANK                     = 35,
	ICON_MAX                       = 36
};


// Enum Arise.MenuIconType
enum class EMenuIconType : uint8_t
{
	ITEM                           = 0,
	ORDER                          = 1,
	TACTICS                        = 2,
	EQUIP                          = 3,
	ARTS                           = 4,
	ALIAS                          = 5,
	LIBRARY                        = 6,
	BOOK                           = 7,
	Space09                        = 8,
	SAVE                           = 9,
	LOAD                           = 10,
	CONFIG                         = 11,
	STATUS                         = 12,
	VISUAL                         = 13,
	COOKING                        = 14,
	CAMP                           = 15,
	INDEFINITE                     = 16,
	PAUSE                          = 17,
	INN                            = 18,
	MENU                           = 19,
	RECALL                         = 20,
	DEPART                         = 21,
	SHOP                           = 22,
	ACCESSORY                      = 23,
	WEAPON                         = 24,
	LOCATIONMAP                    = 25,
	FASTTRAVEL                     = 26,
	ESCAPE                         = 27,
	FARM                           = 28,
	RELIC                          = 29,
	TRAINING                       = 30,
	DLCSHOP                        = 31,
	EAT                            = 32,
	MenuIconType_MAX               = 33
};


// Enum Arise.MenuShopItemSortType
enum class EMenuShopItemSortType : uint8_t
{
	ID                             = 0,
	NAME                           = 1,
	PRICE                          = 2,
	GETTIME                        = 3,
	SALE                           = 4,
	ATTACK                         = 5,
	EATTACK                        = 6,
	PENETRATE                      = 7,
	DEFFENCE                       = 8,
	EDEFFENCE                      = 9,
	ENDURANCE                      = 10,
	MenuShopItemSortType_MAX       = 11
};


// Enum Arise.MenuShopItemCategory
enum class EMenuShopItemCategory : uint8_t
{
	ALL                            = 0,
	USE                            = 1,
	MATERIAL                       = 2,
	WEAPON                         = 3,
	ARMOR                          = 4,
	ACCESSORY                      = 5,
	MATERIAL_ACC                   = 6,
	ETC                            = 7,
	CATEGORY_MAX                   = 8,
	MenuShopItemCategory_MAX       = 9
};


// Enum Arise.EMenuWeaponRecipeSortType
enum class EMenuWeaponRecipeSortType : uint8_t
{
	Default                        = 0,
	Name                           = 1,
	GetTime                        = 2,
	Attack                         = 3,
	ElementAttack                  = 4,
	Penetrate                      = 5,
	EMenuWeaponRecipeSortType_MAX  = 6
};


// Enum Arise.EMenuSkillPanelCategory
enum class EMenuSkillPanelCategory : uint8_t
{
	CATE_SCENARIO                  = 0,
	CATE_SUBQUE                    = 1,
	CATE_YARIKOMI                  = 2,
	CATE_DLC                       = 3,
	CATE_MAX                       = 4
};


// Enum Arise.EMenuTopID
enum class EMenuTopID : uint8_t
{
	ID_CHAP00                      = 0,
	ID_CHAP01                      = 1,
	ID_CHAP02                      = 2,
	ID_CHAP03                      = 3,
	ID_CHAP04                      = 4,
	ID_CHAP05                      = 5,
	ID_CHAP06                      = 6,
	ID_CHAP07                      = 7,
	ID_CHAP08                      = 8,
	ID_CHAP09                      = 9,
	ID_CHAP10                      = 10,
	ID_CHAP11                      = 11,
	ID_CHAP12                      = 12,
	ID_CHAP13                      = 13,
	ID_CHAP14                      = 14,
	ID_CHAP15                      = 15,
	ID_TTL                         = 16,
	ID_DLC                         = 17,
	ID_CLR                         = 18,
	ID_MAP                         = 19,
	ID_TIT                         = 20,
	ID_MAX                         = 21
};


// Enum Arise.EMinimapIcon
enum class EMinimapIcon : uint8_t
{
	PlayerCharacter                = 0,
	InvasionLocation               = 1,
	Footprint                      = 2,
	Marker                         = 3,
	MapLink                        = 4,
	MainEvent                      = 5,
	SubEvent                       = 6,
	NPCChat                        = 7,
	StrongEnemy                    = 8,
	Camp                           = 9,
	Town                           = 10,
	Dungeon                        = 11,
	Field                          = 12,
	EMinimapIcon_MAX               = 13
};


// Enum Arise.EOpenRecipe
enum class EOpenRecipe : uint8_t
{
	NONE                           = 0,
	GET_WEAPON                     = 1,
	CLEAR_QUEST                    = 2,
	CLEAR_EVENT                    = 3,
	HAS_MAIN_ALIAS                 = 4,
	GET_SUB_ALIAS                  = 5,
	IS_ITEM                        = 6,
	GET_WEAPON_RECIPE              = 7,
	CREATE_WEAPON_RECIPE           = 8,
	USE_WEAPON                     = 9,
	CREATE_COOK_RECIPIE            = 10,
	GET_COOK_RECIPIE               = 11,
	AWAKE_QUEST                    = 12,
	ACCEPT_QUEST                   = 13,
	EOpenRecipe_MAX                = 14
};


// Enum Arise.EPFCommonDatabaseKey
enum class EPFCommonDatabaseKey : uint8_t
{
	ScriptCameraPreset             = 0,
	CampDatabase                   = 1,
	CampCameraPreset               = 2,
	FishingRewardItem              = 3,
	MAX                            = 4
};


// Enum Arise.EPFDelegateType
enum class EPFDelegateType : uint8_t
{
	EnableControl                  = 0,
	DisableControl                 = 1,
	EPFDelegateType_MAX            = 2
};


// Enum Arise.EEnSymBoolPin
enum class EEnSymBoolPin : uint8_t
{
	SUCCESS                        = 0,
	FAILED                         = 1,
	EEnSymBoolPin_MAX              = 2
};


// Enum Arise.EMenuBGType
enum class EMenuBGType : uint8_t
{
	BG_NONE                        = 0,
	BG_THROUGH                     = 1,
	BG_CAPTURE                     = 2,
	BG_LEVEL                       = 3,
	BG_WORLDMAP                    = 4,
	BG_STARMAP                     = 5,
	BG_BTLTOP                      = 6,
	BG_TOP                         = 7,
	BG_TOP_TTL                     = 8,
	BG_TOP_DLC                     = 9,
	BG_TOP_CLR                     = 10,
	BG_TOP_MAP                     = 11,
	BG_TOP_TIT                     = 12,
	BG_MAX                         = 13
};


// Enum Arise.EEnSymFloatType
enum class EEnSymFloatType : uint8_t
{
	ExpriationAge                  = 0,
	LostTime                       = 1,
	ChaseTime                      = 2,
	DeleteTime                     = 3,
	GiveupTime                     = 4,
	RushTime                       = 5,
	TurnBlendSpace                 = 6,
	RandomMoveYaw                  = 7,
	RandomMoveLength               = 8,
	EEnSymFloatType_MAX            = 9
};


// Enum Arise.EEnSymBoolType
enum class EEnSymBoolType : uint8_t
{
	SearchArea                     = 0,
	MoveRoute                      = 1,
	Perception                     = 2,
	FindedTarget                   = 3,
	Moving                         = 4,
	BackMoveRoute                  = 5,
	EntrySearchArea                = 6,
	FollowStart                    = 7,
	DeleteSymbol                   = 8,
	Escape                         = 9,
	CanEscape                      = 10,
	CheckEscape                    = 11,
	RunStateWait                   = 12,
	LockFinded                     = 13,
	AIPaused                       = 14,
	Repop                          = 15,
	Sound                          = 16,
	BackHome                       = 17,
	RushBreak                      = 18,
	EEnSymBoolType_MAX             = 19
};


// Enum Arise.EEnSymRotatorType
enum class EEnSymRotatorType : uint8_t
{
	HomeRotator                    = 0,
	EEnSymRotatorType_MAX          = 1
};


// Enum Arise.EEnSymVectorType
enum class EEnSymVectorType : uint8_t
{
	HomeLocation                   = 0,
	LastTargetLocation             = 1,
	LastSelfLocation               = 2,
	WanderingAreaSize              = 3,
	MovePoint                      = 4,
	EscapeDir                      = 5,
	GoalLocation                   = 6,
	RandomMoveRangeMin             = 7,
	RandomMoveRangeMax             = 8,
	LastMovedLocation              = 9,
	EEnSymVectorType_MAX           = 10
};


// Enum Arise.EEnSymSizeType
enum class EEnSymSizeType : uint8_t
{
	SIZE_SMALL                     = 0,
	SIZE_DEFAULT                   = 1,
	SIZE_LARGE                     = 2,
	_SIZE_MAX                       = 3
};


// Enum Arise.EEnSymFollowType
enum class EEnSymFollowType : uint8_t
{
	FOLLOW_TYPE_NORMAL             = 0,
	FOLLOW_TYPE_RUSH               = 1,
	FOLLOW_TYPE_SILENCE            = 2,
	FOLLOW_TYPE_MAX                = 3
};


// Enum Arise.EEnSymWanderingType
enum class EEnSymWanderingType : uint8_t
{
	WANDERING_TYPE_WAIT            = 0,
	WANDERING_TYPE_WANDER          = 1,
	WANDERING_TYPE_AIR             = 2,
	WANDERING_TYPE_ROUTE           = 3,
	WANDERING_TYPE_ROUTE_BACK      = 4,
	WANDERING_TYPE_MAX             = 5
};


// Enum Arise.EEnSymWaitType
enum class EEnSymWaitType : uint8_t
{
	WAIT_TYPE_NONE                 = 0,
	WAIT_TYPE_WAITING              = 1,
	WAIT_TYPE_GROUND               = 2,
	WAIT_TYPE_MIMIC                = 3,
	WAIT_TYPE_CEIL                 = 4,
	WAIT_TYPE_MAX                  = 5
};


// Enum Arise.EPFLightweightNpcAction
enum class EPFLightweightNpcAction : uint8_t
{
	Idle                           = 0,
	Walk                           = 1,
	EPFLightweightNpcAction_MAX    = 2
};


// Enum Arise.EPFNavAreaFlag
enum class EPFNavAreaFlag : uint8_t
{
	Unknown                        = 0,
	Door                           = 1,
	Jump                           = 2,
	Fly                            = 3,
	Self                           = 4,
	EPFNavAreaFlag_MAX             = 5
};


// Enum Arise.EPFNpcActorWalk
enum class EPFNpcActorWalk : uint8_t
{
	Walk                           = 0,
	Run                            = 1,
	EPFNpcActorWalk_MAX            = 2
};


// Enum Arise.EPFNpcAnimPlayActionLoop
enum class EPFNpcAnimPlayActionLoop : uint8_t
{
	Default                        = 0,
	NeverLoop                      = 1,
	ForeverLoop                    = 2,
	EPFNpcAnimPlayActionLoop_MAX   = 3
};


// Enum Arise.EPFNpcCameraFadingMode
enum class EPFNpcCameraFadingMode : uint8_t
{
	Far                            = 0,
	Near                           = 1,
	EPFNpcCameraFadingMode_MAX     = 2
};


// Enum Arise.EPFNpcSpawnPriority
enum class EPFNpcSpawnPriority : uint8_t
{
	Normal                         = 0,
	AboveNormal                    = 1,
	Middle                         = 2,
	AboveMiddle                    = 3,
	High                           = 4,
	AboveHigh                      = 5,
	Highest                        = 6,
	EPFNpcSpawnPriority_MAX        = 7
};


// Enum Arise.EPFNpcWeaponVisibleType
enum class EPFNpcWeaponVisibleType : uint8_t
{
	Default                        = 0,
	Invisible                      = 1,
	Visible_Mount                  = 2,
	Visible_Unmount                = 3,
	EPFNpcWeaponVisibleType_MAX    = 4
};


// Enum Arise.EPFNpcSymbolIcon
enum class EPFNpcSymbolIcon : uint8_t
{
	Talk                           = 0,
	Search                         = 1,
	MainQuest                      = 2,
	SubQuest                       = 3,
	EPFNpcSymbolIcon_MAX           = 4
};


// Enum Arise.EPFNpcActInfoType
enum class EPFNpcActInfoType : uint8_t
{
	NPC_ACTINFO_TALK               = 0,
	NPC_ACTINFO_SEARCH             = 1,
	NPC_ACTINFO_MAX                = 2
};


// Enum Arise.EPFNpcCharacterSpawnType
enum class EPFNpcCharacterSpawnType : uint8_t
{
	Unknown                        = 0,
	Stand                          = 1,
	Walk                           = 2,
	Event                          = 3,
	Camp                           = 4,
	EPFNpcCharacterSpawnType_MAX   = 5
};


// Enum Arise.EPFNpcInteractionType
enum class EPFNpcInteractionType : uint8_t
{
	NPC_INTERACTION_NONE           = 0,
	NPC_INTERACTION_ONETOP         = 1,
	NPC_INTERACTION_EVENT          = 2,
	NPC_INTERACTION_SHOP           = 3,
	NPC_INTERACTION_INN            = 4,
	NPC_INTERACTION_QUEST_CLIENT   = 5,
	NPC_INTERACTION_QUEST_INFORMATION = 6,
	NPC_INTERACTION_QUEST_MAIN     = 7,
	NPC_INTERACTION_SHOP_BLACKSMITH = 8,
	NPC_INTERACTION_SHOP_ACCESSORY = 9,
	NPC_INTERACTION_SHIP           = 10,
	NPC_INTERACTION_OWL            = 11,
	NPC_INTERACTION_UTILITY        = 12,
	NPC_INTERACTION_RECOVERY       = 13,
	NPC_INTERACTION_FARM           = 14,
	NPC_INTERACTION_COLOSSEUM      = 15,
	NPC_INTERACTION_INFORMATION    = 16,
	NPC_INTERACTION_GENERAL_STORE  = 17,
	NPC_INTERACTION_INJURED_PERSON = 18,
	NPC_INTERACTION_FISHING_TACKLE = 19,
	NPC_INTERACTION_QUEST_ORDER    = 20,
	NPC_INTERACTION_QUEST_REPORT   = 21,
	NPC_INTERACTION_QUEST_TARGET   = 22,
	NPC_INTERACTION_PERCH          = 23,
	NPC_INTERACTION_MAX            = 24
};


// Enum Arise.ENpcDatabaseKey
enum class ENpcDatabaseKey : uint8_t
{
	DefineData_Release             = 0,
	DefineData_Debug               = 1,
	FacialPreset                   = 2,
	MAX                            = 3
};


// Enum Arise.EPFNpcInteraction
enum class EPFNpcInteraction : uint8_t
{
	InteractionTalk                = 0,
	InteractionEvent               = 1,
	EPFNpcInteraction_MAX          = 2
};


// Enum Arise.EPFNpcWalkCollideShape
enum class EPFNpcWalkCollideShape : uint8_t
{
	None                           = 0,
	Capsule                        = 1,
	Box                            = 2,
	EPFNpcWalkCollideShape_MAX     = 3
};


// Enum Arise.EOneTopDatabaseKey
enum class EOneTopDatabaseKey : uint8_t
{
	OneTopData_Release             = 0,
	OneTopData_Debug               = 1,
	MAX                            = 2
};


// Enum Arise.EPlacementDatabaseKey
enum class EPlacementDatabaseKey : uint8_t
{
	BreakPoint                     = 0,
	SearchPoint                    = 1,
	TreasurePoint                  = 2,
	TPObject                       = 3,
	FastTravelPoint                = 4,
	FacilityPoint                  = 5,
	OwlPoint                       = 6,
	CampPoint                      = 7,
	FishingPoint                   = 8,
	CookingPoint                   = 9,
	BountyEnemyPoint               = 10,
	PlayerPassBlocking             = 11,
	MainQuestPoint                 = 12,
	MapGimmick                     = 13,
	NpcPoint                       = 14,
	LadderPoint                    = 15,
	FallingPoint                   = 16,
	NpcTalk                        = 17,
	SearchModel                    = 18,
	SearchPointItem                = 19,
	TreasurePointItem              = 20,
	SearchOwl                      = 21,
	MiningPointItem                = 22,
	EncountSymbol                  = 23,
	RecoveryPoint                  = 24,
	StarShipPoint                  = 25,
	MAX                            = 26
};


// Enum Arise.EPFPlacementInteraction
enum class EPFPlacementInteraction : uint8_t
{
	Unknown                        = 0,
	BreakPoint                     = 1,
	SearchPoint                    = 2,
	TreasurePoint                  = 3,
	TPObject                       = 4,
	FastTravelPoint                = 5,
	OwlPoint                       = 6,
	CampPoint                      = 7,
	FishingPoint                   = 8,
	CookingPoint                   = 9,
	BountyEnemyPoint               = 10,
	PlayerPassBlocking             = 11,
	MainQuestPoint                 = 12,
	MapGimmick                     = 13,
	RecoveryPoint                  = 14,
	NumMaxPoint                    = 15,
	EPFPlacementInteraction_MAX    = 16
};


// Enum Arise.EPFNpcSpawnType
enum class EPFNpcSpawnType : uint8_t
{
	PlayerFree                     = 0,
	Event                          = 1,
	EPFNpcSpawnType_MAX            = 2
};


// Enum Arise.EPFNpcSpawnStatus
enum class EPFNpcSpawnStatus : uint8_t
{
	HasEvent                       = 0,
	HasQuest                       = 1,
	HasShortChat                   = 2,
	HasFacility                    = 3,
	HasOneTop                      = 4,
	Mob                            = 5,
	EPFNpcSpawnStatus_MAX          = 6
};


// Enum Arise.EPFNpcTalkReaction
enum class EPFNpcTalkReaction : uint8_t
{
	NPC_TALK_REACTION_KEEP         = 0,
	NPC_TALK_REACTION_LOOKAT       = 1,
	NPC_TALK_REACTION_TURN         = 2,
	NPC_TALK_REACTION_MAX          = 3
};


// Enum Arise.EPFNpcCollideShape
enum class EPFNpcCollideShape : uint8_t
{
	NPC_COLLIDE_SHAPE_NONE         = 0,
	NPC_COLLIDE_SHAPE_CAPSULE      = 1,
	NPC_COLLIDE_SHAPE_BOX          = 2,
	NPC_COLLIDE_SHAPE_MAX          = 3
};


// Enum Arise.EPFNpcSpline
enum class EPFNpcSpline : uint8_t
{
	NPC_SPLINE_NORMAL              = 0,
	NPC_SPLINE_REVERSE             = 1,
	NPC_SPLINE_MAX                 = 2
};


// Enum Arise.EPFNpcMoveSpeed
enum class EPFNpcMoveSpeed : uint8_t
{
	NPC_MOVE_SPEED_WALK            = 0,
	NPC_MOVE_SPEED_RUN             = 1,
	NPC_MOVE_SPEED_MAX             = 2
};


// Enum Arise.EPFNpcIdle
enum class EPFNpcIdle : uint8_t
{
	NPC_IDLE_NEUTRAL               = 0,
	NPC_IDLE_WORK                  = 1,
	NPC_IDLE_MAX                   = 2
};


// Enum Arise.EPFNpcBehavior
enum class EPFNpcBehavior : uint8_t
{
	NPC_BEHAVIOR_BLANK             = 0,
	NPC_BEHAVIOR_MOVE              = 1,
	NPC_BEHAVIOR_TALK              = 2,
	NPC_BEHAVIOR_MAX               = 3
};


// Enum Arise.ESearchItemRarity
enum class ESearchItemRarity : uint8_t
{
	Normal                         = 0,
	Rare                           = 1,
	ESearchItemRarity_MAX          = 2
};


// Enum Arise.ESearchModelBounds
enum class ESearchModelBounds : uint8_t
{
	Component                      = 0,
	Vertices                       = 1,
	ESearchModelBounds_MAX         = 2
};


// Enum Arise.ESearchModelState
enum class ESearchModelState : uint8_t
{
	Closed                         = 0,
	Opened                         = 1,
	Close                          = 2,
	Open                           = 3,
	ESearchModelState_MAX          = 4
};


// Enum Arise.EPFPlacementSerialize
enum class EPFPlacementSerialize : uint8_t
{
	Unknown                        = 0,
	BreakPoint                     = 1,
	SearchPoint                    = 2,
	TreasurePoint                  = 3,
	TPObject                       = 4,
	FastTravelPoint                = 5,
	OwlPoint                       = 6,
	CampPoint                      = 7,
	FishingPoint                   = 8,
	CookingPoint                   = 9,
	BountyEnemyPoint               = 10,
	PlayerPassBlocking             = 11,
	MainQuestPoint                 = 12,
	MapGimmick                     = 13,
	NpcPoint                       = 14,
	LadderPoint                    = 15,
	FallingPoint                   = 16,
	EncountSymbol                  = 17,
	RecoveryPoint                  = 18,
	StarShipPoint                  = 19,
	NumMaxPoint                    = 20,
	EPFPlacementSerialize_MAX      = 21
};


// Enum Arise.EPFButtonInput
enum class EPFButtonInput : uint8_t
{
	Decide                         = 0,
	Cancel                         = 1,
	Interaction                    = 2,
	Jump                           = 3,
	ChangeCameraDistance           = 4,
	ResetCameraAngle               = 5,
	Gallop                         = 6,
	TypeMax                        = 7,
	EPFButtonInput_MAX             = 8
};


// Enum Arise.EPFSearchPointStatus
enum class EPFSearchPointStatus : uint8_t
{
	Unacquired_DEPRECATED          = 0,
	AcquireOnlyOnce_DEPRECATED     = 1,
	WaitingForPop_DEPRECATED       = 2,
	CanPop_DEPRECATED              = 3,
	Zero                           = 4,
	Invalidate                     = 5,
	CanRepop                       = 6,
	WaitingForRepop                = 7,
	EPFSearchPointStatus_MAX       = 8
};


// Enum Arise.EPFUIParts
enum class EPFUIParts : uint8_t
{
	NAVI_MAP                       = 0,
	DESTINATION_STAR_ICON          = 1,
	POP_UP_ANNOUNCE                = 2,
	PLAYABLE_HELP                  = 3,
	OPERATION_BUTTON_HELP          = 4,
	MAP_LINK_DESTINATION           = 5,
	INTERACT_ICON                  = 6,
	INTERACT_BUTTON_HELP           = 7,
	STAR_SPIRITUAL_GAUGE           = 8,
	DIETARY_EFFECT_GAUGE           = 9,
	NEXT_MAIN_QUEST_TEXT           = 10,
	NEXT_SUB_QUEST_TEXT            = 11,
	ENCOUNTER_GAUGE                = 12,
	ENEMY_APPROACH_ICON            = 13,
	BATTLE_RESULT                  = 14,
	LONG_CHAT_BUTTON               = 15,
	SHORT_CHAT                     = 16,
	MESSAGE_WINDOW                 = 17,
	SYSTEM_WINDOW                  = 18,
	AREA_CHANGE_NAME               = 19,
	TP_GAUGE                       = 20,
	MAX                            = 21
};


// Enum Arise.EPFUIPattern
enum class EPFUIPattern : uint8_t
{
	NONE                           = 0,
	MAIN_QUEST_UPDATE              = 1,
	OPEN_MESSAGE_WINDOW            = 2,
	OPNE_DIALOG                    = 3,
	GET_TITLE_EVENT                = 4,
	SUB_QUEST_UPDATE               = 5,
	REMUNERATION                   = 6,
	MAX                            = 7
};


// Enum Arise.EOption
enum class EOption : uint8_t
{
	NONE                           = 0,
	ITEM_MAX                       = 1,
	RP_CHARA                       = 2,
	OPTIONTYPE                     = 3,
	OPTIONTYPE01                   = 4,
	OPTIONTYPE02                   = 5,
	OPTIONTYPE_MAX                 = 6,
	EOption_MAX                    = 7
};


// Enum Arise.EPassBlockMsgType
enum class EPassBlockMsgType : uint8_t
{
	MsgNone                        = 0,
	MsgShortChat                   = 1,
	MsgWindow                      = 2,
	MsgScript                      = 3,
	MsgEvent                       = 4,
	MsgNpc                         = 5,
	MsgSysBlock                    = 6,
	EPassBlockMsgType_MAX          = 7
};


// Enum Arise.EPlayRecordList
enum class EPlayRecordList : uint8_t
{
	PLAY_RECORD_TOTAL_TIME         = 0,
	PLAY_RECORD_TOTAL_GRADE        = 1,
	PLAY_RECORD_USE_GRADE          = 2,
	PLAY_RECORD_TOTAL_GALD         = 3,
	PLAY_RECORD_TOTAL_PAY_GALD     = 4,
	PLAY_RECORD_GALD               = 5,
	PLAYRECORD_007                 = 6,
	PLAYRECORD_008                 = 7,
	PLAYRECORD_009                 = 8,
	PLAYRECORD_010                 = 9,
	PLAYRECORD_011                 = 10,
	PLAYRECORD_012                 = 11,
	PLAYRECORD_013                 = 12,
	PLAYRECORD_014                 = 13,
	PLAYRECORD_015                 = 14,
	PLAYRECORD_016                 = 15,
	PLAYRECORD_017                 = 16,
	PLAYRECORD_018                 = 17,
	PLAYRECORD_019                 = 18,
	PLAYRECORD_020                 = 19,
	PLAYRECORD_021                 = 20,
	PLAYRECORD_022                 = 21,
	PLAYRECORD_023                 = 22,
	PLAYRECORD_024                 = 23,
	PLAYRECORD_025                 = 24,
	PLAYRECORD_026                 = 25,
	PLAYRECORD_027                 = 26,
	PLAYRECORD_028                 = 27,
	PLAYRECORD_029                 = 28,
	PLAY_RECORD_TOTAL_BTLTIME      = 29,
	PLAY_RECORD_BTL_COUNT          = 30,
	PLAY_RECORD_MAX_HIT_COUNT      = 31,
	PLAY_RECORD_MAX_HIT_DAMAGE     = 32,
	PLAYRECORD_034                 = 33,
	PLAY_RECORD_DEFEAT_ENEMY       = 34,
	PLAY_RECORD_DEFEAT_ENEMY_TYPE  = 35,
	PLAY_RECORD_DEFEAT_GIGANT_TYPE = 36,
	PLAY_RECORD_RUNAWAY            = 37,
	PLAY_RECORD_BOOST_ATTACK       = 38,
	PLAY_RECORD_BOOST_STRIKE       = 39,
	PLAY_RECORD_COUNTER_RAID       = 40,
	PLAYRECORD_042                 = 41,
	PLAY_RECORD_BOOST_ATTACK_BREAK = 42,
	PLAY_RECORD_FLOWER             = 43,
	EPlayRecordList_MAX            = 44
};


// Enum Arise.EQuestType
enum class EQuestType : uint8_t
{
	MainQuest                      = 0,
	SubQuest                       = 1,
	EQuestType_MAX                 = 2
};


// Enum Arise.EQuestDatabaseKey
enum class EQuestDatabaseKey : uint8_t
{
	Message                        = 0,
	Guide                          = 1,
	Lineup                         = 2,
	EnemyCounter                   = 3,
	ItemCounter                    = 4,
	Clear                          = 5,
	MAX                            = 6
};


// Enum Arise.EQuestGuideCategory
enum class EQuestGuideCategory : uint8_t
{
	Main                           = 0,
	Sub                            = 1,
	Wanted                         = 2,
	EQuestGuideCategory_MAX        = 3
};


// Enum Arise.EQuestStepProgress
enum class EQuestStepProgress : uint8_t
{
	Closed                         = 0,
	Opened                         = 1,
	Cleared                        = 2,
	EQuestStepProgress_MAX         = 3
};


// Enum Arise.EQuestGuideProgress
enum class EQuestGuideProgress : uint8_t
{
	Closed                         = 0,
	Lineuped                       = 1,
	Opened                         = 2,
	Cleared                        = 3,
	Reorder                        = 4,
	EQuestGuideProgress_MAX        = 5
};


// Enum Arise.EInheritanceScenarioFlagCategory
enum class EInheritanceScenarioFlagCategory : uint8_t
{
	NONE                           = 0,
	MAP                            = 1,
	TROPHY                         = 2,
	LC                             = 3,
	GRS                            = 4,
	EInheritanceScenarioFlagCategory_MAX = 5
};


// Enum Arise.EScenarioBitFlagCategory
enum class EScenarioBitFlagCategory : uint8_t
{
	SYSTEM                         = 0,
	BATTLE                         = 1,
	MENU                           = 2,
	MAIN                           = 3,
	SUB                            = 4,
	LCHAT                          = 5,
	SCHAT                          = 6,
	GIMMICK                        = 7,
	MAP                            = 8,
	MAPPOINT                       = 9,
	UNIQUE                         = 10,
	SCRIPT                         = 11,
	MOVIE                          = 12,
	MINIGAME                       = 13,
	PARTY                          = 14,
	ITEM                           = 15,
	DEBUG_GIMMICK                  = 16,
	DEBUG_MINIGAME                 = 17,
	DEBUG                          = 18,
	FASTTRAVEL                     = 19,
	LCHAT_PLAY                     = 20,
	EScenarioBitFlagCategory_MAX   = 21
};


// Enum Arise.ESceneFadeSpeed
enum class ESceneFadeSpeed : uint8_t
{
	FadeNormalSpeed                = 0,
	FadeSlowSpeed                  = 1,
	FadeHiSpeed                    = 2,
	FadeFreeSpeed                  = 3,
	ESceneFadeSpeed_MAX            = 4
};


// Enum Arise.ESceneFadeColor
enum class ESceneFadeColor : uint8_t
{
	FadeNone                       = 0,
	FadeBlack                      = 1,
	FadeWhite                      = 2,
	ESceneFadeColor_MAX            = 3
};


// Enum Arise.ESceneFadeType
enum class ESceneFadeType : uint8_t
{
	FadeNone                       = 0,
	FadeIn                         = 1,
	FadeOut                        = 2,
	FadeEnd                        = 3,
	ESceneFadeType_MAX             = 4
};


// Enum Arise.ESearchOwlType
enum class ESearchOwlType : uint8_t
{
	OWL_COLOR_A                    = 0,
	OWL_COLOR_B                    = 1,
	OWL_COLOR_C                    = 2,
	OWL_COLOR_D                    = 3,
	OWL_COLOR_E                    = 4,
	OWL_COLOR_F                    = 5,
	OWL_COLOR_MAX                  = 6
};


// Enum Arise.EShopType
enum class EShopType : uint8_t
{
	Item                           = 0,
	Weapon                         = 1,
	Accessory                      = 2,
	EShopType_MAX                  = 3
};


// Enum Arise.EAriseSCHLocationType
enum class EAriseSCHLocationType : uint8_t
{
	Region                         = 0,
	Area                           = 1,
	Location                       = 2,
	Scene                          = 3,
	None                           = 4,
	EAriseSCHLocationType_MAX      = 5
};


// Enum Arise.EPriorityType
enum class EPriorityType : uint8_t
{
	A                              = 0,
	B                              = 1,
	C                              = 2,
	D                              = 3,
	E                              = 4,
	F                              = 5,
	EPriorityType_MAX              = 6
};


// Enum Arise.ESpeakerType
enum class ESpeakerType : uint8_t
{
	INVALID                        = 0,
	ARI                            = 1,
	SIO                            = 2,
	NNA                            = 3,
	ZGU                            = 4,
	MNK                            = 5,
	YRA                            = 6,
	ZFA                            = 7,
	BEZ                            = 8,
	KIL                            = 9,
	AGM                            = 10,
	DFN                            = 11,
	SOL                            = 12,
	LHI                            = 13,
	NPC                            = 14,
	NPC01                          = 15,
	NPC02                          = 16,
	NPC03                          = 17,
	NPC04                          = 18,
	NPC05                          = 19,
	NPC06                          = 20,
	NPC07                          = 21,
	NPC08                          = 22,
	FRU                            = 23,
	MRS                            = 24,
	DNS                            = 25,
	ODT                            = 26,
	CCL                            = 27,
	KRN                            = 28,
	EDN                            = 29,
	EIZ                            = 30,
	KLZ                            = 31,
	DAR                            = 32,
	LSW                            = 33,
	LGU                            = 34,
	LLA                            = 35,
	DOC                            = 36,
	ELS                            = 37,
	ELM                            = 38,
	SGU                            = 39,
	CBK                            = 40,
	CBA                            = 41,
	EMOTION                        = 42,
	SELF                           = 43,
	ALLPEOPLE                      = 44,
	PARTY                          = 45,
	ALLY                           = 46,
	ENEMY                          = 47,
	PUBLIC                         = 48,
	OBJECT                         = 49,
	ESpeakerType_MAX               = 50
};


// Enum Arise.EFaceIcon
enum class EFaceIcon : uint8_t
{
	NORMAL                         = 0,
	JOY                            = 1,
	ANGER                          = 2,
	SAD                            = 3,
	BLUNDER                        = 4,
	SURPRISE                       = 5,
	EFaceIcon_MAX                  = 6
};


// Enum Arise.EShortchatIconType
enum class EShortchatIconType : uint8_t
{
	ARI                            = 0,
	SIO                            = 1,
	NNA                            = 2,
	ZGU                            = 3,
	MNK                            = 4,
	YRA                            = 5,
	Icon7                          = 6,
	Icon8                          = 7,
	Icon9                          = 8,
	Icon10                         = 9,
	Icon11                         = 10,
	Icon12                         = 11,
	Icon13                         = 12,
	Icon14                         = 13,
	Icon15                         = 14,
	Icon16                         = 15,
	Icon17                         = 16,
	Icon18                         = 17,
	Icon19                         = 18,
	Icon20                         = 19,
	Icon21                         = 20,
	Icon22                         = 21,
	Icon23                         = 22,
	Icon24                         = 23,
	Icon25                         = 24,
	Icon26                         = 25,
	Icon27                         = 26,
	Icon28                         = 27,
	Icon29                         = 28,
	Icon30                         = 29,
	Icon31                         = 30,
	Icon32                         = 31,
	Icon33                         = 32,
	Icon34                         = 33,
	Icon35                         = 34,
	Icon36                         = 35,
	EShortchatIconType_MAX         = 36
};


// Enum Arise.ESCH_PFActionType
enum class ESCH_PFActionType : uint8_t
{
	JUMP_LANDING_DAMAGE            = 0,
	SWIM_SLOW_TRANS                = 1,
	TOUCH_SQUAT                    = 2,
	LOSE_TRANS_IDLE                = 3,
	SYS_IDLE_CHARA                 = 4,
	HIGH_PLACE                     = 5,
	HOT                            = 6,
	COLD                           = 7,
	HIGHLAND                       = 8,
	ESCH_MAX                       = 9
};


// Enum Arise.EPFSCHObjDefine
enum class EPFSCHObjDefine : uint8_t
{
	INVALID                        = 0,
	Npc                            = 1,
	Boss                           = 2,
	Artifact                       = 3,
	Owl                            = 4,
	Treasure                       = 5,
	Collection                     = 6,
	ItemRare                       = 7,
	ItemRare01                     = 8,
	ItemRare02                     = 9,
	OreRank                        = 10,
	OreRank01                      = 11,
	OreRank02                      = 12,
	Ranch                          = 13,
	Arena                          = 14,
	Fishing                        = 15,
	Camp                           = 16,
	Kitchen                        = 17,
	Information                    = 18,
	General                        = 19,
	Blacksmith                     = 20,
	Sculptor                       = 21,
	Ore                            = 22,
	Inn                            = 23,
	Quest                          = 24,
	YoungWoman                     = 25,
	Cat                            = 26,
	Rare                           = 27,
	StrongBoss                     = 28,
	QuestEnemy                     = 29,
	QuestItem                      = 30,
	Meat                           = 31,
	EPFSCHObjDefine_MAX            = 32
};


// Enum Arise.ESCHPFOwlDetectFlagCheckType
enum class ESCHPFOwlDetectFlagCheckType : uint8_t
{
	CheckNone                      = 0,
	CheckTrue                      = 1,
	CheckFalse                     = 2,
	ESCHPFOwlDetectFlagCheckType_MAX = 3
};


// Enum Arise.EArisePFSCPauseState
enum class EArisePFSCPauseState : uint8_t
{
	None                           = 0,
	AutoSave                       = 1,
	Scene                          = 2,
	State                          = 3,
	Battle                         = 4,
	SystemWindow                   = 5,
	Menu                           = 6,
	Interact                       = 7,
	EArisePFSCPauseState_MAX       = 8
};


// Enum Arise.EStaffrollImageDirection
enum class EStaffrollImageDirection : uint8_t
{
	None                           = 0,
	Center                         = 1,
	Right                          = 2,
	Left                           = 3,
	Center_S_Size                  = 4,
	EStaffrollImageDirection_MAX   = 5
};


// Enum Arise.EStaffrollImageAnime
enum class EStaffrollImageAnime : uint8_t
{
	None                           = 0,
	Open                           = 1,
	Close                          = 2,
	EStaffrollImageAnime_MAX       = 3
};


// Enum Arise.EStaffrollDirection
enum class EStaffrollDirection : uint8_t
{
	None                           = 0,
	Center                         = 1,
	Right                          = 2,
	Left                           = 3,
	EStaffrollDirection_MAX        = 4
};


// Enum Arise.EStaffrollFormatType
enum class EStaffrollFormatType : uint8_t
{
	Normal                         = 0,
	Small                          = 1,
	Title_Red                      = 2,
	CompanyLogo                    = 3,
	End                            = 4,
	PositionName_Color1            = 5,
	PositionName_Color2            = 6,
	Fin                            = 7,
	ChangeFade                     = 8,
	BigText                        = 9,
	EStaffrollFormatType_MAX       = 10
};


// Enum Arise.EAssetLoadingPriority
enum class EAssetLoadingPriority : uint8_t
{
	ResidentChara                  = 0,
	Level                          = 1,
	Battle_Preload                 = 2,
	PF_NPC                         = 3,
	PF_Etc                         = 4,
	PF_Treasure                    = 5,
	Immediate                      = 6,
	GameSection_MainGame           = 7,
	GameSection_Title              = 8,
	GameSection_Boot               = 9,
	GameSection_InitSystem         = 10,
	EAssetLoadingPriority_MAX      = 11
};


// Enum Arise.EApplicationLocale
enum class EApplicationLocale : uint8_t
{
	All                            = 0,
	Japan                          = 1,
	NorthAmerica                   = 2,
	Europe                         = 3,
	Asia                           = 4,
	EApplicationLocale_MAX         = 5
};


// Enum Arise.EGamePlatform
enum class EGamePlatform : uint8_t
{
	Windows                        = 0,
	PS4                            = 1,
	XboxOne                        = 2,
	Unknown                        = 3,
	EGamePlatform_MAX              = 4
};


// Enum Arise.ESystemWindowFlag
enum class ESystemWindowFlag : uint8_t
{
	Disable_Decide                 = 0,
	Disable_Cancel                 = 1,
	Origin_Top                     = 2,
	Origin_Bottom                  = 3,
	Origin_Left                    = 4,
	Origin_Right                   = 5,
	Origin_Center                  = 6,
	Align_Left                     = 7,
	Align_Right                    = 8,
	Align_Center                   = 9,
	Choice_Align_Left              = 10,
	Choice_Align_Right             = 11,
	Choice_Align_Center            = 12,
	Choice_Block_Left              = 13,
	Choice_Block_Right             = 14,
	Choice_Block_Center            = 15,
	Choice_Cursor_Hidden           = 16,
	Disable_Pause                  = 17,
	ESystemWindowFlag_MAX          = 18
};


// Enum Arise.ESystemWindowAutoPosition
enum class ESystemWindowAutoPosition : uint8_t
{
	AutoPosition_Off               = 0,
	AutoPosition_Center            = 1,
	AutoPosition_Left              = 2,
	AutoPosition_Right             = 3,
	AutoPosition_Top               = 4,
	AutoPosition_Bottom            = 5,
	AutoPosition_LeftTop           = 6,
	AutoPosition_LeftBottom        = 7,
	AutoPosition_RightTop          = 8,
	AutoPosition_RightBottom       = 9,
	AutoPosition_ENUM_END          = 10,
	AutoPosition_MAX               = 11
};


// Enum Arise.EUIElementType
enum class EUIElementType : uint8_t
{
	PF_Minimap                     = 0,
	PF_MinimapRotate               = 1,
	PF_DirectionGuide              = 2,
	UIElementMax                   = 3,
	EUIElementType_MAX             = 4
};


// Enum Arise.EInputDeviceType
enum class EInputDeviceType : uint8_t
{
	KEYBOARD                       = 0,
	GAMEPAD                        = 1,
	EInputDeviceType_MAX           = 2
};


// Enum Arise.EButtonIconSet
enum class EButtonIconSet : uint8_t
{
	KEYBOARD                       = 0,
	XINPUT_XONE                    = 1,
	DUALSHOCK4                     = 2,
	AUTO                           = 3,
	EButtonIconSet_MAX             = 4
};


// Enum Arise.EVisualItemEquipType
enum class EVisualItemEquipType : uint8_t
{
	UNKNOWN                        = 0,
	GLASSESA                       = 1,
	GLASSESB                       = 2,
	GLASSESC                       = 3,
	GLASSESD                       = 4,
	GLASSESE                       = 5,
	GLASSESF                       = 6,
	EYEPATCHR                      = 7,
	EYEPATCHRL                     = 8,
	BANDAGER                       = 9,
	BANDAGEL                       = 10,
	DEAR                           = 11,
	CEAR                           = 12,
	REAR                           = 13,
	DHORN                          = 14,
	CROWN                          = 15,
	FLOW                           = 16,
	ROSE                           = 17,
	RIBBON                         = 18,
	ANG                            = 19,
	DEVIL                          = 20,
	BUTTE                          = 21,
	WINGR                          = 22,
	WINGL                          = 23,
	TAILA                          = 24,
	TAILB                          = 25,
	TAILC                          = 26,
	TAILD                          = 27,
	FURURU                         = 28,
	EVisualItemEquipType_MAX       = 29
};


// Enum Arise.EWorldLevelType
enum class EWorldLevelType : uint8_t
{
	LVTYPE_FREE                    = 0,
	LVTYPE_FIELD                   = 1,
	LVTYPE_TOWN                    = 2,
	LVTYPE_DUNGEON                 = 3,
	LVTYPE_EVENT                   = 4,
	LVTYPE_MAX                     = 5
};


// Enum Arise.EEffectState
enum class EEffectState : uint8_t
{
	Init                           = 0,
	On                             = 1,
	Off                            = 2,
	Disable                        = 3,
	Nothing                        = 4,
	EEffectState_MAX               = 5
};


// Enum Arise.ELightState
enum class ELightState : uint8_t
{
	Init                           = 0,
	On                             = 1,
	Off                            = 2,
	FadeOn                         = 3,
	FadeOff                        = 4,
	Disable                        = 5,
	Nothing                        = 6,
	ELightState_MAX                = 7
};


// Enum Arise.EPFAxisInput
enum class EPFAxisInput : uint8_t
{
	MoveForward                    = 0,
	MoveRight                      = 1,
	RotatePitch                    = 2,
	RotateYaw                      = 3,
	TypeMax                        = 4,
	EPFAxisInput_MAX               = 5
};



//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// ScriptStruct Arise.AccessoryExp
// 0x0008
struct FAccessoryExp
{
	int                                                Rank;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                NextExp;                                                  // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.AccessoryParam
// 0x0028
struct FAccessoryParam
{
	int                                                Lv;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<int>                                        Stone;                                                    // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<int>                                        Accessory;                                                // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.AccessoryExpTableRow
// 0x0030
struct FAccessoryExpTableRow
{
	TArray<struct FAccessoryExp>                       Data;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FAccessoryParam>                     AddExp;                                                   // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FAccessoryParam>                     UseGald;                                                  // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.AlphaMaskFadeTaskNode
// 0x0010
struct FAlphaMaskFadeTaskNode
{
	class UAlphaMaskCameraFadeTask*                    Task;                                                     // 0x0000(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAlphaMaskCameraFadeTask*                    ExecuteTask;                                              // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct Arise.AlphaMaskPriorityLabel
// 0x0008
struct FAlphaMaskPriorityLabel
{
	struct FName                                       Label;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.AriseBlueprintAssetData
// 0x0030
struct FAriseBlueprintAssetData
{
	EAriseBlueprintAssetCategory                       Category;                                                 // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FName                                       ID;                                                       // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FSoftClassPath                              AssetPath;                                                // 0x0010(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	EAriseBlueprintAssetCreateMethod                   CreateMethod;                                             // 0x0028(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               bForDebugOnly;                                            // 0x0029(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x002A(0x0006) MISSED OFFSET
};

// ScriptStruct Arise.AriseBlueprintAssetDatabase
// 0x0010
struct FAriseBlueprintAssetDatabase
{
	TArray<struct FAriseBlueprintAssetData>            Data;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.AriseCharacterBasePartsData
// 0x0040
struct FAriseCharacterBasePartsData
{
	struct FSoftObjectPath                             Mesh;                                                     // 0x0000(0x0018) (Edit)
	struct FVector                                     LocationOffset;                                           // 0x0018(0x000C) (Edit, IsPlainOldData)
	struct FRotator                                    RotationOffset;                                           // 0x0024(0x000C) (Edit, IsPlainOldData)
	struct FVector                                     ScaleOffset;                                              // 0x0030(0x000C) (Edit, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.AriseCharacterCombinePartsData
// 0x0050
struct FAriseCharacterCombinePartsData
{
	struct FSoftObjectPath                             Mesh;                                                     // 0x0000(0x0018) (Edit)
	bool                                               bAttach;                                                  // 0x0018(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
	struct FName                                       SocketName;                                               // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     LocationOffset;                                           // 0x0028(0x000C) (Edit, IsPlainOldData)
	struct FRotator                                    RotationOffset;                                           // 0x0034(0x000C) (Edit, IsPlainOldData)
	struct FVector                                     ScaleOffset;                                              // 0x0040(0x000C) (Edit, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x004C(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.AriseCharacterPartsData
// 0x0050
struct FAriseCharacterPartsData
{
	struct FAriseCharacterBasePartsData                BaseParts;                                                // 0x0000(0x0040) (Edit)
	TArray<struct FAriseCharacterCombinePartsData>     CombineParts;                                             // 0x0040(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct Arise.AriseCommerceCategoryInfo
// 0x0020
struct FAriseCommerceCategoryInfo
{
	struct FString                                     mLabel;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FString>                             mContentLabels;                                           // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.AriseCommerceContentInfo
// 0x0018
struct FAriseCommerceContentInfo
{
	struct FString                                     mLabel;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	bool                                               mSale;                                                    // 0x0010(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               mPurchased;                                               // 0x0011(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0012(0x0002) MISSED OFFSET
	int                                                mPrice;                                                   // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.PadKeyAssign
// 0x0050
struct FPadKeyAssign
{
	TMap<struct FName, int>                            AssignList;                                               // 0x0000(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.MouseKeyAssign
// 0x0050
struct FMouseKeyAssign
{
	TMap<struct FName, int>                            AssignList;                                               // 0x0000(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.KeyboardKeyAssign
// 0x0050
struct FKeyboardKeyAssign
{
	TMap<struct FName, int>                            AssignList;                                               // 0x0000(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.GraphicsConfigData
// 0x0064
struct FGraphicsConfigData
{
	int                                                ScreenMode;                                               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Resolution;                                               // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                VerticalSync;                                             // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FramLimit;                                                // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Bloom;                                                    // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MotionBlur;                                               // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DrawScale;                                                // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DrawDistanceNPC;                                          // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DrawDistanceObject;                                       // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DrawDistanceGrass;                                        // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                AntiAliasing;                                             // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ShadowQuality;                                            // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TextureQuality;                                           // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                EffectQuality;                                            // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PostProcessQuality;                                       // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ScreenSpaceReflection;                                    // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                OcclusionCulling;                                         // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                AnisotropyFiltering;                                      // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FontSize;                                                 // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                AmbientOcclusion;                                         // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                VolumetricLighting;                                       // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ScreenSpaceShadow;                                        // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                GlobalIllumination;                                       // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DepthOfField;                                             // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                HighResolution;                                           // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.GameConfigData
// 0x000C
struct FGameConfigData
{
	int                                                PFCameraSpeed;                                            // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PFCameraYaw;                                              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PFCameraPitch;                                            // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.ConfigBgmData
// 0x0040
struct FConfigBgmData
{
	int                                                ID;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FString                                     DlcName;                                                  // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FName                                       TitleLabel;                                               // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       GameTitleLabel;                                           // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                GameTitleSort;                                            // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                BgmSort;                                                  // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       BgmDataLabel;                                             // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       BGMLabel;                                                 // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.DLCAcquireItemData
// 0x0020
struct FDLCAcquireItemData
{
	EDLCAcquireItemType                                Type;                                                     // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FString                                     Label;                                                    // 0x0008(0x0010) (BlueprintVisible, ZeroConstructor)
	int                                                Count;                                                    // 0x0018(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.BtlEncountGroupParam
// 0x0010
struct FBtlEncountGroupParam
{
	struct FName                                       Label;                                                    // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Rare;                                                     // 0x0008(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
};

// ScriptStruct Arise.BtlResultInfo
// 0x0018
struct FBtlResultInfo
{
	EBtlResultType                                     Result;                                                   // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	TArray<struct FBtlEncountGroupParam>               EncountGroupList;                                         // 0x0008(0x0010) (BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.AriseTextureSizeInfo
// 0x0030
struct FAriseTextureSizeInfo
{
	unsigned char                                      UnknownData00[0x14];                                      // 0x0000(0x0014) MISSED OFFSET
	int                                                TotalMaxAllowedSize;                                      // 0x0014(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	int                                                TotalCurrentSize;                                         // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	int                                                WorldMaxAllowedSize;                                      // 0x001C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	int                                                WorldCurrentSize;                                         // 0x0020(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	int                                                CharaMaxAllowedSize;                                      // 0x0024(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	int                                                CharaCurrentSize;                                         // 0x0028(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.LongChatPlayArgs
// 0x0050
struct FLongChatPlayArgs
{
	TMap<struct FName, struct FString>                 Args;                                                     // 0x0000(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.AriseGameTime
// 0x0008
struct FAriseGameTime
{
	int                                                Hour;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Minute;                                                   // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.AriseIconData
// 0x0078
struct FAriseIconData
{
	struct FString                                     mLabel;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     DlcName;                                                  // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	EAriseCharaIconID                                  IconId;                                                   // 0x0020(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
	struct FScenarioCondition                          mScenario;                                                // 0x0028(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FSoftObjectPath                             mIconPath;                                                // 0x0048(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FSoftObjectPath                             mBattleIconPath;                                          // 0x0060(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
};

// ScriptStruct Arise.AriseIconDataCollection
// 0x0010
struct FAriseIconDataCollection
{
	TArray<struct FAriseIconData>                      mData;                                                    // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.ItemParameter
// 0x0008
struct FItemParameter
{
	int                                                ID;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Value;                                                    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.ItemAbilityWorkData
// 0x000C
struct FItemAbilityWorkData
{
	int                                                AbilityID;                                                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Rank;                                                     // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Value;                                                    // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.ItemWorkData
// 0x0038
struct FItemWorkData
{
	int                                                UniqueId;                                                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ItemID;                                                   // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FItemParameter>                      Parameter;                                                // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FItemAbilityWorkData>                AbilityWorkData;                                          // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Rank;                                                     // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Flag;                                                     // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET
};

// ScriptStruct Arise.ItemParameterNamed
// 0x0018
struct FItemParameterNamed
{
	int                                                ID;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FString                                     Value;                                                    // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.ItemCommonFlag
// 0x0001
struct FItemCommonFlag
{
	bool                                               Enable;                                                   // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.ItemData
// 0x0078
struct FItemData
{
	int                                                UniqueId;                                                 // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                ID;                                                       // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       DlcName;                                                  // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       Label;                                                    // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      Category;                                                 // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
	struct FText                                       Icon;                                                     // 0x0020(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	unsigned char                                      MaxNum;                                                   // 0x0038(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0039(0x0007) MISSED OFFSET
	TArray<struct FItemParameter>                      ParamNums;                                                // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FItemParameterNamed>                 ParamNames;                                               // 0x0050(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FItemCommonFlag>                     Flag;                                                     // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                Sort;                                                     // 0x0070(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                DlcID;                                                    // 0x0074(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.AriseListBoxStyle
// 0x0008 (0x0010 - 0x0008)
struct FAriseListBoxStyle : public FSlateWidgetStyle
{
	bool                                               AutoVerticalMargin;                                       // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
};

// ScriptStruct Arise.ListWidgetInitData
// 0x0040
struct FListWidgetInitData
{
	TArray<int>                                        IntData;                                                  // 0x0000(0x0010) (BlueprintVisible, ZeroConstructor)
	TArray<float>                                      FloatData;                                                // 0x0010(0x0010) (BlueprintVisible, ZeroConstructor)
	TArray<unsigned char>                              ByteData;                                                 // 0x0020(0x0010) (BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             StringData;                                               // 0x0030(0x0010) (BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.AriseMiningItemSaveInfo
// 0x0018
struct FAriseMiningItemSaveInfo
{
	int                                                ItemID;                                                   // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EAriseMiningItemType                               Type;                                                     // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	TArray<int>                                        AbilityID;                                                // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.AriseMiningPointSaveInfo
// 0x0028
struct FAriseMiningPointSaveInfo
{
	struct FString                                     Name;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FAriseMiningItemSaveInfo>            Items;                                                    // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Rarelity;                                                 // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                CookSkill;                                                // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.PartyOrder
// 0x0078
struct FPartyOrder
{
	TArray<EArisePartyID>                              Order;                                                    // 0x0000(0x0010) (ZeroConstructor)
	TArray<EArisePartyID>                              BackupOrder;                                              // 0x0010(0x0010) (ZeroConstructor)
	EArisePartyID                                      PartyTop;                                                 // 0x0020(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
	TArray<EAriseGuestID>                              Guest;                                                    // 0x0028(0x0010) (ZeroConstructor)
	TArray<EAriseGuestID>                              Companion;                                                // 0x0038(0x0010) (ZeroConstructor)
	EOperationMode                                     BackupOperation;                                          // 0x0048(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
	TArray<EArisePartyID>                              BackupPartyTop;                                           // 0x0050(0x0010) (ZeroConstructor)
	TArray<EArisePartyID>                              BackupBattleTop;                                          // 0x0060(0x0010) (ZeroConstructor)
	bool                                               bLockPartyTop;                                            // 0x0070(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0071(0x0007) MISSED OFFSET
};

// ScriptStruct Arise.ArisePlayerStatus
// 0x0008
struct FArisePlayerStatus
{
	class UArisePCStatus*                              Status;                                                   // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.ArisePlatformAssetData
// 0x0028
struct FArisePlatformAssetData
{
	struct FString                                     ID;                                                       // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FSoftObjectPath                             Asset;                                                    // 0x0010(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
};

// ScriptStruct Arise.ArisePlatformAssetDataCollection
// 0x0010
struct FArisePlatformAssetDataCollection
{
	TArray<struct FArisePlatformAssetData>             Record;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.ArisePlayerAttachmentData
// 0x0008
struct FArisePlayerAttachmentData
{
	int                                                AttachmentID;                                             // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                VariationIndex;                                           // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.ArisePlayerVisualData
// 0x0020
struct FArisePlayerVisualData
{
	int                                                Hair;                                                     // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Costume;                                                  // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<struct FArisePlayerAttachmentData>          Attachments;                                              // 0x0008(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	int                                                Weapon;                                                   // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.AriseLevelUpResult
// 0x0004
struct FAriseLevelUpResult
{
	int                                                UpLevel;                                                  // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.LvStatusData
// 0x001C
struct FLvStatusData
{
	int                                                HP;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Atk;                                                      // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Def;                                                      // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                EAtk;                                                     // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                EDef;                                                     // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Pen;                                                      // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                End;                                                      // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.InitLearnSkillData
// 0x0018
struct FInitLearnSkillData
{
	struct FString                                     ID;                                                       // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                Key;                                                      // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.InitStatusData
// 0x0070
struct FInitStatusData
{
	struct FName                                       DlcName;                                                  // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Level;                                                    // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                SP;                                                       // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	TArray<struct FString>                             Alias;                                                    // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     Weapon;                                                   // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     Armor;                                                    // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     Hair;                                                     // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     Costume;                                                  // 0x0050(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FInitLearnSkillData>                 Skills;                                                   // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.LvExpData
// 0x0020
struct FLvExpData
{
	int                                                Exp;                                                      // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<int>                                        CharacterTable;                                           // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	bool                                               StartLv;                                                  // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               LimitLv;                                                  // 0x0019(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x001A(0x0006) MISSED OFFSET
};

// ScriptStruct Arise.XmlDatabaseItem
// 0x0028
struct FXmlDatabaseItem
{
	struct FString                                     Key;                                                      // 0x0000(0x0010) (Edit, ZeroConstructor)
	struct FSoftObjectPath                             Path;                                                     // 0x0010(0x0018) (Edit)
};

// ScriptStruct Arise.StringDictionaryItem
// 0x0028
struct FStringDictionaryItem
{
	struct FString                                     Key;                                                      // 0x0000(0x0010) (Edit, ZeroConstructor)
	struct FSoftObjectPath                             Path;                                                     // 0x0010(0x0018) (Edit)
};

// ScriptStruct Arise.AriseRelationShipData
// 0x0050
struct FAriseRelationShipData
{
	struct FString                                     mLabel;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     DlcName;                                                  // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                FIconID;                                                  // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EAriseCharaIconID                                  IconId;                                                   // 0x0024(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EAriseRelationship                                 mRelationship;                                            // 0x0025(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EAriseRelationshipSeriousCheck                     mSeriousCheck;                                            // 0x0026(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               mEnable;                                                  // 0x0027(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                mLikable;                                                 // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	struct FScenarioCondition                          mScenario;                                                // 0x0030(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
};

// ScriptStruct Arise.AriseRelationShipDataCollection
// 0x0010
struct FAriseRelationShipDataCollection
{
	TArray<struct FAriseRelationShipData>              mData;                                                    // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.AriseResidentAssetData
// 0x0028
struct FAriseResidentAssetData
{
	EAriseResidentAssetCategory                        Category;                                                 // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FName                                       ID;                                                       // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FSoftObjectPath                             AssetPath;                                                // 0x0010(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
};

// ScriptStruct Arise.AriseResidentAssetDatabase
// 0x0010
struct FAriseResidentAssetDatabase
{
	TArray<struct FAriseResidentAssetData>             Data;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.AriseSaveArgument
// 0x0008
struct FAriseSaveArgument
{
	int                                                mSlotIndex;                                               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EAriseSaveThumbneilType                            mThumbneilType;                                           // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
};

// ScriptStruct Arise.AriseSaveHeader
// 0x32058
struct FAriseSaveHeader
{
	TEnumAsByte<EAriseSaveType>                        mSaveType;                                                // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	int64_t                                            mPlayTime;                                                // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FDateTime                                   mUpdateTime;                                              // 0x0010(0x0008) (Edit, BlueprintVisible)
	int                                                mParameter[0x10];                                         // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      mImage[0x20000];                                          // 0x0058(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x12000];                                   // 0x20058(0x12000) MISSED OFFSET
};

// ScriptStruct Arise.AriseLoadArgument
// 0x0008
struct FAriseLoadArgument
{
	int                                                mSlotIndex;                                               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               mVerify;                                                  // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
};

// ScriptStruct Arise.AriseSaveResultToDo
// 0x0038
struct FAriseSaveResultToDo
{
	EAriseSaveToDoMessage                              mMessage;                                                 // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EAriseSaveVerify                                   mVerifyResult;                                            // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               mDelete;                                                  // 0x0002(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x0003(0x0005) MISSED OFFSET
	TArray<int>                                        mDLC_ErrorId;                                             // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FString>                             mDLC_RevertCategory;                                      // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<int>                                        mHeaderBrokenSlotIndexes;                                 // 0x0028(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct Arise.AriseDebugSaveFile
// 0x0020
struct FAriseDebugSaveFile
{
	struct FString                                     mFilePath;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FDateTime                                   mUpdateTime;                                              // 0x0010(0x0008) (Edit, BlueprintVisible)
	int                                                mSize;                                                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.AriseDeleteArgument
// 0x0004
struct FAriseDeleteArgument
{
	int                                                mSlotIndex;                                               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.ScenarioFlagUniqueSetterEvent
// 0x0010
struct FScenarioFlagUniqueSetterEvent
{
	struct FScriptDelegate                             Delegate;                                                 // 0x0000(0x0014) (ZeroConstructor, InstancedReference)
};

// ScriptStruct Arise.AriseScenarioFlag_DatabaseLabel
// 0x0010
struct FAriseScenarioFlag_DatabaseLabel
{
	struct FString                                     Name;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.AriseScriptSaveDataInfo
// 0x0020
struct FAriseScriptSaveDataInfo
{
	struct FString                                     Name;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	EAriseScriptSaveDataType                           Type;                                                     // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	int                                                Num;                                                      // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bInherit;                                                 // 0x0018(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
};

// ScriptStruct Arise.StatusImageUV
// 0x0010
struct FStatusImageUV
{
	float                                              X;                                                        // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              Y;                                                        // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              W;                                                        // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              H;                                                        // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.StatusImageLayout
// 0x0010
struct FStatusImageLayout
{
	float                                              PosX;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              PosY;                                                     // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              ScaleX;                                                   // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              ScaleY;                                                   // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.CharaImageData
// 0x0050
struct FCharaImageData
{
	struct FString                                     ImagePath;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FScenarioCondition                          Scenario;                                                 // 0x0010(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FStatusImageUV                              UV;                                                       // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	TArray<struct FStatusImageLayout>                  Layout;                                                   // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.StatusImageData
// 0x0018
struct FStatusImageData
{
	int                                                CharacterID;                                              // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<struct FCharaImageData>                     ImageData;                                                // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.StatusImageDataList
// 0x0010
struct FStatusImageDataList
{
	TArray<struct FStatusImageData>                    Data;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.AriseTacticsElement
// 0x0010
struct FAriseTacticsElement
{
	int                                                Condition;                                                // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Action;                                                   // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                How;                                                      // 0x0008(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Enable;                                                   // 0x000C(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
};

// ScriptStruct Arise.AriseTacticsSet
// 0x0020
struct FAriseTacticsSet
{
	int                                                ID;                                                       // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<struct FAriseTacticsElement>                List;                                                     // 0x0008(0x0010) (BlueprintVisible, ZeroConstructor)
	bool                                               bEdit;                                                    // 0x0018(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
};

// ScriptStruct Arise.AriseWaypointNode
// 0x0020
struct FAriseWaypointNode
{
	int                                                ThisIndex;                                                // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                ParentIndex;                                              // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                DataIndex;                                                // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	TArray<int>                                        ChildIndex;                                               // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.AriseWaypointData
// 0x000C
struct FAriseWaypointData
{
	struct FVector                                     Location;                                                 // 0x0000(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.AriseWaypointTree
// 0x0028
struct FAriseWaypointTree
{
	TArray<struct FAriseWaypointNode>                  NodeList;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FAriseWaypointData>                  DataList;                                                 // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                RootNodeIndex;                                            // 0x0020(0x0004) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.BtlDebugParameter
// 0x0040
struct FBtlDebugParameter
{
	bool                                               IsNotDieParty;                                            // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsNotDieEnemy;                                            // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsEnemyAI;                                                // 0x0002(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsPartyAI;                                                // 0x0003(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsFixedHPPercent;                                         // 0x0004(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	int                                                FixedHPPercent;                                           // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsUnlimitedTP;                                            // 0x000C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsOverwriteTP;                                            // 0x000D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x000E(0x0002) MISSED OFFSET
	int                                                OverwriteTP;                                              // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsUnlimitedSP;                                            // 0x0014(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsOverwriteSP;                                            // 0x0015(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x0016(0x0002) MISSED OFFSET
	int                                                OverwriteSP;                                              // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsOverwriteComboInterval;                                 // 0x001C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
	float                                              OverwriteComboInterval;                                   // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsUnlimitedStrike;                                        // 0x0024(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsUnlimitedOverlimit;                                     // 0x0025(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsForceStrikeSmash;                                       // 0x0026(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsBreakEndurance;                                         // 0x0027(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsIgnoreStrikeSmashCondition;                             // 0x0028(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsForceDown;                                              // 0x0029(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsForceCritical;                                          // 0x002A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsForceWeakness;                                          // 0x002B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsForceResistance;                                        // 0x002C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsForceCoreBreak;                                         // 0x002D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowDamageCollision;                                     // 0x002E(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowAttackCollision;                                     // 0x002F(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowSizeComponent;                                       // 0x0030(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowSelfCapsule;                                         // 0x0031(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowBaseCapsule;                                         // 0x0032(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowDamageArrow;                                         // 0x0033(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowMagicDebug;                                          // 0x0034(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsArsExecuteListOrderMode;                               // 0x0035(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowBattleShortChat;                                     // 0x0036(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bForceVoiceConditionScenarioRelationship;                 // 0x0037(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bDisableAttackVoice;                                      // 0x0038(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bDisableBGM;                                              // 0x0039(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsLearnArtsAll;                                          // 0x003A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsBattleHudHidden;                                       // 0x003B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsShowDisplayEncountInfoLoadState;                       // 0x003C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBtlRank                                           OverwriteRank;                                            // 0x003D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIgnoreFacial;                                            // 0x003E(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x1];                                       // 0x003F(0x0001) MISSED OFFSET
};

// ScriptStruct Arise.BattleSandboxPartyParam
// 0x0003
struct FBattleSandboxPartyParam
{
	EArisePartyID                                      PartyId;                                                  // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	bool                                               IsNotDie;                                                 // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	EOperationMode                                     OperationMode;                                            // 0x0002(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
};

// ScriptStruct Arise.BattleSandboxGuestParam
// 0x0002
struct FBattleSandboxGuestParam
{
	EAriseGuestID                                      GuestId;                                                  // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	bool                                               IsNotDie;                                                 // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
};

// ScriptStruct Arise.PFEncountSymbolGroupID
// 0x0010
struct FPFEncountSymbolGroupID
{
	struct FDatabaseLabel                              ID;                                                       // 0x0000(0x0010) (Edit, BlueprintVisible)
};

// ScriptStruct Arise.PFEncountSymbolBattleID
// 0x0010
struct FPFEncountSymbolBattleID
{
	struct FDatabaseLabel                              ID;                                                       // 0x0000(0x0010) (Edit, BlueprintVisible)
};

// ScriptStruct Arise.BtlTacticsCondition
// 0x0008
struct FBtlTacticsCondition
{
	struct FName                                       Label;                                                    // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.BtlTacticsAction
// 0x0008
struct FBtlTacticsAction
{
	struct FName                                       Label;                                                    // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.BtlTacticsHow
// 0x0008
struct FBtlTacticsHow
{
	struct FName                                       Label;                                                    // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.BattleSandboxTactics
// 0x0018
struct FBattleSandboxTactics
{
	struct FBtlTacticsCondition                        Condition;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, Config, GlobalConfig)
	struct FBtlTacticsAction                           Action;                                                   // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, Config, GlobalConfig)
	struct FBtlTacticsHow                              How;                                                      // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, Config, GlobalConfig)
};

// ScriptStruct Arise.BattleSandboxTacticsPreset
// 0x0010
struct FBattleSandboxTacticsPreset
{
	TArray<struct FBattleSandboxTactics>               Tactics;                                                  // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, Config, GlobalConfig)
};

// ScriptStruct Arise.BattleSandboxCostumeName
// 0x0008
struct FBattleSandboxCostumeName
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.BattleSandboxCostumeV2
// 0x0028
struct FBattleSandboxCostumeV2
{
	EArisePartyID                                      PartyId;                                                  // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FBattleSandboxCostumeName                   Costume;                                                  // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, Config, GlobalConfig)
	struct FBattleSandboxCostumeName                   Hair;                                                     // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, Config, GlobalConfig)
	TArray<struct FBattleSandboxCostumeName>           Attachment;                                               // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Config, GlobalConfig)
};

// ScriptStruct Arise.PartsData
// 0x0020
struct FPartsData
{
	struct FString                                     PartsItemID;                                              // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     PartsImage;                                               // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.ArtifactData
// 0x00D8
struct FArtifactData
{
	struct FString                                     Label;                                                    // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     DlcName;                                                  // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     ComplateItemID;                                           // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     UncomplateItemID;                                         // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     ExItemID;                                                 // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     EffectID;                                                 // 0x0050(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     ExEffectID;                                               // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     ChatID;                                                   // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     Image;                                                    // 0x0080(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     ExImage;                                                  // 0x0090(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     ItemID;                                                   // 0x00A0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FPartsData>                          PartsData;                                                // 0x00B0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     ExPartsItemID;                                            // 0x00C0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	bool                                               CountFlag;                                                // 0x00D0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               DefaultFlag;                                              // 0x00D1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               EXNewGameFlag;                                            // 0x00D2(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               NoSwicthFlag;                                             // 0x00D3(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00D4(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.ArtifactDataList
// 0x0010
struct FArtifactDataList
{
	TArray<struct FArtifactData>                       DataList;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.TriviaSerifData
// 0x0018
struct FTriviaSerifData
{
	unsigned char                                      TalkerId;                                                 // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      Direction;                                                // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0002(0x0006) MISSED OFFSET
	struct FString                                     Label;                                                    // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.TriviaData
// 0x0020
struct FTriviaData
{
	struct FString                                     TriviaLabel;                                              // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FTriviaSerifData>                    SerifList;                                                // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.TriviaDataCollection
// 0x0010
struct FTriviaDataCollection
{
	TArray<struct FTriviaData>                         mData;                                                    // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.BattleHudOption
// 0x0004
struct FBattleHudOption
{
	unsigned char                                      bVisibleArtsHud : 1;                                      // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bVisiblePartyHud : 1;                                     // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bVisibleTpGauge : 1;                                      // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bVisibleHitCount : 1;                                     // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bVisibleStrikeHud : 1;                                    // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bVisiblePlayerHud : 1;                                    // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bVisibleTargetHud : 1;                                    // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
};

// ScriptStruct Arise.BattleHudNotifyText
// 0x0038
struct FBattleHudNotifyText
{
	int                                                ReplaceValue;                                             // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FScriptDelegate                             GetReplaceNotifyText;                                     // 0x0008(0x0014) (ZeroConstructor, InstancedReference)
	struct FDictionaryText                             Text;                                                     // 0x0018(0x0020)
};

// ScriptStruct Arise.BattleDelayDamge
// 0x0018
struct FBattleDelayDamge
{
	struct FVector                                     Position;                                                 // 0x0000(0x000C) (Transient, IsPlainOldData)
	int                                                Number;                                                   // 0x000C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                TickGroup;                                                // 0x0010(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      IsEnemey : 1;                                             // 0x0014(0x0001) (Transient)
	unsigned char                                      IsCritical : 1;                                           // 0x0014(0x0001) (Transient)
	unsigned char                                      IsWeak : 1;                                               // 0x0014(0x0001) (Transient)
	unsigned char                                      IsResist : 1;                                             // 0x0014(0x0001) (Transient)
	unsigned char                                      IsCore : 1;                                               // 0x0014(0x0001) (Transient)
	unsigned char                                      IsCoreBreak : 1;                                          // 0x0014(0x0001) (Transient)
	unsigned char                                      IsBoostBreak : 1;                                         // 0x0014(0x0001) (Transient)
	unsigned char                                      IsPoison : 1;                                             // 0x0014(0x0001) (Transient)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
};

// ScriptStruct Arise.BtlHudVisible_DatatableLabel
// 0x0008
struct FBtlHudVisible_DatatableLabel
{
	struct FName                                       Label;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.BtlArts_XmlDatatableLabel
// 0x0008
struct FBtlArts_XmlDatatableLabel
{
	struct FName                                       Label;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.BtlResultDropItem
// 0x000C
struct FBtlResultDropItem
{
	int                                                ItemID;                                                   // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                AddNum;                                                   // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsRareDorop;                                             // 0x0008(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsLimitOverNum;                                           // 0x0009(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsNewFlag;                                                // 0x000A(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x000B(0x0001) MISSED OFFSET
};

// ScriptStruct Arise.BattleResultHudInfomationPartyData
// 0x0010
struct FBattleResultHudInfomationPartyData
{
	int                                                Level;                                                    // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Exp;                                                      // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PrevHp;                                                   // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                RecoveryHp;                                               // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.BattleResultHudInfomation
// 0x00A8
struct FBattleResultHudInfomation
{
	TMap<EArisePartyID, struct FBattleResultHudInfomationPartyData> PartyData;                                                // 0x0000(0x0050) (ZeroConstructor)
	TArray<EArisePartyID>                              PartyOrder;                                               // 0x0050(0x0010) (ZeroConstructor)
	TArray<struct FBtlResultDropItem>                  DropItems;                                                // 0x0060(0x0010) (ZeroConstructor)
	int                                                ExpBase;                                                  // 0x0070(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Exp;                                                      // 0x0074(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ExpBonus;                                                 // 0x0078(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RpBase;                                                   // 0x007C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RP;                                                       // 0x0080(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RpBonus;                                                  // 0x0084(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AddBattleBonusBase;                                       // 0x0088(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AddBattleBonus;                                           // 0x008C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AddBattleBonusRate;                                       // 0x0090(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Time;                                                     // 0x0094(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PrevTp;                                                   // 0x0098(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxTp;                                                    // 0x009C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RecoveryTp;                                               // 0x00A0(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00A4(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.BtlSkillSetData
// 0x000C
struct FBtlSkillSetData
{
	int                                                SkillID;                                                  // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Value;                                                    // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                RisePoint;                                                // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.BtlAliasData
// 0x0090
struct FBtlAliasData
{
	int                                                ID;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FString                                     Label;                                                    // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     DlcName;                                                  // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	bool                                               Flag;                                                     // 0x0028(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0029(0x0003) MISSED OFFSET
	int                                                PartyId;                                                  // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	TArray<int>                                        LowAliases;                                               // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FItemParameterNamed>                 ParamNames;                                               // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FItemParameter>                      ParamNums;                                                // 0x0050(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FBtlSkillSetData>                    SkillSets;                                                // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     Picture;                                                  // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                AliasParamName;                                           // 0x0080(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                ParamValue;                                               // 0x0084(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Chapter;                                                  // 0x0088(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Section;                                                  // 0x008C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.BtlAliasDatabaseRow
// 0x0010
struct FBtlAliasDatabaseRow
{
	TArray<struct FBtlAliasData>                       Record;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.BtlArenaRewardData
// 0x0048
struct FBtlArenaRewardData
{
	struct FString                                     ItemLabel;                                                // 0x0000(0x0010) (ZeroConstructor, Deprecated)
	int                                                ItemID;                                                   // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Num;                                                      // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FString                                     Param00;                                                  // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	float                                              Value00;                                                  // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	struct FString                                     Param01;                                                  // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	float                                              Value01;                                                  // 0x0040(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.BtlArenaData
// 0x0110
struct FBtlArenaData
{
	int                                                ID;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FName                                       Label;                                                    // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       Name;                                                     // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       DlcName;                                                  // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Type;                                                     // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Class;                                                    // 0x0024(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Character;                                                // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Level;                                                    // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Chapter;                                                  // 0x0030(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
	struct FName                                       ScenarioBit;                                              // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               Hide;                                                     // 0x0040(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0041(0x0007) MISSED OFFSET
	TArray<struct FName>                               EncountGroup;                                             // 0x0048(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                Gald;                                                     // 0x0058(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Interval;                                                 // 0x005C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Time;                                                     // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               Down;                                                     // 0x0064(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               Fall;                                                     // 0x0065(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x0066(0x0002) MISSED OFFSET
	TArray<struct FBtlArenaRewardData>                 Reward;                                                   // 0x0068(0x0010) (ZeroConstructor, Deprecated)
	TArray<struct FBtlArenaRewardData>                 FirstRewards;                                             // 0x0078(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FBtlArenaRewardData>                 TargetRewards;                                            // 0x0088(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                FirstClear;                                               // 0x0098(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                TargetClear;                                              // 0x009C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FString                                     Alias;                                                    // 0x00A0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     PreEvent;                                                 // 0x00B0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     PostEventWin;                                             // 0x00C0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     PostEventLose;                                            // 0x00D0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     QuestID;                                                  // 0x00E0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     QuestStartFlag;                                           // 0x00F0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     QuestEndFlag;                                             // 0x0100(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.BtlArenaEventData
// 0x0038
struct FBtlArenaEventData
{
	struct FString                                     Label;                                                    // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     Name;                                                     // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FSoftObjectPath                             Path;                                                     // 0x0020(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
};

// ScriptStruct Arise.BtlArenaDatabaseRow
// 0x0020
struct FBtlArenaDatabaseRow
{
	TArray<struct FBtlArenaData>                       Record;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FBtlArenaEventData>                  Events;                                                   // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.BtlSkillData
// 0x00B0
struct FBtlSkillData
{
	struct FString                                     ID;                                                       // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     Name;                                                     // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     DlcName;                                                  // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                Type;                                                     // 0x0030(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Category;                                                 // 0x0034(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                SupportUnit;                                              // 0x0038(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                EffectScope;                                              // 0x003C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	TArray<struct FName>                               TargetEffects;                                            // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	float                                              Value;                                                    // 0x0050(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               Random;                                                   // 0x0054(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0055(0x0003) MISSED OFFSET
	int                                                Reality;                                                  // 0x0058(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Probabillity;                                             // 0x005C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              Add;                                                      // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              Max;                                                      // 0x0064(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FString                                     High;                                                     // 0x0068(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FItemParameterNamed>                 ParamNames;                                               // 0x0078(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                SkillID;                                                  // 0x0088(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                IconNo;                                                   // 0x008C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EBtlSkillUnit                                      Unit;                                                     // 0x0090(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0091(0x0003) MISSED OFFSET
	float                                              FixValue;                                                 // 0x0094(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FSoftObjectPath                             Script;                                                   // 0x0098(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
};

// ScriptStruct Arise.BtlSkillDatabaseRow
// 0x0010
struct FBtlSkillDatabaseRow
{
	TArray<struct FBtlSkillData>                       Record;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.BtlArtsHandle
// 0x0020
struct FBtlArtsHandle
{
	TWeakObjectPtr<class ABtlCharacterBase>            OwnerUnit;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	struct FName                                       ArtsLabel;                                                // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	int                                                ArtsIndex;                                                // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	int                                                ArtsSlotIndex;                                            // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	int                                                ArtsRequestId;                                            // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.UsedArtsInfo
// 0x0018
struct FUsedArtsInfo
{
	int                                                Count;                                                    // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<struct FName>                               Targeted;                                                 // 0x0008(0x0010) (ZeroConstructor)
};

// ScriptStruct Arise.ActionHittedUnitInfo
// 0x0010
struct FActionHittedUnitInfo
{
	class ABtlCharacterBase*                           Unit;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EActionCriticalStatus                              Critical;                                                 // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               EnduranceCalculated;                                      // 0x0009(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x000A(0x0006) MISSED OFFSET
};

// ScriptStruct Arise.ActionHittedUnit
// 0x0030
struct FActionHittedUnit
{
	struct FBtlArtsHandle                              ArtsHandle;                                               // 0x0000(0x0020) (Edit, BlueprintVisible)
	TArray<struct FActionHittedUnitInfo>               Hitted;                                                   // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.ActionArtsTurnTargetInfo
// 0x0001
struct FActionArtsTurnTargetInfo
{
	unsigned char                                      bIsTurnTarget : 1;                                        // 0x0000(0x0001)
	unsigned char                                      bIsManualInput : 1;                                       // 0x0000(0x0001)
};

// ScriptStruct Arise.ActionCancelParam
// 0x0020
struct FActionCancelParam
{
	bool                                               bAttack;                                                  // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bMove;                                                    // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bJump;                                                    // 0x0002(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bStep;                                                    // 0x0003(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bGuard;                                                   // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bMagic;                                                   // 0x0005(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bItem;                                                    // 0x0006(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0007(0x0001) MISSED OFFSET
	int                                                RequiredArtsCount;                                        // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                UserValue;                                                // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     UserString;                                               // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.BtlAISignalData
// 0x0008
struct FBtlAISignalData
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct Arise.BtlTacticsData
// 0x0038
struct FBtlTacticsData
{
	int                                                ID;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FString                                     DlcName;                                                  // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FName                                       Label;                                                    // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EBtlTacticsCategory                                Category;                                                 // 0x0020(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EBtlTacticsCondition                               Condition;                                                // 0x0021(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EBtlTacticsAction                                  Action;                                                   // 0x0022(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EBtlTacticsHow                                     How;                                                      // 0x0023(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                argInt;                                                   // 0x0024(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              argFloat;                                                 // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	struct FName                                       argName;                                                  // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.BtlTacticsRequestAI
// 0x00B8
struct FBtlTacticsRequestAI
{
	bool                                               isRequest;                                                // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FBtlTacticsData                             Condition;                                                // 0x0008(0x0038) (BlueprintVisible, BlueprintReadOnly, Transient)
	struct FBtlTacticsData                             How;                                                      // 0x0040(0x0038) (BlueprintVisible, BlueprintReadOnly, Transient)
	struct FBtlTacticsData                             Action;                                                   // 0x0078(0x0038) (BlueprintVisible, BlueprintReadOnly, Transient)
	class ABtlCharacterBase*                           Target;                                                   // 0x00B0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct Arise.BtlAIParameter
// 0x0088
struct FBtlAIParameter
{
	int                                                Phase;                                                    // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     MovePoint;                                                // 0x0004(0x000C) (Transient, IsPlainOldData)
	TEnumAsByte<EEnvQueryStatus>                       MovePointEqs;                                             // 0x0010(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	struct FVector                                     TargetGoal;                                               // 0x0014(0x000C) (Transient, IsPlainOldData)
	struct FName                                       RequestArts;                                              // 0x0020(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBtlActionQuery*                             QueryArts;                                                // 0x0028(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBtlActionQuery*                             QueryMove;                                                // 0x0030(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBtlActionQuery*                             QueryTurn;                                                // 0x0038(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBtlActionQuery*                             QueryStep;                                                // 0x0040(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBtlActionQuery*                             QueryGuardStart;                                          // 0x0048(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBtlActionQuery*                             QueryGuardEnd;                                            // 0x0050(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBtlActionQuery*                             QueryItem;                                                // 0x0058(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class ABtlCharacterBase*                           TargetArts;                                               // 0x0060(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class ABtlCharacterBase*                           TargetDetect;                                             // 0x0068(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                Random;                                                   // 0x0070(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     IdlePoint;                                                // 0x0074(0x000C) (Transient, IsPlainOldData)
	bool                                               bFollowingPlayer;                                         // 0x0080(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0081(0x0007) MISSED OFFSET
};

// ScriptStruct Arise.BtlActiveArts
// 0x0018
struct FBtlActiveArts
{
	class ABtlCharacterBase*                           Owner;                                                    // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class ABtlCharacterBase*                           Target;                                                   // 0x0008(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       Label;                                                    // 0x0010(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.SkillDataString
// 0x0080
struct FSkillDataString
{
	struct FDictionaryText                             SkillName;                                                // 0x0000(0x0020) (BlueprintVisible, BlueprintReadOnly)
	struct FDictionaryText                             MaxSkillName;                                             // 0x0020(0x0020) (BlueprintVisible, BlueprintReadOnly)
	struct FDictionaryText                             SkillExplanation;                                         // 0x0040(0x0020) (BlueprintVisible, BlueprintReadOnly)
	struct FDictionaryText                             MaxSkillExplanation;                                      // 0x0060(0x0020) (BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct Arise.AliasDataString
// 0x0060
struct FAliasDataString
{
	struct FDictionaryText                             Name;                                                     // 0x0000(0x0020) (BlueprintVisible, BlueprintReadOnly)
	struct FDictionaryText                             Explanation;                                              // 0x0020(0x0020) (BlueprintVisible, BlueprintReadOnly)
	struct FDictionaryText                             Locked;                                                   // 0x0040(0x0020) (BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct Arise.BtlAnimSpecialNodeMemory
// 0x0010
struct FBtlAnimSpecialNodeMemory
{
	TArray<unsigned char>                              Memory;                                                   // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct Arise.BtlSphereCollisionInfo
// 0x0014
struct FBtlSphereCollisionInfo
{
	struct FVector                                     Location;                                                 // 0x0000(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	float                                              Scale;                                                    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SphereRadius;                                             // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.BtlCameraAnimStartParameter
// 0x001C
struct FBtlCameraAnimStartParameter
{
	EBtlCameraAnimStartType                            Type;                                                     // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FVector                                     OffsetLocation;                                           // 0x0004(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FRotator                                    OffsetRotation;                                           // 0x0010(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
};

// ScriptStruct Arise.AttackSphereParam
// 0x0050
struct FAttackSphereParam
{
	int                                                CollisionGroupID;                                         // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              HitIntervalSec;                                           // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                HitCountLimit;                                            // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	struct FName                                       HitStatusLabel;                                           // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       SystemEffectOnHit;                                        // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       HitDirectionLabel;                                        // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EDestructibleType                                  DestructibleType;                                         // 0x0028(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EBtlDestructFilterLevel                            DestructibleFilterType;                                   // 0x0029(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x002A(0x0006) MISSED OFFSET
	struct FName                                       ArtsLabel;                                                // 0x0030(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              HitHoldHeightSec;                                         // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PredictFrame;                                             // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsInstantDeath;                                          // 0x0040(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsAllowance;                                             // 0x0041(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsFriendlyFire;                                          // 0x0042(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUnbindAnimLocation;                                      // 0x0043(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DamageWeight;                                             // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bOverrideElement;                                         // 0x0048(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EBtlElementType                                    Element;                                                  // 0x0049(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x004A(0x0006) MISSED OFFSET
};

// ScriptStruct Arise.Btl_MagicSpawnParam
// 0x0038
struct FBtl_MagicSpawnParam
{
	bool                                               bLocationCenter;                                          // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FName                                       LocationSocket;                                           // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	EBtlMagicLocationType                              LocationType;                                             // 0x0010(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	struct FVector                                     LocationOffset;                                           // 0x0014(0x000C) (Edit, IsPlainOldData)
	struct FName                                       RotationSocket;                                           // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	EBtlMagicRotationType                              RotationType;                                             // 0x0028(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0029(0x0003) MISSED OFFSET
	struct FRotator                                    RotationOffset;                                           // 0x002C(0x000C) (Edit, IsPlainOldData)
};

// ScriptStruct Arise.Btl_MagicSpawnLocationParam
// 0x0020
struct FBtl_MagicSpawnLocationParam
{
	struct FName                                       Socket;                                                   // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBtlMagicRelativeType                              Type;                                                     // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	struct FVector                                     Offset;                                                   // 0x000C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	bool                                               bCenter;                                                  // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
};

// ScriptStruct Arise.Btl_MagicSpawnRotationParam
// 0x0018
struct FBtl_MagicSpawnRotationParam
{
	struct FName                                       Socket;                                                   // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBtlMagicRelativeType                              Type;                                                     // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	struct FRotator                                    Offset;                                                   // 0x000C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
};

// ScriptStruct Arise.BtlVoice_DatabaseLabel
// 0x0010
struct FBtlVoice_DatabaseLabel
{
	struct FString                                     Label;                                                    // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.BtlAreaSpawnEnemy
// 0x0010
struct FBtlAreaSpawnEnemy
{
	int                                                LocationIndex;                                            // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FName                                       UnitID;                                                   // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.BtlResultArtsRange
// 0x0005
struct FBtlResultArtsRange
{
	bool                                               UsableRange;                                              // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	bool                                               LessDistance;                                             // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	bool                                               GreaterDistance;                                          // 0x0002(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	bool                                               LessHeight;                                               // 0x0003(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	bool                                               GreaterHeight;                                            // 0x0004(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.BtlArtsElement
// 0x0008
struct FBtlArtsElement
{
	EBtlElementType                                    Element;                                                  // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                ElementPower;                                             // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.BtlArtsUniqueParam
// 0x0008
struct FBtlArtsUniqueParam
{
	EBtlArtsUniqueParam                                Unique;                                                   // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                UniqueValue;                                              // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.BtlArtsData
// 0x00B8
struct FBtlArtsData
{
	int                                                ID;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FName                                       DlcName;                                                  // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       Label;                                                    // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EBtlArtsType                                       Type;                                                     // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EBtlArtsAction                                     Action;                                                   // 0x0019(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x001A(0x0002) MISSED OFFSET
	int                                                Power;                                                    // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Penetrate;                                                // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                HitCount;                                                 // 0x0024(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                SP;                                                       // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                TP;                                                       // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	TArray<struct FBtlArtsElement>                     Element;                                                  // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FBtlArtsUniqueParam>                 Unique;                                                   // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	EBtlMagicRank                                      MagicRank;                                                // 0x0050(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0051(0x0007) MISSED OFFSET
	struct FName                                       HigherMagic;                                              // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                DistanceNear;                                             // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                DistanceFar;                                              // 0x0064(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                AngleRange;                                               // 0x0068(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                AngleOffset;                                              // 0x006C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                HeightUp;                                                 // 0x0070(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                HeightDown;                                               // 0x0074(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              TurnDistance;                                             // 0x0078(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              TurnSpeed;                                                // 0x007C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              TurnTime;                                                 // 0x0080(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                HudIconIndex;                                             // 0x0084(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                MenuPriority;                                             // 0x0088(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              HateRate;                                                 // 0x008C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       FireSwordArts;                                            // 0x0090(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               UniqueSkillArts;                                          // 0x0098(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EBtlArtsFinishedPosition                           FinishedPosition;                                         // 0x0099(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x009A(0x0002) MISSED OFFSET
