#pragma once

// Name: Arise, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class Arise.AccessoryExpTable
// 0x0030 (0x01E8 - 0x01B8)
class UAccessoryExpTable : public UXmlDatabaseBase
{
public:
	struct FAccessoryExpTableRow                       Database;                                                 // 0x01B8(0x0030) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AccessoryExpTable");
		return ptr;
	}

};


// Class Arise.AINavLinkProxy
// 0x0000 (0x0378 - 0x0378)
class AAINavLinkProxy : public ANavLinkProxy
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AINavLinkProxy");
		return ptr;
	}

};


// Class Arise.AlphaMaskComponent
// 0x0100 (0x01F8 - 0x00F8)
class UAlphaMaskComponent : public UActorComponent
{
public:
	float                                              AlphaMaskValue;                                           // 0x00F8(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData)
	TWeakObjectPtr<class AAlphaMaskManagerActor>       OwnerAlphaMaskManager;                                    // 0x00FC(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               RuntimeTickSwichable;                                     // 0x0104(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0105(0x0003) MISSED OFFSET
	float                                              InterpolationTime;                                        // 0x0108(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	TEnumAsByte<EAlphaMask>                            AlphaMaskType;                                            // 0x010C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x010D(0x0003) MISSED OFFSET
	TArray<class UMeshComponent*>                      MeshComponents;                                           // 0x0110(0x0010) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst)
	TArray<class UParticleSystemComponent*>            ParticleSystemComponents;                                 // 0x0120(0x0010) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst)
	TArray<class UCameraFadeComponent*>                CameraFadeComponents;                                     // 0x0130(0x0010) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst)
	class UAlphaMaskTask*                              PriorityTopTask;                                          // 0x0140(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData)
	TArray<class UAlphaMaskTask*>                      Tasks;                                                    // 0x0148(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst)
	struct FName                                       DefaultParameterName;                                     // 0x0158(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EAlphaMaskDirection                                FadeOutDirection;                                         // 0x0160(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0161(0x0003) MISSED OFFSET
	float                                              InvisibleMinValue;                                        // 0x0164(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsUseTaskTickableCameraDistance;                         // 0x0168(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0169(0x0003) MISSED OFFSET
	float                                              TaskTickableCameraDistance;                               // 0x016C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     TaskTickableCameraOffset;                                 // 0x0170(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	float                                              CameraDistanceSquared;                                    // 0x017C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData04[0x1];                                       // 0x0180(0x0001) MISSED OFFSET
	bool                                               bIsSortRequest;                                           // 0x0181(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x6];                                       // 0x0182(0x0006) MISSED OFFSET
	struct FAlphaMaskFadeTaskNode                      CameraFadeTask;                                           // 0x0188(0x0010) (Edit, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsStartupFadeTask;                                        // 0x0198(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x0199(0x0003) MISSED OFFSET
	int                                                CameraFadeEnableFlags;                                    // 0x019C(0x0004) (Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData)
	bool                                               bIsAutoCollection;                                        // 0x01A0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x01A1(0x0003) MISSED OFFSET
	unsigned char                                      bIsBindBuildCharacter : 1;                                // 0x01A4(0x0001) (Transient)
	unsigned char                                      UnknownData08[0x3];                                       // 0x01A5(0x0003) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnFadeInExecute;                                          // 0x01A8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnFadeInComplete;                                         // 0x01B8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnFadeOutExecute;                                         // 0x01C8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnFadeOutComplete;                                        // 0x01D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnFadeChange;                                             // 0x01E8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AlphaMaskComponent");
		return ptr;
	}


	void SetAlphaMaskVisibleParticle(class UParticleSystemComponent* ParticleSystem);
	void SetAlphaMaskVisible(class UMeshComponent* MeshComponent);
	void SetAlphaMaskValueParticle(class UParticleSystemComponent* ParticleSystem, float Alpha);
	void SetAlphaMaskValue(class UMeshComponent* MeshComponent, float Alpha);
	void SetAlphaMaskType(TEnumAsByte<EAlphaMask> NewValue);
	void SetAlphaMaskInvisibleParticle(class UParticleSystemComponent* ParticleSystem);
	void SetAlphaMaskInvisible(class UMeshComponent* MeshComponent);
	void SetAllAlphaMaskVisible();
	void SetAllAlphaMaskValue(float Alpha);
	void SetAllAlphaMaskInvisible();
	void Received_OnFadeOutExecute();
	void Received_OnFadeOutComplete();
	void Received_OnFadeInExecute();
	void Received_OnFadeInComplete();
	TArray<class UMeshComponent*> Received_CollectionMeshComponent();
	TArray<class UCameraFadeComponent*> Received_CollectionCameraFadeComponent();
	void OnEndCameraAnimInternal(class AArisePlayerCameraManager* CameraMaanager);
	void OnBuildCharacterInternal();
	void OnBeginCameraAnimInternal(class AArisePlayerCameraManager* CameraMaanager, class UCameraAnimInst* CameraAnim);
	bool IsVisible();
	bool IsInvisible();
	bool IsFading();
	bool IsFadeout();
	bool IsFadein();
	bool HasTargetMeshComponents();
	float GetVisiableValue();
	TArray<class UParticleSystemComponent*> GetTargetParticleComponents();
	TArray<class UMeshComponent*> GetTargetMeshComponents();
	float GetInvisiableValue();
	TArray<class UCameraFadeComponent*> GetCameraFadeComponents();
	void ForceStopFadeTask();
	void FadeOutComplete_Callback(TEnumAsByte<EAlphaMask> ResultType);
	void FadeOut(float FadeTime);
	void FadeInComplete_Callback(TEnumAsByte<EAlphaMask> ResultType);
	void FadeIn(float FadeTime);
	void FadeEventSignature__DelegateSignature();
	void FadeEventChangeSignature__DelegateSignature(TEnumAsByte<EAlphaMask> Prev, TEnumAsByte<EAlphaMask> Current);
	void ExclusionMeshByClass(TArray<class UClass*> ExclusionClasses);
	void ExclusionMesh(TArray<class UMeshComponent*> ExclusionMeshComponents);
	void EnableCameraFade(EAlphaMaskFlagCategory Category);
	void DisableCameraFade(EAlphaMaskFlagCategory Category);
	void DebugForceVisible();
	void DebugForceInvisible();
	void DebugForceFadeOut();
	void DebugForceFadeIn();
	void CollectionParticleSystemComponent();
	void CollectionMeshComponent();
	void CollectionComponents();
	void CollectionCameraFadeComponent();
	void AlphaBranch(EAlphaMaskBranch* MaskOutputExec);
};


// Class Arise.AlphaMaskManagerActor
// 0x0040 (0x0368 - 0x0328)
class AAlphaMaskManagerActor : public AInfo
{
public:
	class UDataTable*                                  PriorityTable;                                            // 0x0328(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UAlphaMaskComponent*>                 AlphaMaskCompoentns;                                      // 0x0330(0x0010) (ExportObject, ZeroConstructor, Transient)
	struct FScriptMulticastDelegate                    OnAssignAlphaMask;                                        // 0x0340(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnUnassignAlphaMask;                                      // 0x0350(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               bTaskTickEnable;                                          // 0x0360(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0361(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AlphaMaskManagerActor");
		return ptr;
	}


	void OnChangeDisplayScene(unsigned char ChangedScene, unsigned char OldScene);
	void AlphaMask_UnassignSignature__DelegateSignature(class UAlphaMaskComponent* RemoveAlphaMask);
	void AlphaMask_AssignSignature__DelegateSignature(class UAlphaMaskComponent* NewAlphaMask);
};


// Class Arise.AlphaMaskTask
// 0x0018 (0x0040 - 0x0028)
class UAlphaMaskTask : public UObject
{
public:
	TWeakObjectPtr<class UAlphaMaskComponent>          OwnerComponent;                                           // 0x0028(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	int                                                Priority;                                                 // 0x0030(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                PriorityGranularity;                                      // 0x0034(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	struct FAlphaMaskPriorityLabel                     PriorityLabel;                                            // 0x0038(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AlphaMaskTask");
		return ptr;
	}


	void VisualReflect();
	void Tick(float Delta);
	bool StopRequest(bool bForce);
	void OnChangePriorityTop(class UAlphaMaskTask* PrevTopPriorityTask);
	bool IsComplate();
	void End();
	void Begin();
};


// Class Arise.AlphaMaskCameraFadeTask
// 0x0020 (0x0060 - 0x0040)
class UAlphaMaskCameraFadeTask : public UAlphaMaskTask
{
public:
	float                                              CameraFadeTime;                                           // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
	struct FAlphaMaskPriorityLabel                     CameraFadeLabel;                                          // 0x0048(0x0008)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0050(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AlphaMaskCameraFadeTask");
		return ptr;
	}


	void SetMethodMeshCheckDistanceBoundingSphere(bool IsAnyMeshCheck, float DistanceFadein, float DistanceFadeout);
	void SetMethodMeshCheckDistanceBoundingBox(bool IsAnyMeshCheck, float DistanceFadein, float DistanceFadeout);
	void SetMethodCameraFadeCheck(bool IsAnyCheck);
	void MeshCheckSignature__DelegateSignature(class UMeshComponent* MeshCmp, bool* Check);
	bool IsFadeOutAble();
	bool IsFadeInAble();
	bool STATIC_IsAnyOfMeshComponent(TArray<class UMeshComponent*> TargetComponents, const struct FScriptDelegate& Condition);
	bool STATIC_IsAnyOfCameraFadeComponent(TArray<class UCameraFadeComponent*> TargetComponents, const struct FScriptDelegate& Condition);
	bool STATIC_IsAllOfMeshComponent(TArray<class UMeshComponent*> TargetComponents, const struct FScriptDelegate& Condition);
	bool STATIC_IsAllOfCameraFadeComponent(TArray<class UCameraFadeComponent*> TargetComponents, const struct FScriptDelegate& Condition);
	bool IntersectSingleLineBoundingBox(class UMeshComponent* TargetMesh, float RayLength, const struct FVector& SizeOffset);
	bool IntersectSingleCameraFadeSphere(class UCameraFadeComponent* FadeComponent, ECameraFadeType Type);
	bool IntersectSingleCameraBoundingSphere(class UMeshComponent* TargetMesh, float Distance);
	bool IntersectSingleCameraBoundingBox(class UMeshComponent* TargetMesh, const struct FVector& SizeOffset);
	bool IntersectMultiLineBoundingBox(bool bIsAnyof, float RayLength, const struct FVector& SizeOffset);
	bool IntersectMultiCameraFadeSphere(bool bIsAnyof, ECameraFadeType Type);
	bool IntersectMultiCameraBoundingSphere(bool bIsAnyof, float Distance);
	bool IntersectMultiCameraBoundingBox(bool bIsAnyof, const struct FVector& SizeOffset);
	void CameraFadeCheckSignature__DelegateSignature(class UCameraFadeComponent* CameraFadeCmp, bool* Check);
};


// Class Arise.AlphaMaskCameraFade_CameraFadeCompTask
// 0x0008 (0x0068 - 0x0060)
class UAlphaMaskCameraFade_CameraFadeCompTask : public UAlphaMaskCameraFadeTask
{
public:
	bool                                               IsAnyCheck;                                               // 0x0060(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0061(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AlphaMaskCameraFade_CameraFadeCompTask");
		return ptr;
	}

};


// Class Arise.AsyncTaskAlphaMaskFadeProxyBase
// 0x0020 (0x0060 - 0x0040)
class UAsyncTaskAlphaMaskFadeProxyBase : public UAlphaMaskTask
{
public:
	struct FScriptMulticastDelegate                    OnComplete;                                               // 0x0040(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnFailed;                                                 // 0x0050(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AsyncTaskAlphaMaskFadeProxyBase");
		return ptr;
	}

};


// Class Arise.AsyncTaskAlphaMaskFadeProxy
// 0x0030 (0x0090 - 0x0060)
class UAsyncTaskAlphaMaskFadeProxy : public UAsyncTaskAlphaMaskFadeProxyBase
{
public:
	TArray<TWeakObjectPtr<class UMeshComponent>>       MeshComponents;                                           // 0x0060(0x0010) (ExportObject, ZeroConstructor, Transient)
	TArray<TWeakObjectPtr<class UParticleSystemComponent>> ParticleSystemComponents;                                 // 0x0070(0x0010) (ExportObject, ZeroConstructor, Transient)
	float                                              InterpolationTime;                                        // 0x0080(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              ElapsedTime;                                              // 0x0084(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              Alpha;                                                    // 0x0088(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	TEnumAsByte<EAlphaMask>                            AlphaMaskType;                                            // 0x008C(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bEnd;                                                     // 0x008D(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsMasterFade;                                            // 0x008E(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x008F(0x0001) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AsyncTaskAlphaMaskFadeProxy");
		return ptr;
	}

};


// Class Arise.AsyncTaskAlphaMaskGroupFadeProxy
// 0x0000 (0x0040 - 0x0040)
class UAsyncTaskAlphaMaskGroupFadeProxy : public UAlphaMaskTask
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AsyncTaskAlphaMaskGroupFadeProxy");
		return ptr;
	}

};


// Class Arise.AlphaMaskHelperLibrary
// 0x0000 (0x0028 - 0x0028)
class UAlphaMaskHelperLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AlphaMaskHelperLibrary");
		return ptr;
	}


	class UAsyncTaskAlphaMaskFadeProxy* STATIC_CreateMultiAlphaMaskFadeProxyObject(const struct FAlphaMaskPriorityLabel& PriorityCategory, class UAlphaMaskComponent* Owner, TArray<class UMeshComponent*> Meshs, TEnumAsByte<EAlphaMask> Type, float InterpolationTime);
	class UAsyncTaskAlphaMaskFadeProxy* STATIC_CreateMasterAlphaMaskFadeProxyObject(const struct FAlphaMaskPriorityLabel& PriorityCategory, class UAlphaMaskComponent* Owner, TEnumAsByte<EAlphaMask> Type, float InterpolationTime, bool bOverlapUsePrevStartAlpha);
	class UAsyncTaskAlphaMaskFadeProxy* STATIC_CreateAlphaMaskFadeProxyObject(const struct FAlphaMaskPriorityLabel& PriorityCategory, class UAlphaMaskComponent* Owner, class UMeshComponent* Mesh, TEnumAsByte<EAlphaMask> Type, float InterpolationTime);
	void STATIC_AlphaBranch(class UAlphaMaskComponent* Target, class UMeshComponent* TargetMesh, EAlphaMaskBranch* MaskOutputExec);
};


// Class Arise.AriseAccountManager
// 0x0000 (0x0028 - 0x0028)
class UAriseAccountManager : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseAccountManager");
		return ptr;
	}


	bool TryGetUserLocale(struct FString* Locale);
	bool QueryUserInfo();
};


// Class Arise.AriseAnimCameraActor
// 0x0020 (0x1050 - 0x1030)
class AAriseAnimCameraActor : public ACameraActor
{
public:
	class AArisePlayerCameraManager*                   Manager;                                                  // 0x1030(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UCameraAnimInst*                             CameraAnimInst;                                           // 0x1038(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x1040(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseAnimCameraActor");
		return ptr;
	}


	void Received_EndCameraAnimation();
	void Received_BeginCameraAnimation();
	void EndCameraAnimation(class AArisePlayerCameraManager* PlyaerCameraManager, class UCameraAnimInst* EndCameraAnimInst);
};


// Class Arise.AriseArtifactLibraray
// 0x0000 (0x0028 - 0x0028)
class UAriseArtifactLibraray : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseArtifactLibraray");
		return ptr;
	}


	void STATIC_SetArtifactEnabled(const struct FString& InArtifactLabel, bool bNewEnable);
	void STATIC_OutputLog_State();
	void OnArtifactEnableChangedDelegate__DelegateSignature(const struct FName& InSkillID, bool bNewEnabled);
	bool STATIC_IsUnlockDifficultyUnknown();
	bool STATIC_IsUnlockDifficultyEasiest();
	bool STATIC_IsUnlockDifficultyChaos();
	bool STATIC_IsNoTrackingEncountSymbol();
	bool STATIC_IsEnableRiskOrLife();
	bool STATIC_IsAllDamageOne();
	int STATIC_GetWeaponMaterialNeedNum();
	int STATIC_GetVolumeUpNum_DropItem();
	int STATIC_GetVolumeUpNum_BreakPoint();
	int STATIC_GetVolumeUpMax_BreakPoint();
	int STATIC_GetUnlockedItemMaxNum_Tool();
	float STATIC_GetRPUpRate();
	float STATIC_GetPriceUpRate();
	float STATIC_GetPriceDownRate_Shop();
	float STATIC_GetPriceDownRate_AccessoryShop();
	float STATIC_GetHerbUpRate_Penetrate();
	float STATIC_GetHerbUpRate_HPMax();
	float STATIC_GetHerbUpRate_Endurance();
	float STATIC_GetHerbUpRate_ElementDefence();
	float STATIC_GetHerbUpRate_ElementAttack();
	float STATIC_GetHerbUpRate_Defence();
	float STATIC_GetHerbUpRate_Attack();
	float STATIC_GetGradeUpRate();
	float STATIC_GetExtUpRate();
	float STATIC_GetCPCostDownRate();
	float STATIC_GetCookTimeUpRate();
	int STATIC_GetCookTimeUp(int InFoodNum);
	int STATIC_GetCookMaterialNeedNum();
	float STATIC_GetCollectRate();
	int STATIC_GetArtifactCompleteNum();
	void STATIC_ExecuteArtifactEnableChanged();
};


// Class Arise.AriseArtifactConsoleCommands
// 0x0000 (0x0028 - 0x0028)
class UAriseArtifactConsoleCommands : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseArtifactConsoleCommands");
		return ptr;
	}


	void ArtifactOutputLog_State();
};


// Class Arise.AriseAssetManager
// 0x0000 (0x0028 - 0x0028)
class UAriseAssetManager : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseAssetManager");
		return ptr;
	}


	void STATIC_K2_Unload();
	class UObject* STATIC_K2_LoadSync();
	bool STATIC_K2_LoadAsync();
	bool STATIC_K2_IsValid();
};


// Class Arise.AriseAutoSave
// 0x0038 (0x0060 - 0x0028)
class UAriseAutoSave : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnStartEvent;                                             // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnEndEvent;                                               // 0x0040(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               bSaving;                                                  // 0x0050(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0051(0x0007) MISSED OFFSET
	class UAriseSave*                                  CacheSave;                                                // 0x0058(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseAutoSave");
		return ptr;
	}

};


// Class Arise.AriseAutoSaveLibrary
// 0x0000 (0x0028 - 0x0028)
class UAriseAutoSaveLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseAutoSaveLibrary");
		return ptr;
	}


	bool STATIC_IsAutoSaving();
	void STATIC_AutoSave();
};


// Class Arise.AriseBlueprintAssetDatabaseObject
// 0x0010 (0x01C8 - 0x01B8)
class UAriseBlueprintAssetDatabaseObject : public UXmlDatabaseBase
{
public:
	struct FAriseBlueprintAssetDatabase                Database;                                                 // 0x01B8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseBlueprintAssetDatabaseObject");
		return ptr;
	}

};


// Class Arise.AriseBlueprintAssetManager
// 0x0000 (0x0028 - 0x0028)
class UAriseBlueprintAssetManager : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseBlueprintAssetManager");
		return ptr;
	}


	void STATIC_UnloadById(const struct FName& ID);
	void STATIC_UnloadByCategoryAndId(EAriseBlueprintAssetCategory Category, const struct FName& ID);
	void STATIC_UnloadByCategory(EAriseBlueprintAssetCategory Category);
	void STATIC_SetLoadPolicy(EAriseBlueprintAssetLoadPolicy NewPolicy);
	void STATIC_LoadDatabase();
	bool STATIC_LoadById(const struct FName& ID);
	bool STATIC_LoadByCategoryAndId(EAriseBlueprintAssetCategory Category, const struct FName& ID);
	bool STATIC_LoadByCategory(EAriseBlueprintAssetCategory Category);
	void STATIC_K2_AwaitLoadedById(class UObject* WorldContextObject, const struct FName& ID, const struct FLatentActionInfo& LatentInfo);
	void STATIC_K2_AwaitLoadedByCategory(class UObject* WorldContextObject, EAriseBlueprintAssetCategory Category, const struct FLatentActionInfo& LatentInfo);
	bool STATIC_IsLoadedById(const struct FName& ID);
	bool STATIC_IsLoadedByCategoryAndId(EAriseBlueprintAssetCategory Category, const struct FName& ID);
	bool STATIC_IsLoadedByCategory(EAriseBlueprintAssetCategory Category);
	class UClass* STATIC_GetClassById(const struct FName& ID);
	class UClass* STATIC_GetClassByCategoryAndId(EAriseBlueprintAssetCategory Category, const struct FName& ID);
	class UObject* STATIC_CreateById(const struct FName& ID, class UObject* Outer);
	class UObject* STATIC_CreateByCategoryAndId(EAriseBlueprintAssetCategory Category, const struct FName& ID, class UObject* Outer);
};


// Class Arise.AriseCameraModifier_CameraShake
// 0x0008 (0x0068 - 0x0060)
class UAriseCameraModifier_CameraShake : public UCameraModifier_CameraShake
{
public:
	bool                                               bIsPause;                                                 // 0x0060(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0061(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseCameraModifier_CameraShake");
		return ptr;
	}


	void SetPause(bool IsPause);
};


// Class Arise.AriseCharacter
// 0x00A0 (0x07F0 - 0x0750)
class AAriseCharacter : public AASCharacterBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0750(0x0008) MISSED OFFSET
	struct FName                                       CharacterID;                                              // 0x0758(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bBlockBuild;                                              // 0x0760(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bUseIK;                                                   // 0x0761(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bUseIKTwist;                                              // 0x0762(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bUseAdjustGround;                                         // 0x0763(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              InterpHeightSpeed;                                        // 0x0764(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FAriseCharacterPartsData                    PartsData;                                                // 0x0768(0x0050)
	TArray<class UMeshComponent*>                      CombinePartsComponents;                                   // 0x07B8(0x0010) (ExportObject, ZeroConstructor)
	TArray<class UCharacterFootstep*>                  Footsteps;                                                // 0x07C8(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x1];                                       // 0x07D8(0x0001) MISSED OFFSET
	bool                                               bBuilded;                                                 // 0x07D9(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x16];                                      // 0x07DA(0x0016) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseCharacter");
		return ptr;
	}


	void K2_RequestBuild(const struct FName& NewCharaID, bool bBlock);
	struct FRotator K2_GetFootstepTwistRotator(const struct FName& SocketName);
	struct FName K2_GetFootstepSocketName(int Index);
	struct FVector K2_GetFootstepEffectorLocation(const struct FName& SocketName);
};


// Class Arise.AriseIconWidgetBase
// 0x0010 (0x0218 - 0x0208)
class UAriseIconWidgetBase : public UUserWidget
{
public:
	class UMaterialInstanceDynamic*                    TargetMaterial;                                           // 0x0208(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FName                                       IconParameterName;                                        // 0x0210(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseIconWidgetBase");
		return ptr;
	}


	class UImage* GetTargetImage();
};


// Class Arise.AriseCharaIconWidgetBase
// 0x0028 (0x0240 - 0x0218)
class UAriseCharaIconWidgetBase : public UAriseIconWidgetBase
{
public:
	bool                                               IsLoading;                                                // 0x0218(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0219(0x0007) MISSED OFFSET
	struct FSoftObjectPath                             CurrentPath;                                              // 0x0220(0x0018) (Transient)
	int                                                IconLoadPriority;                                         // 0x0238(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x023C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseCharaIconWidgetBase");
		return ptr;
	}


	void SetIconLoadPriority(int NewPriority);
	void SetIconLabel(const struct FString& IconLabel);
	void SetIcon_PartyId(EArisePartyID PartyId);
	void SetIcon(EAriseCharaIconID IconId);
	void Received_LoadStart();
	void Received_LoadComplate();
	void AssetLoadComplete(class UObject* Object);
};


// Class Arise.AriseBattleCharaIconWidgetBase
// 0x0000 (0x0240 - 0x0240)
class UAriseBattleCharaIconWidgetBase : public UAriseCharaIconWidgetBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseBattleCharaIconWidgetBase");
		return ptr;
	}

};


// Class Arise.AriseCheatManager
// 0x0000 (0x0078 - 0x0078)
class UAriseCheatManager : public UCheatManager
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseCheatManager");
		return ptr;
	}

};


// Class Arise.AriseChunkInstall
// 0x0000 (0x0028 - 0x0028)
class UAriseChunkInstall : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseChunkInstall");
		return ptr;
	}


	void STATIC_SetChunkInstallSpeed(EAriseChunkInstallSpeed iSpeed);
	void STATIC_SetChunkInstallPriority(EAriseChunkNo iChunkNo, EAriseChunkInstallPriority iPriority);
	bool STATIC_IsChunkInstalled(EAriseChunkNo iChunkNo);
	bool STATIC_IsAllChunkInstalled();
	EAriseChunkLocation STATIC_GetChunkLocation(EAriseChunkNo iChunkNo);
	EAriseChunkInstallSpeed STATIC_GetChunkInstallSpeed();
	float STATIC_GetChunkInstallProgressSec(EAriseChunkNo iChunkNo);
	float STATIC_GetChunkInstallProgressPerc(EAriseChunkNo iChunkNo);
	float STATIC_GetAllChunkInstallProgressPerc();
	void STATIC_DebugStartNextChunk();
};


// Class Arise.AriseCinematicAnimLocation
// 0x0008 (0x03B8 - 0x03B0)
class AAriseCinematicAnimLocation : public ASkeletalMeshActor
{
public:
	struct FName                                       LocationSocket;                                           // 0x03B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseCinematicAnimLocation");
		return ptr;
	}


	struct FTransform GetLocation();
};


// Class Arise.AriseClickableArea
// 0x0318 (0x0430 - 0x0118)
class UAriseClickableArea : public UContentWidget
{
public:
	struct FButtonStyle                                WidgetStyle;                                              // 0x0118(0x0278) (Edit, BlueprintVisible)
	struct FLinearColor                                ColorAndOpacity;                                          // 0x0390(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FLinearColor                                BackgroundColor;                                          // 0x03A0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	TEnumAsByte<EButtonClickMethod>                    ClickMethod;                                              // 0x03B0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EButtonTouchMethod>                    TouchMethod;                                              // 0x03B1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsFocusable;                                              // 0x03B2(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x03B3(0x0005) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnClicked;                                                // 0x03B8(0x0010) (ZeroConstructor, InstancedReference)
	struct FScriptMulticastDelegate                    OnPressed;                                                // 0x03C8(0x0010) (ZeroConstructor, InstancedReference)
	struct FScriptMulticastDelegate                    OnReleased;                                               // 0x03D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnMouseClicked;                                           // 0x03E8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnHovered;                                                // 0x03F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnUnhovered;                                              // 0x0408(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0x18];                                      // 0x0418(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseClickableArea");
		return ptr;
	}


	ESlateVisibility VisibilityOverwrite();
	void SetStyle(const struct FButtonStyle& InStyle);
	void STATIC_SetMouseEnabled(bool Enable);
	void SetMouseCursorHere();
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity);
	void SetBackgroundColor(const struct FLinearColor& InBackgroundColor);
	bool IsPressed();
	bool STATIC_IsAnyHovered();
	void Activate(bool IsEnabled);
};


// Class Arise.AriseCommerce
// 0x0010 (0x0038 - 0x0028)
class UAriseCommerce : public UObject
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseCommerce");
		return ptr;
	}


	bool SearchContentsAsync(const struct FAriseCommerceCategoryInfo& iCategoryInfo);
	bool SearchCategoriesAsync();
	bool ProductBrowseAsync(const struct FAriseCommerceContentInfo& iContentInfo);
	bool IsConnect();
	bool IsBusy();
	EAriseCommerceResult GetResult();
	void GetContentsInfo(TArray<struct FAriseCommerceContentInfo>* OutContentsInfo);
	void GetCategoriesInfo(TArray<struct FAriseCommerceCategoryInfo>* OutCategoriesInfo);
	bool DisconnectAsync();
	bool ConnectAsync();
	bool Cancel();
};


// Class Arise.AriseConfig
// 0x0058 (0x0080 - 0x0028)
class UAriseConfig : public UObject
{
public:
	struct FScriptMulticastDelegate                    ApplyGameDelegate;                                        // 0x0028(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    ApplyGraphicDelegate;                                     // 0x0038(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<unsigned char>                              AriseDlcBtlBgmID;                                         // 0x0048(0x0010) (BlueprintVisible, ZeroConstructor)
	class UAriseUserSettings*                          AriseUserSetting;                                         // 0x0058(0x0008) (ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 LightCurve;                                               // 0x0060(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FIntPoint                                   LastFullScreenResolution;                                 // 0x0068(0x0008) (IsPlainOldData)
	int                                                ResolutionTextNumberDisplayAspectRatioOnly;               // 0x0070(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ResolutionTextNumberAll;                                  // 0x0074(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               ChangedResolution;                                        // 0x0078(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0079(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseConfig");
		return ptr;
	}


	void STATIC_UpdateScreenMode(int ChoiceIndex);
	void STATIC_UpdateScreenBrightness(int ScreenValue);
	void STATIC_UpdatePFCameraYaw(int ChoiceIndex);
	void STATIC_UpdatePFCameraSpeed(int Param);
	void STATIC_UpdatePFCameraPitch(int ChoiceIndex);
	void STATIC_Tick(float iDeltaTime);
	void STATIC_Terminate();
	bool STATIC_SetConfigValue(EConfigKey Key, int Value, TMap<EConfigKey, int>* configValues);
	bool STATIC_SetAnalysisSave(bool IsAgree);
	void STATIC_SavePadKeyAssign(class AInputExtPlayerController* PlayerController, const struct FPadKeyAssign& Data);
	void STATIC_SaveMouseKeyAssign(class AInputExtPlayerController* PlayerController, const struct FMouseKeyAssign& Data);
	void STATIC_SaveKeyboardKeyAssign(class AInputExtPlayerController* PlayerController, const struct FKeyboardKeyAssign& Data);
	void STATIC_SaveGraphics(const struct FGraphicsConfigData& Data);
	void STATIC_SaveGame(const struct FGameConfigData& Data);
	struct FPadKeyAssign STATIC_ResetPadKeyAssign(class AInputExtPlayerController* PlayerController);
	struct FKeyboardKeyAssign STATIC_ResetKeyboardKeyAssign(class AInputExtPlayerController* PlayerController);
	void STATIC_ResetKeyboardAndMouseKeyAssign(class AInputExtPlayerController* PlayerController);
	void STATIC_ResetDLCBattleBgmIdList();
	struct FGraphicsConfigData STATIC_LoadDefaultGraphics();
	struct FGameConfigData STATIC_LoadDefaultGame();
	bool STATIC_IsExistCustomResolution(int choiceListNumber);
	bool STATIC_IsCustomResolutionIndex(int Index);
	bool STATIC_IsCustomResolution();
	bool STATIC_IsChangedResolution();
	void STATIC_InitializePadKeyAssign(class AInputExtPlayerController* PlayerController);
	void STATIC_InitializeMouseKeyAssign(class AInputExtPlayerController* PlayerController);
	void STATIC_InitializeKeyboardKeyAssign(class AInputExtPlayerController* iController);
	void STATIC_InitializeGraphics();
	void STATIC_InitializeGame();
	void STATIC_Initialize();
	int STATIC_GetScreenMode();
	EAriseSaveResult STATIC_GetSaveResult();
	int STATIC_GetResolutionTextNumber(bool DisplayAspectRatioOnly);
	TArray<struct FModifiedText> STATIC_GetResolutionTextList(bool DisplayAspectRatioOnly);
	struct FModifiedText STATIC_GetResolutionText();
	struct FIntPoint STATIC_GetResolutionNumber();
	int STATIC_GetResolutionIndex();
	struct FPadKeyAssign STATIC_GetPadKeyAssign(class AInputExtPlayerController* PlayerController);
	void STATIC_GetOptionListIndex(EConfigCategory Category, TArray<int>* outList);
	struct FName STATIC_GetNextBGMLabel();
	struct FMouseKeyAssign STATIC_GetMouseKeyAssign(class AInputExtPlayerController* PlayerController);
	class UCurveFloat* STATIC_GetLightCurveData();
	struct FKeyboardKeyAssign STATIC_GetKeyboardKeyAssign(class AInputExtPlayerController* PlayerController);
	struct FGraphicsConfigData STATIC_GetGraphics();
	void STATIC_GetGraphicOptionValue(TMap<EConfigKey, int>* configValues);
	void STATIC_GetGameOptionValue(TMap<EConfigKey, int>* configValues);
	struct FGameConfigData STATIC_GetGame();
	struct FName STATIC_GetDLCBattleBGMLabel();
	struct FMouseKeyAssign STATIC_GetDefaultMouseKeyAssign(class AInputExtPlayerController* PlayerController);
	EPadKeyId STATIC_GetDefaultKeyPadID(const struct FName& LavelName);
	struct FKeyboardKeyAssign STATIC_GetDefaultKeyboardKeyAssign(class AInputExtPlayerController* PlayerController);
	void STATIC_GetDefaultGraphicOptionValue(TMap<EConfigKey, int>* configValues);
	void STATIC_GetDefaultGameOptionValue(TMap<EConfigKey, int>* configValues);
	class UConfigDataClass* STATIC_GetDatabase();
	class UAriseConfig* STATIC_GetConfigInstance();
	TArray<struct FModifiedText> STATIC_GetChoiceTextList(EConfigKey Key);
	struct FModifiedText STATIC_GetChoiceText(EConfigKey Key, int Index);
	TArray<struct FString> STATIC_GetChoiceList(const struct FString& TitleLabel);
	float STATIC_GetBrightnessValue(int SavedValue);
	class UConfigBgmDataClass* STATIC_GetBgmDatabase();
	void STATIC_DifficultyLevelUnlockCheck();
	void STATIC_ApplyGraphicOptionValueCustomResolution(TMap<EConfigKey, int> configValues, const struct FIntPoint& CustomResolution, bool isSaveSettings);
	void STATIC_ApplyGraphicOptionValue(TMap<EConfigKey, int> configValues, bool isSaveSettings);
	void STATIC_ApplyGameOptionValue(TMap<EConfigKey, int> configValues);
};


// Class Arise.AriseConfigBgm
// 0x0000 (0x0208 - 0x0208)
class UAriseConfigBgm : public UUserWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseConfigBgm");
		return ptr;
	}


	void STATIC_SortGameTitle(TArray<struct FConfigBgmData>* BgmData);
};


// Class Arise.AriseGameConfigProfile
// 0x0000 (0x0028 - 0x0028)
class UAriseGameConfigProfile : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseGameConfigProfile");
		return ptr;
	}


	void STATIC_SetVolume_VOICE(int Value);
	void STATIC_SetVolume_SE(int Value);
	void STATIC_SetVolume_BGM(int Value);
	void STATIC_SetSubTitleVisible(bool bEnable);
	void STATIC_SetSubQuestMarkVisible(bool bEnable);
	void STATIC_SetSoundOutputType(EAriseSoundOutputType Type);
	void STATIC_SetScreenBrightness(int Value);
	void STATIC_SetPFCameraYawType(EAriseCameraControlType Type);
	void STATIC_SetPFCameraSpeed(int Value);
	void STATIC_SetPFCameraPitchType(EAriseCameraControlType Type);
	void STATIC_SetNavMapRotationFixed(bool bEnable);
	void STATIC_SetMainQuestMarkVisible(bool bEnable);
	void STATIC_SetDlcBtlBgmPlayMode(int Value);
	void STATIC_SetDlcBtlBgmPlayID(int Value);
	void STATIC_SetDlcBtlBgmPlayFlagVisible(int ID, bool bEnable);
	void STATIC_SetControllerVibration(bool bEnable);
	void STATIC_SetBtlBgmPlayType(int Value);
	void STATIC_SetBattleRank(EBtlRank Rank);
	void STATIC_SetBattleCameraYawType(EAriseCameraControlType Type);
	void STATIC_SetBattleCameraSpeed(int Value);
	void STATIC_SetBattleCameraPitchType(EAriseCameraControlType Type);
	void STATIC_SetBattleCameraCorrection_Move(int Value);
	void STATIC_SetBattleCameraCorrection_Attack(int Value);
	void STATIC_SetBattleCameraAutoUnlock(int Value);
	void STATIC_SetBattleAdvanceInputType(EAriseAdvanceInputType Type);
	void STATIC_ResetDlcBtlBgmPlayFlag();
	void STATIC_ResetConfig();
	bool STATIC_IsSubTitleVisible();
	bool STATIC_IsSubQuestMarkVisible();
	bool STATIC_IsNavMapRotationFixed();
	bool STATIC_IsMainQuestMarkVisible();
	bool STATIC_IsDlcBtlBgmPlayFlagVisible(int ID);
	bool STATIC_IsControllerVibration();
	int STATIC_GetVolume_VOICE();
	int STATIC_GetVolume_SE();
	int STATIC_GetVolume_BGM();
	EAriseSoundOutputType STATIC_GetSoundOutputType();
	int STATIC_GetScreenBrightness();
	EAriseCameraControlType STATIC_GetPFCameraYawType();
	int STATIC_GetPFCameraSpeed();
	EAriseCameraControlType STATIC_GetPFCameraPitchType();
	int STATIC_GetDlcBtlBgmPlayMode();
	int STATIC_GetDlcBtlBgmPlayID();
	int STATIC_GetBtlBgmPlayType();
	EBtlRank STATIC_GetBattleRank();
	EAriseCameraControlType STATIC_GetBattleCameraYawType();
	int STATIC_GetBattleCameraSpeed();
	EAriseCameraControlType STATIC_GetBattleCameraPitchType();
	int STATIC_GetBattleCameraCorrection_Move();
	int STATIC_GetBattleCameraCorrection_Attack();
	int STATIC_GetBattleCameraAutoUnlock();
	EAriseAdvanceInputType STATIC_GetBattleAdvanceInputType();
};


// Class Arise.AriseCustomDPIRule
// 0x0000 (0x0028 - 0x0028)
class UAriseCustomDPIRule : public UDPICustomScalingRule
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseCustomDPIRule");
		return ptr;
	}

};


// Class Arise.AriseDebugCameraController
// 0x0000 (0x06C0 - 0x06C0)
class AAriseDebugCameraController : public ADebugCameraController
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseDebugCameraController");
		return ptr;
	}

};


// Class Arise.AriseEntitlementManager
// 0x0010 (0x0038 - 0x0028)
class UAriseEntitlementManager : public UObject
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseEntitlementManager");
		return ptr;
	}


	void RequestActivateEntitlement();
	bool OpenPresent(const struct FString& PresentLabel);
	bool OpenItem(const struct FString& ItemLabel);
	bool IsOpenedPresent(const struct FString& PresentLabel);
	bool IsOpenedItem(const struct FString& ItemLabel);
	bool IsActivatedPresent(const struct FString& PresentLabel);
	bool IsActivatedPackage(const struct FString& PackageLabel);
	bool IsActivatedItem(const struct FString& ItemLabel);
	bool HasOpenedAppendMusic();
	TArray<struct FString> GetPresentsInPackage(const struct FString& PresentLabel);
	TArray<struct FString> GetPresents();
	bool GetPresentData(const struct FString& PresentLabel, struct FDLCPresentData* Data);
	TArray<struct FString> GetPackagesFromItem(const struct FString& ItemLabel);
	TArray<struct FString> GetPackages();
	bool GetPackageLabelByItemLabel(const struct FString& ItemLabel, TArray<struct FString>* PackageLabels);
	bool GetPackageLabelByItemId(int ItemID, TArray<struct FString>* PackageLabels);
	struct FString GetPackageId(const struct FString& PackageLabel);
	bool GetPackageData(const struct FString& PackageLabel, struct FDLCPackageData* Data);
	TArray<struct FString> GetItemsInPresent(const struct FString& ItemLabel);
	TArray<struct FString> GetItems();
	bool GetItemData(const struct FString& ItemLabel, struct FDLCItemData* Data, TArray<struct FDLCAcquireItemData>* AcquireData);
	TArray<struct FString> GetActivatedPresents();
	TArray<struct FString> GetActivatedPackages();
	TArray<struct FString> GetActivatedItems();
	TArray<struct FString> GetActivatedEntitlements();
	void ForceActivePresent(const struct FString& PresentLabel);
	void ForceActivePackage(const struct FString& PackageLabel);
	void ForceActiveItem(const struct FString& ItemLabel);
	bool CheckActivateEntitlement();
	void Activate();
};


// Class Arise.AriseGameDataLibrary
// 0x0000 (0x0028 - 0x0028)
class UAriseGameDataLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Arise.AriseGameDataLibrary");
		return ptr;
	}


	void STATIC_UseCook2(const struct FString& SkillLabel, float EffectTime, float FavoriteValue, EArisePartyID Favorite);
	void STATIC_UseCook(const struct FString& SkillLabel_2, const struct FString& SkillLabel_3, float Time);
	void STATIC_UpdateMaxTP();
	EArisePartyID STATIC_SwitchPartyTop(bool bCW);
	void STATIC_SubCurrentTP(int Value);
	void STATIC_SetSpecialCount_SIO(int Value);
	void STATIC_SetShopLevel(int Level);
	void STATIC_SetRisePoint(int RP, EArisePartyID PartyId);
	void STATIC_SetPlayRecordIfUpdate(EPlayRecordList ID, int Value);
	void STATIC_SetPlayRecord(EPlayRecordList ID, int Value);
	void STATIC_SetPFCameraIndex(int Index);
	void STATIC_SetPFActionCount_SIO(int Value);
	void STATIC_SetLockDecBattleBonus(bool bEnable);
	void STATIC_SetGald(int Gald);
	void STATIC_SetFavorability(EArisePartyID PartyId, int NewValue);
	void STATIC_SetEventEncountDefeat(const struct FString& EncountGroupLabel, bool Flag);
	void STATIC_SetDefeatCount(int UnitID, int Count);
	void STATIC_SetBattleStartControllID(EArisePartyID PartyId);
	void STATIC_SetBattleRank(EBtlRank Rank);
	void STATIC_SetBattleBonus(float Num);
	void STATIC_SetAliasCounter(EArisePartyID PartyId, EBtlAliasCountDefine Alias, int Value);
	void STATIC_LockPartyTop(bool bLock);
	bool STATIC_K2_IsCookSkill(const struct FString& SkillLabel, float* Value);
	void STATIC_K2_GetShopLevel(int* Level);
	bool STATIC_IsLockPartyTop();
	bool STATIC_IsLockDecBattleBonus();
	bool STATIC_IsBattleFever();
	bool STATIC_HasCookSkill();
	int STATIC_GetTrophyMonsterCompleteCount();
	int STATIC_GetSpecialCount_SIO();
	int STATIC_GetRisePoint(EArisePartyID PartyId);
	int STATIC_GetReadLongChatNum();
	int STATIC_GetPlayRecordMax(EPlayRecordList ID);
	int STATIC_GetPlayRecord(EPlayRecordList ID);
	int STATIC_GetPFCameraIndex();
	int STATIC_GetPFActionCount_SIO();
	EArisePartyID STATIC_GetPartyTop();
	int STATIC_GetMaxTP_DLC();
	int STATIC_GetMaxTP_Base();
	int STATIC_GetMaxTp();
	int STATIC_GetMaxGald();
	int STATIC_GetGameLapsCount();
	int STATIC_GetGald();
	int STATIC_GetFavorability(EArisePartyID PartyId);
	int STATIC_GetExDungeonClear();
	bool STATIC_GetEventEncountDefeat(const struct FString& EncountGroupLabel);
	int STATIC_GetDefeatCount(int UnitID);
	int STATIC_GetCurrentTP();
	float STATIC_GetCookTotalTime();
	float STATIC_GetCookTime();
	int STATIC_GetCookSkill2(float* Value);
	void STATIC_GetCookSkill(int* SkillID_2, int* SkillID_3);
	EArisePartyID STATIC_GetCookFavorite();
	EArisePartyID STATIC_GetBattleStartControllID();
	EBtlRank STATIC_GetBattleRank();
	float STATIC_GetBattleBonus();
	int STATIC_GetArtifactGetCount();
	int STATIC_GetAliasCounter(EArisePartyID PartyId, EBtlAliasCountDefine Alias);
	bool STATIC_GetActiveCookSkill(bool bUnitConversion, int* SkillID, float* SkillValue);
	void STATIC_CheckUnlockTrophy(const struct FString& TrophyName, int Value);
	void STATIC_CheckPlayRecordTrophy(EPlayRecordList ID, int Value);
	void STATIC_AddTPMax_DLC(int Value);
	void STATIC_AddTPMax(int Value);
	void STATIC_AddSpecialCount_SIO(int Value);
	void STATIC_AddRisePoint(int RP, EArisePartyID PartyId);
	void STATIC_AddReadLongChatNum(int Value);
	void STATIC_AddPlayRecord(EPlayRecordList ID, int Add);
	void STATIC_AddPFActionCount_SIO(int Value);
	void STATIC_AddGameLapsCount(int Value);
	void STATIC_AddGald(int Gald);
	void STATIC_AddFavorability(EArisePartyID PartyId, int AddValue);
	void STATIC_AddExDungeonClear(int Value);
	void STATIC_AddDefeatCount(int UnitID, int Count);
	void STATIC_AddCurrentTP(int Value);
	void STATIC_AddBattleBonus(float Add);
	void STATIC_AddAliasCounter(EArisePartyID PartyId, EBtlAliasCountDefine Alias, int Value);
};


// Class Arise.AriseGameInstance
// 0x0220 (0x02C0 - 0x00A0)
class UAriseGameInstance : public UGameInstance
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x00A0(0x0008) MISSED OFFSET
	class UBuildInfo*                                  BuildInfo;                                                // 0x00A8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UAriseSave*                                  AriseSave;                                                // 0x00B0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UAriseAutoSave*                              AriseAutoSave;                                            // 0x00B8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UArisePartyOrder*                            PartyOrder;                                               // 0x00C0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UArisePartyProfile*                          PartyProfile;                                             // 0x00C8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class AShortChatManager*                           ShortChat;                                                // 0x00D0(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	class AAriseSoundSystem*                           SoundSystem;                                              // 0x00D8(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	class ALongChatManager*                            LongChat;                                                 // 0x00E0(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	class UAriseConfig*                                AriseConfig;                                              // 0x00E8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	TMap<struct FString, class UObject*>               ResidentDatabaseList;                                     // 0x00F0(0x0050) (ZeroConstructor, Transient)
	TMap<struct FString, class UObject*>               ResidentStringDatabaseList;                               // 0x0140(0x0050) (ZeroConstructor, Transient)
	TMap<struct FString, class UClass*>                ResidentClassList;                                        // 0x0190(0x0050) (ZeroConstructor, Transient)
	TMap<struct FString, struct FSoftObjectPath>       AsyncLoadAssetList;                                       // 0x01E0(0x0050) (ZeroConstructor, Transient)
	class UClass*                                      QuestSaveDataClass;                                       // 0x0230(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	class UAriseScenarioVariable*                      QuestSaveData;                                            // 0x0238(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	class UAriseShareControlManager*                   ShareControlManager;                                      // 0x0240(0x0008) (ZeroConstructor, IsPlainOldData)
	class UAriseEntitlementManager*                    EntitlementManager;                                       // 0x0248(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UAriseAccountManager*                        AccountManager;                                           // 0x0250(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0258(0x0010) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnViewportResizedEvent;                                   // 0x0268(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnDisplayMetricsChangedEvent;                             // 0x0278(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnStartGameSection;                                       // 0x0288(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               bBootDiplaySkip;                                          // 0x0298(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0299(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnChangeDebugMode;                                        // 0x02A0(0x0010) (ZeroConstructor, Transient, InstancedReference, BlueprintAssignable)
