#pragma once

// Name: Arise, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct DebugText_STR.DebugText_STR
// 0x0029
struct FDebugText_STR
{
	float                                              x_2_A2840ACC47BEF04154CD7BB7F5CFAE0E;                     // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              y_7_074DFD96439378F65C26828F5A94643E;                     // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     String_10_9E75EE5C4475775357050491DA6907B1;               // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FLinearColor                                Color_12_6D40551D418E0366543A99B6D66605EC;                // 0x0018(0x0010) (Edit, BlueprintVisible, IsPlainOldData)
	bool                                               bCenter_14_7A5331004BE53CB728AE46BF9E07EF1A;              // 0x0028(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
