#pragma once

// Name: Arise, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct ST_TIT2_SKL_ICON_DATA.ST_TIT2_SKL_ICON_DATA
// 0x0028
struct FST_TIT2_SKL_ICON_DATA
{
	class UMaterialInstance*                           BaseMaterial_15_A6413A8A44A92AFA7B03B4A0AEC80AA2;         // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           WindowMaterial_12_C83C457247E717ED900E6C8578D151F7;       // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           GlowMaterial_6_69FC3B86488AAF86757E329C7C277CCF;          // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           StateMaterial_13_6320A2674C1BE399D15FC78483C689FA;        // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           ChooseMaterial_7_07EA2D854FE3AC888CB62AB488ABC636;        // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
