#pragma once

// Name: Arise, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct STR_FishingSettings.STR_FishingSettings
// 0x0064
struct FSTR_FishingSettings
{
	float                                              Qte_HookingInputTime_6_5AC1239A46DBEF704D89D783FA4D62C1;  // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Qte_FishDushInputTime_2_983AE8E344C7C5F52EB8188EA5E92364; // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Qte_FishJumpInputTime_4_98B7F2DA4E2E7E9EDA11E7AF1E963619; // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Qte_DushSucDamage_12_233A50C3449ED3417D180C8B15544FDE;    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Qte_JumpSucDamage_14_292A9192432E0BD36BE113B7B288C250;    // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Qte_RunawayDragDamage_50_F772D60841DDE6D8908DCA960EE81721;// 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AddActionPointRate_17_C254F4CB42C0A2833FFE17B9AD81298C;   // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FishDamageRateAtReel_47_A33A80974435D6FF4F31078B6E5653E7; // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AddTensionRateAtRodWork_28_1D0202884B047A2500CA58B8E0863E82;// 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AddTensionAtReelAction_27_6E716C3E40C4478ADC22EF87C27C075E;// 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AddTensionAtQteSuccess_31_8F9068DD4D7D8DC9AAE1E28FFEDA0092;// 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AddTensionAtQteFaild_33_B37CBD6D4D97D8B023AB10B41A7D0312; // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FishPowerUpRate_36_556F41E540D17476D9DE5D81D78AB857;      // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              CastableAngleDeg_40_CD42187F49100C8A32E9C1807DAC2EEF;     // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TensionIdleCooldown_42_91DF9A1946977D4888D3F1B207F61840;  // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LureActionBasePoint_46_8D7A6CC84E60AC525929FA87DF9C1501;  // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LureMatchBounus_53_265A3A434773A350CC3D0EA090768C96;      // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              IdleAddTensionR1_68_3B4DD4484F1EF22A4EE4FCAA40724381;     // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              IdleAddTensionR2_70_636AB388496DF1FBDD13BDA12184F17C;     // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              IdleAddTensionR3_71_602495F747E6CE9B3D19FDA11B0A07C4;     // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              IdleAddDamageR1_69_AD2AE31040B7E27AA5E7EA966301F266;      // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              IdleAddDamageR2_72_A1B5585F47401134F9FDEE90948DD4D0;      // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              IdleAddDamageR3_73_2159620C41DA559E7D7002A9DF2842C6;      // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AddTensionRateOnQteMiss_76_FDE75362466235CD153D78BD9AD197D7;// 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DownTensionRateOnFishRunaway_79_7A751085401BD927A3D7CCB6ACF65D96;// 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
