#pragma once

// Name: Arise, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Enums
//---------------------------------------------------------------------------

// Enum Arise.EBtlAnimationBlendType
enum class EBtlAnimationBlendType : uint8_t
{
	EBtlAnimationBlendType__BLEND_NORMAL = 0,
	EBtlAnimationBlendType__BLEND_NONE = 1,
	EBtlAnimationBlendType__BLEND_LONG = 2,
	EBtlAnimationBlendType__BLEND_INVALID = 3,
	EBtlAnimationBlendType__BLEND_MAX = 4
};


// Enum Arise.EBtlVoiceHandleState
enum class EBtlVoiceHandleState : uint8_t
{
	EBtlVoiceHandleState__Waiting  = 0,
	EBtlVoiceHandleState__Reserving = 1,
	EBtlVoiceHandleState__Playing  = 2,
	EBtlVoiceHandleState__EBtlVoiceHandleState_MAX = 3
};


// Enum Arise.EBtlVoiceState
enum class EBtlVoiceState : uint8_t
{
	EBtlVoiceState__NON            = 0,
	EBtlVoiceState__BAD            = 1,
	EBtlVoiceState__SPE            = 2,
	EBtlVoiceState__REC            = 3,
	EBtlVoiceState__GOD            = 4,
	EBtlVoiceState__DAM            = 5,
	EBtlVoiceState__ATK            = 6,
	EBtlVoiceState__ETC            = 7,
	EBtlVoiceState__RES            = 8,
	EBtlVoiceState__EBtlVoiceState_MAX = 9
};


// Enum Arise.EAriseRelationship
enum class EAriseRelationship : uint8_t
{
	EAriseRelationship__NON        = 0,
	EAriseRelationship__SYS        = 1,
	EAriseRelationship__SB1        = 2,
	EAriseRelationship__SB2        = 3,
	EAriseRelationship__UQ1        = 4,
	EAriseRelationship__UQ2        = 5,
	EAriseRelationship__SPC        = 6,
	EAriseRelationship__SB3        = 7,
	EAriseRelationship__EAriseRelationship_MAX = 8
};


// Enum Arise.EBtlVoiceType
enum class EBtlVoiceType : uint8_t
{
	EBtlVoiceType__VBS             = 0,
	EBtlVoiceType__VBM             = 1,
	EBtlVoiceType__EBtlVoiceType_MAX = 2
};


// Enum Arise.EBtlVoiceCharaID
enum class EBtlVoiceCharaID : uint8_t
{
	EBtlVoiceCharaID__INVALID      = 0,
	EBtlVoiceCharaID__ARI          = 1,
	EBtlVoiceCharaID__SIO          = 2,
	EBtlVoiceCharaID__NNA          = 3,
	EBtlVoiceCharaID__ZGU          = 4,
	EBtlVoiceCharaID__MNK          = 5,
	EBtlVoiceCharaID__YRA          = 6,
	EBtlVoiceCharaID__ZFA          = 7,
	EBtlVoiceCharaID__BEZ          = 8,
	EBtlVoiceCharaID__KIL          = 9,
	EBtlVoiceCharaID__YRB          = 10,
	EBtlVoiceCharaID__AGM          = 11,
	EBtlVoiceCharaID__DFN          = 12,
	EBtlVoiceCharaID__DFO          = 13,
	EBtlVoiceCharaID__LSW          = 14,
	EBtlVoiceCharaID__LHI          = 15,
	EBtlVoiceCharaID__LGU          = 16,
	EBtlVoiceCharaID__LLA          = 17,
	EBtlVoiceCharaID__ELS          = 18,
	EBtlVoiceCharaID__KRO          = 19,
	EBtlVoiceCharaID__EDN          = 20,
	EBtlVoiceCharaID__EIZ          = 21,
	EBtlVoiceCharaID__KLZ          = 22,
	EBtlVoiceCharaID__DAR          = 23,
	EBtlVoiceCharaID__FRU          = 24,
	EBtlVoiceCharaID__GRA          = 25,
	EBtlVoiceCharaID__ELM          = 26,
	EBtlVoiceCharaID__CBK          = 27,
	EBtlVoiceCharaID__CBA          = 28,
	EBtlVoiceCharaID__SGU          = 29,
	EBtlVoiceCharaID__EMOTION      = 30,
	EBtlVoiceCharaID__SELF         = 31,
	EBtlVoiceCharaID__ALLPEOPLE    = 32,
	EBtlVoiceCharaID__PARTY        = 33,
	EBtlVoiceCharaID__ALLY         = 34,
	EBtlVoiceCharaID__ENEMY        = 35,
	EBtlVoiceCharaID__PUBLIC       = 36,
	EBtlVoiceCharaID__OBJECT       = 37,
	EBtlVoiceCharaID__EBtlVoiceCharaID_MAX = 38
};


// Enum Arise.EBtlVoiceUsage
enum class EBtlVoiceUsage : uint8_t
{
	EBtlVoiceUsage__NONE           = 0,
	EBtlVoiceUsage__ONLY_ONCE_IN_BATTLE = 1,
	EBtlVoiceUsage__ONLY_ONCE_IN_LEVEL = 2,
	EBtlVoiceUsage__ONLY_ONCE_IN_PLAY = 3,
	EBtlVoiceUsage__ONLY_ONCE      = 4,
	EBtlVoiceUsage__INTERVAL_SLOT00 = 5,
	EBtlVoiceUsage__INTERVAL_SLOT01 = 6,
	EBtlVoiceUsage__INTERVAL_SLOT02 = 7,
	EBtlVoiceUsage__INTERVAL_SLOT03 = 8,
	EBtlVoiceUsage__INTERVAL_SLOT04 = 9,
	EBtlVoiceUsage__INTERVAL_SLOT05 = 10,
	EBtlVoiceUsage__INTERVAL_SLOT06 = 11,
	EBtlVoiceUsage__INTERVAL_SLOT07 = 12,
	EBtlVoiceUsage__EBtlVoiceUsage_MAX = 13
};


// Enum Arise.EBtlVoiceCondition
enum class EBtlVoiceCondition : uint8_t
{
	EBtlVoiceCondition__NON        = 0,
	EBtlVoiceCondition__NORMAL     = 1,
	EBtlVoiceCondition__FIRE       = 2,
	EBtlVoiceCondition__WATER      = 3,
	EBtlVoiceCondition__WIND       = 4,
	EBtlVoiceCondition__EARTH      = 5,
	EBtlVoiceCondition__LIGHT      = 6,
	EBtlVoiceCondition__DARK       = 7,
	EBtlVoiceCondition__DAMAGE_PERCENT = 8,
	EBtlVoiceCondition__DEAD       = 9,
	EBtlVoiceCondition__ABNORMAL   = 10,
	EBtlVoiceCondition__TARGET     = 11,
	EBtlVoiceCondition__SPELL_DAMAGE = 12,
	EBtlVoiceCondition__OVERLIMIT  = 13,
	EBtlVoiceCondition__STRIKEABLE = 14,
	EBtlVoiceCondition__USE_ITEM   = 15,
	EBtlVoiceCondition__COMBO_COUNT = 16,
	EBtlVoiceCondition__ESCAPE     = 17,
	EBtlVoiceCondition__SUPPORT_RECOVERY = 18,
	EBtlVoiceCondition__RECOVERY   = 19,
	EBtlVoiceCondition__DAMAGE     = 20,
	EBtlVoiceCondition__ENCOUNT    = 21,
	EBtlVoiceCondition__GUARDBREAK = 22,
	EBtlVoiceCondition__GUARDBREAK_DOWN = 23,
	EBtlVoiceCondition__FLASHRAID  = 24,
	EBtlVoiceCondition__SPECIAL_DOWN = 25,
	EBtlVoiceCondition__BLOW       = 26,
	EBtlVoiceCondition__TEAM_MANY  = 27,
	EBtlVoiceCondition__VOICE_END  = 28,
	EBtlVoiceCondition__TP_PERCENT = 29,
	EBtlVoiceCondition__CORE_BREAK = 30,
	EBtlVoiceCondition__CORE_BREAK_OR_DOWN = 31,
	EBtlVoiceCondition__UNIQUE_DAMAGE = 32,
	EBtlVoiceCondition__JUST_AVOIDANCE = 33,
	EBtlVoiceCondition__SINGLE_ENCOUNT_PLAYED = 34,
	EBtlVoiceCondition__UNIT_COUNT_BELOW = 35,
	EBtlVoiceCondition__PLAY_SEQUENTIAL = 36,
	EBtlVoiceCondition__UNIT_INCREASE = 37,
	EBtlVoiceCondition__ATTACK_RECEIVE = 38,
	EBtlVoiceCondition__PHASE_CHANGED = 39,
	EBtlVoiceCondition__STRIKE_SMASH_POSSIBLE = 40,
	EBtlVoiceCondition__STRIKE_SMASH_PLAYED = 41,
	EBtlVoiceCondition__STRIKE_SMASH_KILL = 42,
	EBtlVoiceCondition__ARTS_INSPIRATION = 43,
	EBtlVoiceCondition__STRATEGY_CHANGED = 44,
	EBtlVoiceCondition__REVIVAL    = 45,
	EBtlVoiceCondition__CORE_BREAKE_GUIDANCE = 46,
	EBtlVoiceCondition__CONDITION_VOICE_END = 47,
	EBtlVoiceCondition__AVOIDANCE_RETURN = 48,
	EBtlVoiceCondition__UNIQUE_SKILL = 49,
	EBtlVoiceCondition__OVERLIMITE_REACTION = 50,
	EBtlVoiceCondition__WIN        = 51,
	EBtlVoiceCondition__LEVEL_UP   = 52,
	EBtlVoiceCondition__ITEM_DROP  = 53,
	EBtlVoiceCondition__WEAPON_GUIDE = 54,
	EBtlVoiceCondition__BATTLE_BONUS_MAX = 55,
	EBtlVoiceCondition__BOOST_ATTACK_GUIDE_SIO = 56,
	EBtlVoiceCondition__BOOST_ATTACK_GUIDE_NNA = 57,
	EBtlVoiceCondition__BOOST_ATTACK_GUIDE_ZGU = 58,
	EBtlVoiceCondition__BOOST_ATTACK_GUIDE_MNK = 59,
	EBtlVoiceCondition__BOOST_ATTACK_GUIDE_YRA = 60,
	EBtlVoiceCondition__EBtlVoiceCondition_MAX = 61
};


// Enum Arise.EBtlVoiceTarget
enum class EBtlVoiceTarget : uint8_t
{
	EBtlVoiceTarget__NON           = 0,
	EBtlVoiceTarget__FRONT_ALL     = 1,
	EBtlVoiceTarget__PARTY_ANY     = 2,
	EBtlVoiceTarget__FRONT_ANY     = 3,
	EBtlVoiceTarget__BACK_CHARA    = 4,
	EBtlVoiceTarget__ANY_NOT_PLAYER = 5,
	EBtlVoiceTarget__FRONT_NOT_PLAYER = 6,
	EBtlVoiceTarget__BACK_NOT_PLAYER = 7,
	EBtlVoiceTarget__ANY_NOT_SELF  = 8,
	EBtlVoiceTarget__FRONT_NOT_SELF = 9,
	EBtlVoiceTarget__BACK_NOT_SELF = 10,
	EBtlVoiceTarget__PLAYER        = 11,
	EBtlVoiceTarget__THIS_CHARA    = 12,
	EBtlVoiceTarget__MAGIC_CHARA   = 13,
	EBtlVoiceTarget__ENEMY         = 14,
	EBtlVoiceTarget__ZAKO_ENEMY    = 15,
	EBtlVoiceTarget__POWER_ENEMY   = 16,
	EBtlVoiceTarget__ARI           = 17,
	EBtlVoiceTarget__SIO           = 18,
	EBtlVoiceTarget__NNA           = 19,
	EBtlVoiceTarget__ZGU           = 20,
	EBtlVoiceTarget__MNK           = 21,
	EBtlVoiceTarget__YRA           = 22,
	EBtlVoiceTarget__OTHER         = 23,
	EBtlVoiceTarget__EBtlVoiceTarget_MAX = 24
};


// Enum Arise.EBtlVoiceEnableFalgBit
enum class EBtlVoiceEnableFalgBit : uint8_t
{
	EBtlVoiceEnableFalgBit__ScenarioVoice = 0,
	EBtlVoiceEnableFalgBit__CutScene = 1,
	EBtlVoiceEnableFalgBit__TalkVoice = 2,
	EBtlVoiceEnableFalgBit__Script = 3,
	EBtlVoiceEnableFalgBit__DebugEnable = 4,
	EBtlVoiceEnableFalgBit__EBtlVoiceEnableFalgBit_MAX = 5
};


// Enum Arise.EBtlArtsFinishedPosition
enum class EBtlArtsFinishedPosition : uint8_t
{
	EBtlArtsFinishedPosition__GROUND = 0,
	EBtlArtsFinishedPosition__AIR  = 1,
	EBtlArtsFinishedPosition__EBtlArtsFinishedPosition_MAX = 2
};


// Enum Arise.EBtlMagicRank
enum class EBtlMagicRank : uint8_t
{
	EBtlMagicRank__NONE            = 0,
	EBtlMagicRank__LOW             = 1,
	EBtlMagicRank__MIDDLE          = 2,
	EBtlMagicRank__HIGH            = 3,
	EBtlMagicRank__EBtlMagicRank_MAX = 4
};


// Enum Arise.EBtlArtsUniqueParam
enum class EBtlArtsUniqueParam : uint8_t
{
	EBtlArtsUniqueParam__NONE      = 0,
	EBtlArtsUniqueParam__POISON    = 1,
	EBtlArtsUniqueParam__FROZEN    = 2,
	EBtlArtsUniqueParam__PARALYSIS = 3,
	EBtlArtsUniqueParam__CURSE     = 4,
	EBtlArtsUniqueParam__BUFF_TIME = 5,
	EBtlArtsUniqueParam__ATK       = 6,
	EBtlArtsUniqueParam__EATK      = 7,
	EBtlArtsUniqueParam__DEF       = 8,
	EBtlArtsUniqueParam__EDEF      = 9,
	EBtlArtsUniqueParam__PENETRATE = 10,
	EBtlArtsUniqueParam__ENDURANCE = 11,
	EBtlArtsUniqueParam__AG_RECOVERY_SPEED = 12,
	EBtlArtsUniqueParam__EBtlArtsUniqueParam_MAX = 13
};


// Enum Arise.EBtlElementType
enum class EBtlElementType : uint8_t
{
	EBtlElementType__NORMAL        = 0,
	EBtlElementType__FIRE          = 1,
	EBtlElementType__WATER         = 2,
	EBtlElementType__WIND          = 3,
	EBtlElementType__EARTH         = 4,
	EBtlElementType__LIGHT         = 5,
	EBtlElementType__DARK          = 6,
	EBtlElementType__ELEMENT_MAX   = 7,
	EBtlElementType__EBtlElementType_MAX = 8
};


// Enum Arise.EBtlArtsAction
enum class EBtlArtsAction : uint8_t
{
	EBtlArtsAction__ATTACK         = 0,
	EBtlArtsAction__HEAL           = 1,
	EBtlArtsAction__CURE           = 2,
	EBtlArtsAction__REBIRTH        = 3,
	EBtlArtsAction__BUFF           = 4,
	EBtlArtsAction__OTHER          = 5,
	EBtlArtsAction__HEAL_CP        = 6,
	EBtlArtsAction__EBtlArtsAction_MAX = 7
};


// Enum Arise.EBtlArtsType
enum class EBtlArtsType : uint8_t
{
	EBtlArtsType__ATK0             = 0,
	EBtlArtsType__ATK1             = 1,
	EBtlArtsType__ATK2             = 2,
	EBtlArtsType__ATK3             = 3,
	EBtlArtsType__ATK4             = 4,
	EBtlArtsType__ATK_AIR0         = 5,
	EBtlArtsType__ATK_AIR1         = 6,
	EBtlArtsType__ATK_AIR2         = 7,
	EBtlArtsType__ATK_AIR3         = 8,
	EBtlArtsType__ATK_AIR4         = 9,
	EBtlArtsType__ARTS             = 10,
	EBtlArtsType__ARTS_AIR         = 11,
	EBtlArtsType__MAGIC            = 12,
	EBtlArtsType__STR_ATK          = 13,
	EBtlArtsType__STR_ATK_AIR      = 14,
	EBtlArtsType__STR_ATK_SUB      = 15,
	EBtlArtsType__STR_SMASH        = 16,
	EBtlArtsType__MYSTIC           = 17,
	EBtlArtsType__FLASH_RAID       = 18,
	EBtlArtsType__FLASH_RAID_AIR   = 19,
	EBtlArtsType__OVER_LIMIT       = 20,
	EBtlArtsType__STR_ATK_AIR_SUB  = 21,
	EBtlArtsType__BRAKE            = 22,
	EBtlArtsType__RETURN           = 23,
	EBtlArtsType__SUPER_AVOID      = 24,
	EBtlArtsType__DOWN             = 25,
	EBtlArtsType__PRE_SMASH        = 26,
	EBtlArtsType__PRE_SMASH_AIR    = 27,
	EBtlArtsType__MYSTIC_SECOND    = 28,
	EBtlArtsType__MYSTIC_THIRD     = 29,
	EBtlArtsType__MYSTIC_FOURTH    = 30,
	EBtlArtsType__MYSTIC_SPECIAL   = 31,
	EBtlArtsType__EBtlArtsType_MAX = 32
};


// Enum Arise.EBtlBaseRefType
enum class EBtlBaseRefType : uint8_t
{
	EBtlBaseRefType__FriendUnit    = 0,
	EBtlBaseRefType__RivalUnit     = 1,
	EBtlBaseRefType__WorldOrigin   = 2,
	EBtlBaseRefType__EBtlBaseRefType_MAX = 3
};


// Enum Arise.EBtlRank
enum class EBtlRank : uint8_t
{
	EBtlRank__BTL_RANK_STORY       = 0,
	EBtlRank__BTL_RANK_NORMAL      = 1,
	EBtlRank__BTL_RANK_SECOND      = 2,
	EBtlRank__BTL_RANK_HARD        = 3,
	EBtlRank__BTL_RANK_CHAOS       = 4,
	EBtlRank__BTL_RANK_EASIEST     = 5,
	EBtlRank__BTL_RANK_UNKNOWN     = 6,
	EBtlRank__BTL_RANK_MAX         = 7
};


// Enum Arise.EBtlTacticsHow
enum class EBtlTacticsHow : uint8_t
{
	EBtlTacticsHow__None           = 0,
	EBtlTacticsHow__TpUpperPercent = 1,
	EBtlTacticsHow__TpLowerPercent = 2,
	EBtlTacticsHow__Always         = 3,
	EBtlTacticsHow__ItemUpper      = 4,
	EBtlTacticsHow__ItemLower      = 5,
	EBtlTacticsHow__PeopleUpper    = 6,
	EBtlTacticsHow__PeopleLower    = 7,
	EBtlTacticsHow__Once           = 8,
	EBtlTacticsHow__OnceParty      = 9,
	EBtlTacticsHow__EnemyUpper     = 10,
	EBtlTacticsHow__TYPE_MAX       = 11,
	EBtlTacticsHow__EBtlTacticsHow_MAX = 12
};


// Enum Arise.EBtlTacticsAction
enum class EBtlTacticsAction : uint8_t
{
	EBtlTacticsAction__None        = 0,
	EBtlTacticsAction__Attack      = 1,
	EBtlTacticsAction__Idle        = 2,
	EBtlTacticsAction__Heal        = 3,
	EBtlTacticsAction__UseItem     = 4,
	EBtlTacticsAction__Rebirth     = 5,
	EBtlTacticsAction__HealBadStatus = 6,
	EBtlTacticsAction__Buff        = 7,
	EBtlTacticsAction__TYPE_MAX    = 8,
	EBtlTacticsAction__EBtlTacticsAction_MAX = 9
};


// Enum Arise.EBtlTacticsCondition
enum class EBtlTacticsCondition : uint8_t
{
	EBtlTacticsCondition__None     = 0,
	EBtlTacticsCondition__PartyHpLowerEqual = 1,
	EBtlTacticsCondition__PartyHpLowerEqualPercent = 2,
	EBtlTacticsCondition__PartyHpUpperEqual = 3,
	EBtlTacticsCondition__PartyHpUpperEqualPercent = 4,
	EBtlTacticsCondition__TpLowerEqualPercent = 5,
	EBtlTacticsCondition__TpUpperEqualPercent = 6,
	EBtlTacticsCondition__Always   = 7,
	EBtlTacticsCondition__OwnerHpLowerEqual = 8,
	EBtlTacticsCondition__OwnerHpLowerEqualPercent = 9,
	EBtlTacticsCondition__OwnerHpUpperEqual = 10,
	EBtlTacticsCondition__OwnerHpUpperEqualPercent = 11,
	EBtlTacticsCondition__EnemyNumUpperEqual = 12,
	EBtlTacticsCondition__EnemyNumLowerEqual = 13,
	EBtlTacticsCondition__PartyDead = 14,
	EBtlTacticsCondition__PartyCondition = 15,
	EBtlTacticsCondition__EnemyLevel = 16,
	EBtlTacticsCondition__TYPE_MAX = 17,
	EBtlTacticsCondition__EBtlTacticsCondition_MAX = 18
};


// Enum Arise.EBtlTacticsCategory
enum class EBtlTacticsCategory : uint8_t
{
	EBtlTacticsCategory__NONE      = 0,
	EBtlTacticsCategory__CONDITION = 1,
	EBtlTacticsCategory__ACTION    = 2,
	EBtlTacticsCategory__HOW       = 3,
	EBtlTacticsCategory__TYPE_MAX  = 4,
	EBtlTacticsCategory__EBtlTacticsCategory_MAX = 5
};


// Enum Arise.EBtlStrikeType
enum class EBtlStrikeType : uint8_t
{
	EBtlStrikeType__FIRE_SWORD     = 0,
	EBtlStrikeType__FLY_BREAK      = 1,
	EBtlStrikeType__CHANT_BREAK    = 2,
	EBtlStrikeType__ARMOR_BREAK    = 3,
	EBtlStrikeType__RUSH_BREAK     = 4,
	EBtlStrikeType__AVOID_BREAK    = 5,
	EBtlStrikeType__EBtlStrikeType_MAX = 6
};


// Enum Arise.EBtlEffectSizeType
enum class EBtlEffectSizeType : uint8_t
{
	EBtlEffectSizeType__PC         = 0,
	EBtlEffectSizeType__SS         = 1,
	EBtlEffectSizeType__S          = 2,
	EBtlEffectSizeType__M          = 3,
	EBtlEffectSizeType__L          = 4,
	EBtlEffectSizeType__XL         = 5,
	EBtlEffectSizeType__PCM        = 6,
	EBtlEffectSizeType__PCL        = 7,
	EBtlEffectSizeType__XL2        = 8,
	EBtlEffectSizeType__XL3        = 9,
	EBtlEffectSizeType__XL4        = 10,
	EBtlEffectSizeType__EBtlEffectSizeType_MAX = 11
};


// Enum Arise.EBtlStateMachine
enum class EBtlStateMachine : uint8_t
{
	EBtlStateMachine__PlayerCharacter = 0,
	EBtlStateMachine__Human        = 1,
	EBtlStateMachine__Moster       = 2,
	EBtlStateMachine__BigMonster   = 3,
	EBtlStateMachine__GigantMonster = 4,
	EBtlStateMachine__MapObject    = 5,
	EBtlStateMachine__Max          = 6
};


// Enum Arise.EBtlPositionType
enum class EBtlPositionType : uint8_t
{
	EBtlPositionType__FRONT        = 0,
	EBtlPositionType__MIDDLE       = 1,
	EBtlPositionType__BACK         = 2,
	EBtlPositionType__EBtlPositionType_MAX = 3
};


// Enum Arise.EBtlLaunchCharacterType
enum class EBtlLaunchCharacterType : uint8_t
{
	EBtlLaunchCharacterType__NORMAL = 0,
	EBtlLaunchCharacterType__Z_IGNORE_EXCLUDE_CUTSCENE = 1,
	EBtlLaunchCharacterType__Z_IGNORE_ALWAYS = 2,
	EBtlLaunchCharacterType__EBtlLaunchCharacterType_MAX = 3
};


// Enum Arise.EBtlUnitFlag
enum class EBtlUnitFlag : uint8_t
{
	EBtlUnitFlag__Boss             = 0,
	EBtlUnitFlag__Dragon           = 1,
	EBtlUnitFlag__CorpseLeft       = 2,
	EBtlUnitFlag__UseMagic         = 3,
	EBtlUnitFlag__UseGuard         = 4,
	EBtlUnitFlag__UseStep          = 5,
	EBtlUnitFlag__FixPosition      = 6,
	EBtlUnitFlag__Fly              = 7,
	EBtlUnitFlag__UnTargetable     = 8,
	EBtlUnitFlag__Armor            = 9,
	EBtlUnitFlag__SuperAvoid       = 10,
	EBtlUnitFlag__SuperiorRank     = 11,
	EBtlUnitFlag__LibraryInfo      = 12,
	EBtlUnitFlag__Overlimit        = 13,
	EBtlUnitFlag__ExtinctionCheck  = 14,
	EBtlUnitFlag__Gigant           = 15,
	EBtlUnitFlag__UnknownHp        = 16,
	EBtlUnitFlag__ShowBossHp       = 17,
	EBtlUnitFlag__UseFacial        = 18,
	EBtlUnitFlag__OverlimitCamera  = 19,
	EBtlUnitFlag__EncountInfoShow  = 20,
	EBtlUnitFlag__Flag21           = 21,
	EBtlUnitFlag__Flag22           = 22,
	EBtlUnitFlag__Flag23           = 23,
	EBtlUnitFlag__Flag24           = 24,
	EBtlUnitFlag__Flag25           = 25,
	EBtlUnitFlag__Flag26           = 26,
	EBtlUnitFlag__Flag27           = 27,
	EBtlUnitFlag__Flag28           = 28,
	EBtlUnitFlag__Flag29           = 29,
	EBtlUnitFlag__Flag30           = 30,
	EBtlUnitFlag__Flag31           = 31,
	EBtlUnitFlag__EBtlUnitFlag_MAX = 32
};


// Enum Arise.EBattleState
enum class EBattleState : uint8_t
{
	EBattleState__StateNone        = 0,
	EBattleState__StateInitialize  = 1,
	EBattleState__StatePrev        = 2,
	EBattleState__StateMain        = 3,
	EBattleState__StatePostMain    = 4,
	EBattleState__StateMenu        = 5,
	EBattleState__StateEvent       = 6,
	EBattleState__StateGameover    = 7,
	EBattleState__StateRetry       = 8,
	EBattleState__StateResult      = 9,
	EBattleState__StateRunaway     = 10,
	EBattleState__StateTutorial    = 11,
	EBattleState__StatePause       = 12,
	EBattleState__StateFinalize    = 13,
	EBattleState__EBattleState_MAX = 14
};


// Enum Arise.EAlphaMask
enum class EAlphaMask : uint8_t
{
	EAlphaMask__Visible            = 0,
	EAlphaMask__Invisible          = 1,
	EAlphaMask__FadeIn             = 2,
	EAlphaMask__FadeOut            = 3,
	EAlphaMask__EAlphaMask_MAX     = 4
};


// Enum Arise.EBattleActionState
enum class EBattleActionState : uint8_t
{
	EBattleActionState__STATE_INVALID = 0,
	EBattleActionState__STATE_MOVE = 1,
	EBattleActionState__STATE_JUMP = 2,
	EBattleActionState__STATE_FALL = 3,
	EBattleActionState__STATE_LAND = 4,
	EBattleActionState__STATE_STEP = 5,
	EBattleActionState__STATE_TURN = 6,
	EBattleActionState__STATE_GUARD = 7,
	EBattleActionState__STATE_DAMAGE = 8,
	EBattleActionState__STATE_BLOW = 9,
	EBattleActionState__STATE_DOWN = 10,
	EBattleActionState__STATE_ARISE = 11,
	EBattleActionState__STATE_REACT = 12,
	EBattleActionState__STATE_DEAD = 13,
	EBattleActionState__STATE_MAGIC = 14,
	EBattleActionState__STATE_ITEM = 15,
	EBattleActionState__STATE_ADVENT = 16,
	EBattleActionState__STATE_ATTACK = 17,
	EBattleActionState__STATE_MAX  = 18
};


// Enum Arise.EBtlAvoidAction
enum class EBtlAvoidAction : uint8_t
{
	EBtlAvoidAction__NONE          = 0,
	EBtlAvoidAction__STEP          = 1,
	EBtlAvoidAction__GUARD         = 2,
	EBtlAvoidAction__EBtlAvoidAction_MAX = 3
};


// Enum Arise.EBtlInOutState
enum class EBtlInOutState : uint8_t
{
	EBtlInOutState__NONE           = 0,
	EBtlInOutState__BTL_IN_PROGRESS = 1,
	EBtlInOutState__BTL_OUT_PROGRESS = 2,
	EBtlInOutState__EBtlInOutState_MAX = 3
};


// Enum Arise.EBtlFlashRaidState
enum class EBtlFlashRaidState : uint8_t
{
	EBtlFlashRaidState__NONE       = 0,
	EBtlFlashRaidState__FLASH_RAID_IN = 1,
	EBtlFlashRaidState__WAIT_FLASH_RAID_IN = 2,
	EBtlFlashRaidState__WAIT_MOVING = 3,
	EBtlFlashRaidState__REQUEST_FLASH_RAID = 4,
	EBtlFlashRaidState__FLASH_RAID = 5,
	EBtlFlashRaidState__EBtlFlashRaidState_MAX = 6
};


// Enum Arise.EBtlHitFilter
enum class EBtlHitFilter : uint8_t
{
	EBtlHitFilter__GROUP_UNKNOWN   = 0,
	EBtlHitFilter__GROUP_PARTY     = 1,
	EBtlHitFilter__GROUP_ENEMY     = 2,
	EBtlHitFilter__GROUP_ANY       = 3,
	EBtlHitFilter__GROUP_MAX       = 4
};


// Enum Arise.EBtlStrikeAttackState
enum class EBtlStrikeAttackState : uint8_t
{
	EBtlStrikeAttackState__NONE    = 0,
	EBtlStrikeAttackState__STRIKE_ATTACK_IN = 1,
	EBtlStrikeAttackState__STRIKE_ATTACK_WAIT_FADEOUT = 2,
	EBtlStrikeAttackState__STRIKE_ATTACK_WARP = 3,
	EBtlStrikeAttackState__STRIKE_ATTACK = 4,
	EBtlStrikeAttackState__STRIKE_ATTACK_BEGIN_ARTS = 5,
	EBtlStrikeAttackState__STRIKE_ATTACK_ARTS = 6,
	EBtlStrikeAttackState__EBtlStrikeAttackState_MAX = 7
};


// Enum Arise.EBtlUnitGroup
enum class EBtlUnitGroup : uint8_t
{
	EBtlUnitGroup__GROUP_UNKNOWN   = 0,
	EBtlUnitGroup__GROUP_PARTY     = 1,
	EBtlUnitGroup__GROUP_ENEMY     = 2,
	EBtlUnitGroup__GROUP_GUEST     = 3,
	EBtlUnitGroup__GROUP_MAX       = 4
};


// Enum Arise.EBtlWaitDeathStrokeState
enum class EBtlWaitDeathStrokeState : uint8_t
{
	EBtlWaitDeathStrokeState__NONE = 0,
	EBtlWaitDeathStrokeState__WAIT_DEATH_STROKE_BEGIN = 1,
	EBtlWaitDeathStrokeState__WAIT_DEATH_STROKE = 2,
	EBtlWaitDeathStrokeState__WAIT_DEATH_STROKE_END = 3,
	EBtlWaitDeathStrokeState__EBtlWaitDeathStrokeState_MAX = 4
};


// Enum Arise.EAbnormalType
enum class EAbnormalType : uint8_t
{
	EAbnormalType__POISON          = 0,
	EAbnormalType__FROZEN          = 1,
	EAbnormalType__PARALYSIS       = 2,
	EAbnormalType__CURSE           = 3,
	EAbnormalType__SEAL            = 4,
	EAbnormalType__NONE            = 5,
	EAbnormalType__EAbnormalType_MAX = 6
};


// Enum Arise.EBtlSimpleBuffType
enum class EBtlSimpleBuffType : uint8_t
{
	EBtlSimpleBuffType__Atk        = 0,
	EBtlSimpleBuffType__ElementAtk = 1,
	EBtlSimpleBuffType__Def        = 2,
	EBtlSimpleBuffType__ElementDef = 3,
	EBtlSimpleBuffType__PenetratePow = 4,
	EBtlSimpleBuffType__EndurancePow = 5,
	EBtlSimpleBuffType__ArtsPower  = 6,
	EBtlSimpleBuffType__ArtsHealPower = 7,
	EBtlSimpleBuffType__EBtlSimpleBuffType_MAX = 8
};


// Enum Arise.EBtlStatusBuffParameterType
enum class EBtlStatusBuffParameterType : uint8_t
{
	EBtlStatusBuffParameterType__Atk = 0,
	EBtlStatusBuffParameterType__ElementAtk = 1,
	EBtlStatusBuffParameterType__Def = 2,
	EBtlStatusBuffParameterType__ElementDef = 3,
	EBtlStatusBuffParameterType__PenetratePow = 4,
	EBtlStatusBuffParameterType__EndurancePow = 5,
	EBtlStatusBuffParameterType__AGRegeneration = 6,
	EBtlStatusBuffParameterType__EBtlStatusBuffParameterType_MAX = 7
};


// Enum Arise.EBtlResultType
enum class EBtlResultType : uint8_t
{
	EBtlResultType__PENDING        = 0,
	EBtlResultType__WIN            = 1,
	EBtlResultType__LOSS           = 2,
	EBtlResultType__RUNWARY        = 3,
	EBtlResultType__EBtlResultType_MAX = 4
};


// Enum Arise.EBtlInputEventType
enum class EBtlInputEventType : uint8_t
{
	EBtlInputEventType__ButtonPressed = 0,
	EBtlInputEventType__ButtonJustPressed = 1,
	EBtlInputEventType__ButtonJustReleased = 2,
	EBtlInputEventType__ButtonRepeated = 3,
	EBtlInputEventType__EBtlInputEventType_MAX = 4
};


// Enum Arise.EBattleHudAbnormalType
enum class EBattleHudAbnormalType : uint8_t
{
	EBattleHudAbnormalType__NONE   = 0,
	EBattleHudAbnormalType__POISON = 1,
	EBattleHudAbnormalType__FROZEN = 2,
	EBattleHudAbnormalType__PARALYSIS = 3,
	EBattleHudAbnormalType__CURSE  = 4,
	EBattleHudAbnormalType__SEAL   = 5,
	EBattleHudAbnormalType__ARMOR_BREAK = 6,
	EBattleHudAbnormalType__RUSH_BREAK = 7,
	EBattleHudAbnormalType__FLYING_BREAK = 8,
	EBattleHudAbnormalType__SUPER_AVOID_Break = 9,
	EBattleHudAbnormalType__ARMOR_BUFF = 10,
	EBattleHudAbnormalType__RUSH_BUFF = 11,
	EBattleHudAbnormalType__FLYING_BUFF = 12,
	EBattleHudAbnormalType__SUPER_AVOID_BUFF = 13,
	EBattleHudAbnormalType__ATK_BUFF = 14,
	EBattleHudAbnormalType__ELEMENT_ATK_BUFF = 15,
	EBattleHudAbnormalType__DEF_BUFF = 16,
	EBattleHudAbnormalType__ELEMENT_DEF_BUFF = 17,
	EBattleHudAbnormalType__PENETRATE_POW_BUFF = 18,
	EBattleHudAbnormalType__ENDURANCE_POW_BUFF = 19,
	EBattleHudAbnormalType__AG_REGENERATION_BUFF = 20,
	EBattleHudAbnormalType__SURROUNDED_ATK_BUFF = 21,
	EBattleHudAbnormalType__EBattleHudAbnormalType_MAX = 22
};


// Enum Arise.EBattleHudNotifyTextPriority
enum class EBattleHudNotifyTextPriority : uint8_t
{
	EBattleHudNotifyTextPriority__DEFAULT = 0,
	EBattleHudNotifyTextPriority__ITEM = 1,
	EBattleHudNotifyTextPriority__CUTSCENE = 2,
	EBattleHudNotifyTextPriority__SYSTEM = 3,
	EBattleHudNotifyTextPriority__EBattleHudNotifyTextPriority_MAX = 4
};


// Enum Arise.EBtlMagicRelativeType
enum class EBtlMagicRelativeType : uint8_t
{
	EBtlMagicRelativeType__OWNER   = 0,
	EBtlMagicRelativeType__TARGET  = 1,
	EBtlMagicRelativeType__PARENT_MAGIC = 2,
	EBtlMagicRelativeType__BATTLE_WORLD = 3,
	EBtlMagicRelativeType__OWNER_TO_TARGET = 4,
	EBtlMagicRelativeType__OWNER_TO_TARGET_Z_AXIS = 5,
	EBtlMagicRelativeType__TARGET_TO_OWNER = 6,
	EBtlMagicRelativeType__TARGET_TO_OWNER_Z_AXIS = 7,
	EBtlMagicRelativeType__PARENT  = 8,
	EBtlMagicRelativeType__PARENT_TO_TARGET = 9,
	EBtlMagicRelativeType__PARENT_TO_TARGET_Z_AXIS = 10,
	EBtlMagicRelativeType__TARGET_TO_PARENT = 11,
	EBtlMagicRelativeType__TARGET_TO_PARENT_Z_AXIS = 12,
	EBtlMagicRelativeType__SELF_TO_TARGET = 13,
	EBtlMagicRelativeType__BATTLE_WORLD_OFFSET_PARENT = 14,
	EBtlMagicRelativeType__EBtlMagicRelativeType_MAX = 15
};


// Enum Arise.EBtlMagicNodeState
enum class EBtlMagicNodeState : uint8_t
{
	EBtlMagicNodeState__None       = 0,
	EBtlMagicNodeState__Begin      = 1,
	EBtlMagicNodeState__Execute    = 2,
	EBtlMagicNodeState__End        = 3,
	EBtlMagicNodeState__MAX        = 4
};


// Enum Arise.EBtlMagicConditionType
enum class EBtlMagicConditionType : uint8_t
{
	EBtlMagicConditionType__And    = 0,
	EBtlMagicConditionType__Or     = 1,
	EBtlMagicConditionType__EBtlMagicConditionType_MAX = 2
};


// Enum Arise.EAriseGuestID
enum class EAriseGuestID : uint8_t
{
	EAriseGuestID__SIO             = 0,
	EAriseGuestID__NNA             = 1,
	EAriseGuestID__ZGU             = 2,
	EAriseGuestID__MNK             = 3,
	EAriseGuestID__YRA             = 4,
	EAriseGuestID__ZFA             = 5,
	EAriseGuestID__INVALID         = 6,
	EAriseGuestID__EAriseGuestID_MAX = 7
};


// Enum Arise.EBtlCutSceneReserveAction
enum class EBtlCutSceneReserveAction : uint8_t
{
	EBtlCutSceneReserveAction__NONE = 0,
	EBtlCutSceneReserveAction__SPECIAL_STRIKE = 1,
	EBtlCutSceneReserveAction__SMASH = 2,
	EBtlCutSceneReserveAction__MYSTIC = 3,
	EBtlCutSceneReserveAction__EVENT_CAPTCHA_WAIT = 4,
	EBtlCutSceneReserveAction__EVENT = 5,
	EBtlCutSceneReserveAction__SEQUENCER_PLAY = 6,
	EBtlCutSceneReserveAction__SEQUENCER_PLAY_WAIT = 7,
	EBtlCutSceneReserveAction__EBtlCutSceneReserveAction_MAX = 8
};


// Enum Arise.EBtlStrikeSmashState
enum class EBtlStrikeSmashState : uint8_t
{
	EBtlStrikeSmashState__NONE     = 0,
	EBtlStrikeSmashState__STRIKE_SMASH_IN = 1,
	EBtlStrikeSmashState__STRIKE_SMASH_WAIT_FADEOUT = 2,
	EBtlStrikeSmashState__STRIKE_SMASH_PRE_ACTION_PLAYER = 3,
	EBtlStrikeSmashState__STRIKE_SMASH_PRE_ACTION_PAIR = 4,
	EBtlStrikeSmashState__STRIKE_SMASH_WAIT_LOADING = 5,
	EBtlStrikeSmashState__STRIKE_SMASH = 6,
	EBtlStrikeSmashState__STRIKE_SMASH_PLAYING = 7,
	EBtlStrikeSmashState__STRIKE_SMASH_PLAY_END = 8,
	EBtlStrikeSmashState__EBtlStrikeSmashState_MAX = 9
};


// Enum Arise.ETacticsIndex
enum class ETacticsIndex : uint8_t
{
	ETacticsIndex__TACTICS         = 0,
	ETacticsIndex__TACTICS01       = 1,
	ETacticsIndex__TACTICS02       = 2,
	ETacticsIndex__TACTICS03       = 3,
	ETacticsIndex__TACTICS_MAX     = 4
};


// Enum Arise.EOperationMode
enum class EOperationMode : uint8_t
{
	EOperationMode__OPERATION_MODE_AUTO = 0,
	EOperationMode__OPERATION_MODE_SEMI_AUTO = 1,
	EOperationMode__OPERATION_MODE_MANUAL = 2,
	EOperationMode__OPERATION_MODE_MAX = 3
};


// Enum Arise.EBtlSemiautoPhase
enum class EBtlSemiautoPhase : uint8_t
{
	EBtlSemiautoPhase__SEMIAUTO_NONE = 0,
	EBtlSemiautoPhase__SEMIAUTO_IDLE = 1,
	EBtlSemiautoPhase__SEMIAUTO_MOVE = 2,
	EBtlSemiautoPhase__SEMIAUTO_STEP = 3,
	EBtlSemiautoPhase__SEMIAUTO_ARTS_MAGIC = 4,
	EBtlSemiautoPhase__SEMIAUTO_AUTOGUARD = 5,
	EBtlSemiautoPhase__SEMIAUTO_AUTOSTEP = 6,
	EBtlSemiautoPhase__SEMIAUTO_START_COMBO = 7,
	EBtlSemiautoPhase__SEMIAUTO_WAIT_NEXT_COMBO = 8,
	EBtlSemiautoPhase__SEMIAUTO_JUMP = 9,
	EBtlSemiautoPhase__SEMIAUTO_JUMP_TO_POINT = 10,
	EBtlSemiautoPhase__SEMIAUTO_MOVE_AWAY_FROM_TARGET = 11,
	EBtlSemiautoPhase__SEMIAUTO_MOVE_TO_SAFE_PLACE = 12,
	EBtlSemiautoPhase__SEMIAUTO_COMBO_END = 13,
	EBtlSemiautoPhase__SEMIAUTO_MAX = 14
};


// Enum Arise.FBtlChangeOrderType
enum class EFBtlChangeOrderType : uint8_t
{
	FBtlChangeOrderType__INVALID   = 0,
	FBtlChangeOrderType__ORDER1    = 1,
	FBtlChangeOrderType__ORDER2    = 2,
	FBtlChangeOrderType__ORDER3    = 3,
	FBtlChangeOrderType__MAX       = 4
};


// Enum Arise.EPCOrder
enum class EPCOrder : uint8_t
{
	EPCOrder__ORDER_1ST            = 0,
	EPCOrder__ORDER_2ND            = 1,
	EPCOrder__ORDER_3RD            = 2,
	EPCOrder__ORDER_4TH            = 3,
	EPCOrder__ORDER_5TH            = 4,
	EPCOrder__ORDER_6TH            = 5,
	EPCOrder__ORDER_7TH            = 6,
	EPCOrder__ORDER_8TH            = 7,
	EPCOrder__ORDER_MAX            = 8
};


// Enum Arise.EBtlCameraMode
enum class EBtlCameraMode : uint8_t
{
	EBtlCameraMode__NORMAL         = 0,
	EBtlCameraMode__LOCKON         = 1,
	EBtlCameraMode__STRIKE_ATTACK  = 2,
	EBtlCameraMode__FLASH_RAID     = 3,
	EBtlCameraMode__STRIKE_SMASH   = 4,
	EBtlCameraMode__FOCUS_UNIT     = 5,
	EBtlCameraMode__SPECIAL_STRIKE_ATTACK = 6,
	EBtlCameraMode__EVENT          = 7,
	EBtlCameraMode__CUTSCENE_TO    = 8,
	EBtlCameraMode__FOCUS_LOCATION = 9,
	EBtlCameraMode__NORMAL_BATTLE_WIN = 10,
	EBtlCameraMode__OVERLIMIT      = 11,
	EBtlCameraMode__INSPIRATION    = 12,
	EBtlCameraMode__MODE_END       = 13,
	EBtlCameraMode__EBtlCameraMode_MAX = 14
};


// Enum Arise.EAriseGameState
enum class EAriseGameState : uint8_t
{
	EAriseGameState__GameState_Pause = 0,
	EAriseGameState__GameState_ScreenMask = 1,
	EAriseGameState__GameState_Nowloading = 2,
	EAriseGameState__GameState_StreamingLevelLoading = 3,
	EAriseGameState__GameState_PlayerFreeLock = 4,
	EAriseGameState__GameState_PlayCutSceneEvent = 5,
	EAriseGameState__GameState_MapChanging = 6,
	EAriseGameState__GameState_Battle = 7,
	EAriseGameState__GameState_BattleTraining = 8,
	EAriseGameState__GameState_PlayEvent = 9,
	EAriseGameState__GameState_PlayQuest = 10,
	EAriseGameState__GameState_PlayLongChat = 11,
	EAriseGameState__GameState_EventFade = 12,
	EAriseGameState__GameState_ActionLadder = 13,
	EAriseGameState__GameState_ActionSwim = 14,
	EAriseGameState__GameState_ActionGrab = 15,
	EAriseGameState__GameState_Fishing = 16,
	EAriseGameState__GameState_AutoSaving = 17,
	EAriseGameState__GameState_EventContinue = 18,
	EAriseGameState__GameState_EncountLock = 19,
	EAriseGameState__GameState_ActionDash = 20,
	EAriseGameState__GameState_ActionFloating = 21,
	EAriseGameState__GameState_PlayScript = 22,
	EAriseGameState__GameState_Camp = 23,
	EAriseGameState__GameState_QuestContinue = 24,
	EAriseGameState__GameState_PlayLookAtCamera = 25,
	EAriseGameState__GameState_BattleResultShowHud = 26,
	EAriseGameState__GameState_PlayInteract = 27,
	EAriseGameState__GameState_ExecuteEnableControlDelegate = 28,
	EAriseGameState__GameState_RequestEnableControlDelegate = 29,
	EAriseGameState__GameState_Menu = 30,
	EAriseGameState__GameState_MenuClosing = 31,
	EAriseGameState__GameState_NearMapLink = 32,
	EAriseGameState__GameState_DoFastTravel = 33,
	EAriseGameState__GameState_GoBackToTitle = 34,
	EAriseGameState__GameState_UIControl = 35,
	EAriseGameState__GameState_Encounting = 36,
	EAriseGameState__GameState_PostGameDataLoaded = 37,
	EAriseGameState__GameState_PassBlocked = 38,
	EAriseGameState__GameState_PlayerFreeLockUntilMapJump = 39,
	EAriseGameState__GameState_SaveLoading = 40,
	EAriseGameState__GameState_TextureStreaming = 41,
	EAriseGameState__GameState_QuestAutoSaveProcess = 42,
	EAriseGameState__GameState_DebugMenuOpen = 43,
	EAriseGameState__GameState_Sandbox = 44,
	EAriseGameState__GameState_FlyMode = 45,
	EAriseGameState__GameState_MAX = 46
};


// Enum Arise.EArtsKey
enum class EArtsKey : uint8_t
{
	EArtsKey__INDEX                = 0,
	EArtsKey__INDEX01              = 1,
	EArtsKey__INDEX02              = 2,
	EArtsKey__INDEX_0_SUB          = 3,
	EArtsKey__INDEX_1_SUB          = 4,
	EArtsKey__INDEX_2_SUB          = 5,
	EArtsKey__MAX                  = 6
};


// Enum Arise.EAriseUIOrder
enum class EAriseUIOrder : uint8_t
{
	EAriseUIOrder__Bottom          = 0,
	EAriseUIOrder__Default         = 1,
	EAriseUIOrder__HUD             = 2,
	EAriseUIOrder__Menu            = 3,
	EAriseUIOrder__LongChat        = 4,
	EAriseUIOrder__Middle          = 5,
	EAriseUIOrder__System          = 6,
	EAriseUIOrder__Top             = 7,
	EAriseUIOrder__TopMost         = 8,
	EAriseUIOrder__EAriseUIOrder_MAX = 9
};


// Enum Arise.EBtlUnitFilterType
enum class EBtlUnitFilterType : uint8_t
{
	EBtlUnitFilterType__NONE       = 0,
	EBtlUnitFilterType__HP_LOWER_EQUAL = 1,
	EBtlUnitFilterType__HP_LOWER_EQUAL_PERCENT = 2,
	EBtlUnitFilterType__HP_UPPER_EQUAL = 3,
	EBtlUnitFilterType__HP_UPPER_EQUAL_PERCENT = 4,
	EBtlUnitFilterType__EBtlUnitFilterType_MAX = 5
};


// Enum Arise.EAriseDebugSaveRoot
enum class EAriseDebugSaveRoot : uint8_t
{
	EAriseDebugSaveRoot__DEBUG_SAVE_ROOT_PC = 0,
	EAriseDebugSaveRoot__DEBUG_SAVE_ROOT_USB = 1,
	EAriseDebugSaveRoot__DEBUG_SAVE_ROOT_HDD = 2,
	EAriseDebugSaveRoot__DEBUG_SAVE_ROOT_MAX = 3
};


// Enum Arise.EAriseSaveResult
enum class EAriseSaveResult : uint8_t
{
	EAriseSaveResult__SAVE_RESULT_SUCCESS = 0,
	EAriseSaveResult__SAVE_RESULT_CANCEL = 1,
	EAriseSaveResult__SAVE_RESULT_FAILED = 2,
	EAriseSaveResult__SAVE_RESULT_NOT_EXIST = 3,
	EAriseSaveResult__SAVE_RESULT_MAX = 4
};


// Enum Arise.EAriseSaveVerify
enum class EAriseSaveVerify : uint8_t
{
	EAriseSaveVerify__VERIFY_SUCCESS = 0,
	EAriseSaveVerify__VERIFY_UNKNOWN_FAILED = 1,
	EAriseSaveVerify__VERIFY_UNKNOWN_ENTITLEMENTS = 2,
	EAriseSaveVerify__VERIFY_INVAILD_ENTITLEMENTS = 3,
	EAriseSaveVerify__VERIFY_ROLLBACK_ITEMS = 4,
	EAriseSaveVerify__VERIFY_MAX   = 5
};


// Enum Arise.EAriseSaveToDoMessage
enum class EAriseSaveToDoMessage : uint8_t
{
	EAriseSaveToDoMessage__SAVE_TODO_MESSAGE_NOT_SHOW = 0,
	EAriseSaveToDoMessage__SAVE_TODO_MESSAGE_SUCCESS = 1,
	EAriseSaveToDoMessage__SAVE_TODO_MESSAGE_VERSION = 2,
	EAriseSaveToDoMessage__SAVE_TODO_MESSAGE_BROKEN = 3,
	EAriseSaveToDoMessage__SAVE_TODO_MESSAGE_NOT_EXIST = 4,
	EAriseSaveToDoMessage__SAVE_TODO_MESSAGE_VERIFY = 5,
	EAriseSaveToDoMessage__SAVE_TODO_MESSAGE_CONDITIONALY_SUCCESS_VERIFY = 6,
	EAriseSaveToDoMessage__SAVE_TODO_MESSAGE_FAILED = 7,
	EAriseSaveToDoMessage__SAVE_TODO_MESSAGE_MAX = 8
};


// Enum Arise.EAriseSaveType
enum class EAriseSaveType : uint8_t
{
	SAVE_TYPE_EMPTY                = 0,
	SAVE_TYPE_MANUAL               = 1,
	SAVE_TYPE_AUTO                 = 2,
	SAVE_TYPE_MAX                  = 3
};


// Enum Arise.EAriseSaveThumbneilType
enum class EAriseSaveThumbneilType : uint8_t
{
	EAriseSaveThumbneilType__SAVE_THUMBNEIL_CAPTURE = 0,
	EAriseSaveThumbneilType__SAVE_THUMBNEIL_NONE = 1,
	EAriseSaveThumbneilType__SAVE_THUMBNEIL_AUTO_SAVE = 2,
	EAriseSaveThumbneilType__SAVE_THUMBNEIL_CLEARED = 3,
	EAriseSaveThumbneilType__SAVE_THUMBNEIL_MAX = 4
};


// Enum Arise.ENewsInfoPurpose
enum class ENewsInfoPurpose : uint8_t
{
	ENewsInfoPurpose__DLC_Top      = 0,
	ENewsInfoPurpose__News         = 1,
	ENewsInfoPurpose__MAX          = 2
};


// Enum Arise.EMenuTopCharaType
enum class EMenuTopCharaType : uint8_t
{
	EMenuTopCharaType__TOP_CHARA_NONE = 0,
	EMenuTopCharaType__TOP_CHARA_DEFAULT = 1,
	EMenuTopCharaType__TOP_CHARA_FRONT = 2,
	EMenuTopCharaType__TOP_CHARA_BACK = 3,
	EMenuTopCharaType__TOP_CHARA_MAX = 4
};


// Enum Arise.EQuestGuideLocationRole
enum class EQuestGuideLocationRole : uint8_t
{
	EQuestGuideLocationRole__None  = 0,
	EQuestGuideLocationRole__MainQuest_TargetActor = 1,
	EQuestGuideLocationRole__SubQuest_OwnerActor_CanOrder = 2,
	EQuestGuideLocationRole__SubQuest_OwnerActor_InOrder = 3,
	EQuestGuideLocationRole__SubQuest_OwnerActor_Report = 4,
	EQuestGuideLocationRole__SubQuest_TargetActor = 5,
	EQuestGuideLocationRole__EQuestGuideLocationRole_MAX = 6
};


// Enum Arise.EPFNpcFacilityType
enum class EPFNpcFacilityType : uint8_t
{
	EPFNpcFacilityType__NPC_FACILITY_NONE = 0,
	EPFNpcFacilityType__NPC_FACILITY_ITEM_SHOP = 1,
	EPFNpcFacilityType__NPC_FACILITY_INN = 2,
	EPFNpcFacilityType__NPC_FACILITY_INFORMATION_SHOP = 3,
	EPFNpcFacilityType__NPC_FACILITY_WEAPON_SHOP = 4,
	EPFNpcFacilityType__NPC_FACILITY_ACCESSORY_SHOP = 5,
	EPFNpcFacilityType__NPC_FACILITY_SHIP_SHOP = 6,
	EPFNpcFacilityType__NPC_FACILITY_OWL_SHOP = 7,
	EPFNpcFacilityType__NPC_FACILITY_UTILITY_SHOP = 8,
	EPFNpcFacilityType__NPC_FACILITY_RECOVERY_SHOP = 9,
	EPFNpcFacilityType__NPC_FACILITY_FARM = 10,
	EPFNpcFacilityType__NPC_FACILITY_COLOSSEUM = 11,
	EPFNpcFacilityType__NPC_FACILITY_GENERAL_STORE = 12,
	EPFNpcFacilityType__NPC_FACILITY_INJURED_PERSON = 13,
	EPFNpcFacilityType__NPC_FACILITY_FISHING_TACKLE_SHOP = 14,
	EPFNpcFacilityType__NPC_FACILITY_PERCH = 15,
	EPFNpcFacilityType__NPC_FACILITY_MAX = 16
};


// Enum Arise.EPlacementNpcPointRole
enum class EPlacementNpcPointRole : uint8_t
{
	EPlacementNpcPointRole__Unknown = 0,
	EPlacementNpcPointRole__HasMainEvent = 1,
	EPlacementNpcPointRole__HasQuest = 2,
	EPlacementNpcPointRole__HasShortChat = 3,
	EPlacementNpcPointRole__HasTalk = 4,
	EPlacementNpcPointRole__HasImportantTalk = 5,
	EPlacementNpcPointRole__HasFacility = 6,
	EPlacementNpcPointRole__EPlacementNpcPointRole_MAX = 7
};


// Enum Arise.EInteractionModelDraw
enum class EInteractionModelDraw : uint8_t
{
	EInteractionModelDraw__Base    = 0,
	EInteractionModelDraw__Gathered = 1,
	EInteractionModelDraw__Hide    = 2,
	EInteractionModelDraw__EInteractionModelDraw_MAX = 3
};


// Enum Arise.EInteractionModelBounds
enum class EInteractionModelBounds : uint8_t
{
	EInteractionModelBounds__Component = 0,
	EInteractionModelBounds__Vertices = 1,
	EInteractionModelBounds__EInteractionModelBounds_MAX = 2
};


// Enum Arise.EAlphaMaskBranch
enum class EAlphaMaskBranch : uint8_t
{
	EAlphaMaskBranch__Visible      = 0,
	EAlphaMaskBranch__Fadeing      = 1,
	EAlphaMaskBranch__Invisible    = 2,
	EAlphaMaskBranch__EAlphaMaskBranch_MAX = 3
};


// Enum Arise.EAlphaMaskFlagCategory
enum class EAlphaMaskFlagCategory : uint8_t
{
	EAlphaMaskFlagCategory__Default = 0,
	EAlphaMaskFlagCategory__Event  = 1,
	EAlphaMaskFlagCategory__Battle = 2,
	EAlphaMaskFlagCategory__BattleEvent = 3,
	EAlphaMaskFlagCategory__Development = 4,
	EAlphaMaskFlagCategory__EAlphaMaskFlagCategory_MAX = 5
};


// Enum Arise.EAlphaMaskDirection
enum class EAlphaMaskDirection : uint8_t
{
	EAlphaMaskDirection__OneToZero = 0,
	EAlphaMaskDirection__ZeroToOne = 1,
	EAlphaMaskDirection__EAlphaMaskDirection_MAX = 2
};


// Enum Arise.EPFNpcCharacterBuildType
enum class EPFNpcCharacterBuildType : uint8_t
{
	EPFNpcCharacterBuildType__Async = 0,
	EPFNpcCharacterBuildType__Sync = 1,
	EPFNpcCharacterBuildType__Queue = 2,
	EPFNpcCharacterBuildType__EPFNpcCharacterBuildType_MAX = 3
};


// Enum Arise.EMapChangeReason
enum class EMapChangeReason : uint8_t
{
	EMapChangeReason__MapChangeByUnknown = 0,
	EMapChangeReason__MapChangeByMapLink = 1,
	EMapChangeReason__MapChangeByFastTravel = 2,
	EMapChangeReason__MapChangeByQuestScript = 3,
	EMapChangeReason__MapChangeByAnyScript = 4,
	EMapChangeReason__MapChangeByPostTitle = 5,
	EMapChangeReason__MapChangeByPostEvent = 6,
	EMapChangeReason__MapChangeByPostDataLoad = 7,
	EMapChangeReason__MapChangeByReloadFunc = 8,
	EMapChangeReason__MapChangeByDebugFunc = 9,
	EMapChangeReason__MapChangeByAnyFunc = 10,
	EMapChangeReason__EMapChangeReason_MAX = 11
};


// Enum Arise.ESceneRunType
enum class ESceneRunType : uint8_t
{
	ESceneRunType__RunTypeStandardScene = 0,
	ESceneRunType__RunTypeTemporaryScene = 1,
	ESceneRunType__RunTypeCleanUpScene = 2,
	ESceneRunType__RunTypePrevScene = 3,
	ESceneRunType__ESceneRunType_MAX = 4
};


// Enum Arise.EARISE_MEM_PEAKVALUE
enum class EARISE_MEM_PEAKVALUE : uint8_t
{
	EARISE_MEM_PEAKVALUE__PV_FREE_MAINMEMORY = 0,
	EARISE_MEM_PEAKVALUE__PV_TEXTURE_TOTAL_USE = 1,
	EARISE_MEM_PEAKVALUE__PV_TEXTURE_TOTAL_DISC = 2,
	EARISE_MEM_PEAKVALUE__PV_WORLD_TEXTURE_TOTAL_USE = 3,
	EARISE_MEM_PEAKVALUE__PV_CHARACTER_TEXTURE_TOTAL_USE = 4,
	EARISE_MEM_PEAKVALUE__PV_PS4_CPU = 5,
	EARISE_MEM_PEAKVALUE__PV_PS4_Garlic = 6,
	EARISE_MEM_PEAKVALUE__PV_MAX   = 7
};


// Enum Arise.EAriseGameScene
enum class EAriseGameScene : uint8_t
{
	EAriseGameScene__Title         = 0,
	EAriseGameScene__DebugMap      = 1,
	EAriseGameScene__Field         = 2,
	EAriseGameScene__Battle        = 3,
	EAriseGameScene__Menu          = 4,
	EAriseGameScene__BattleMenu    = 5,
	EAriseGameScene__Camp          = 6,
	EAriseGameScene__LongChat      = 7,
	EAriseGameScene__Movie         = 8,
	EAriseGameScene__Fishing       = 9,
	EAriseGameScene__PlayerFree    = 10,
	EAriseGameScene__Event         = 11,
	EAriseGameScene__Quest         = 12,
	EAriseGameScene__Ending        = 13,
	EAriseGameScene__Boot          = 14,
	EAriseGameScene__Login         = 15,
	EAriseGameScene__ToLogin       = 16,
	EAriseGameScene__TitleBack     = 17,
	EAriseGameScene__MaxScene      = 18,
	EAriseGameScene__None          = 19,
	EAriseGameScene__EAriseGameScene_MAX = 20
};


// Enum Arise.EARISE_DROPMIPS_TYPE
enum class EARISE_DROPMIPS_TYPE : uint8_t
{
	EARISE_DROPMIPS_TYPE__DROPMIPS_FULL = 0,
	EARISE_DROPMIPS_TYPE__DROPMIPS_UNUSED = 1,
	EARISE_DROPMIPS_TYPE__DROPMIPS_WORLDANDCHAR = 2,
	EARISE_DROPMIPS_TYPE__DROPMIPS_WORLDONLY = 3,
	EARISE_DROPMIPS_TYPE__DROPMIPS_CHARONLY = 4,
	EARISE_DROPMIPS_TYPE__DROPMIPS_DEFAULT = 5,
	EARISE_DROPMIPS_TYPE__DROPMIPS_MAX = 6
};


// Enum Arise.EGameSection
enum class EGameSection : uint8_t
{
	EGameSection__None             = 0,
	EGameSection__InitSystem       = 1,
	EGameSection__Boot             = 2,
	EGameSection__Title            = 3,
	EGameSection__MainGame         = 4,
	EGameSection__MAX              = 5
};


// Enum Arise.ESceneFinalizeReason
enum class ESceneFinalizeReason : uint8_t
{
	ESceneFinalizeReason__FinalizeAtChangeScene = 0,
	ESceneFinalizeReason__FinalizeAtRemove = 1,
	ESceneFinalizeReason__FinalizeAtCleanup = 2,
	ESceneFinalizeReason__ESceneFinalizeReason_MAX = 3
};


// Enum Arise.ESceneInitializeMode
enum class ESceneInitializeMode : uint8_t
{
	ESceneInitializeMode__OnRunScene = 0,
	ESceneInitializeMode__OnReservedScene = 1,
	ESceneInitializeMode__ESceneInitializeMode_MAX = 2
};


// Enum Arise.ESceneControllerWorkState
enum class ESceneControllerWorkState : uint8_t
{
	ESceneControllerWorkState__Nothing = 0,
	ESceneControllerWorkState__WaitSceneInitialize = 1,
	ESceneControllerWorkState__WaitSceneFinalize = 2,
	ESceneControllerWorkState__WaitAssetLoad = 3,
	ESceneControllerWorkState__WaitAssetUnload = 4,
	ESceneControllerWorkState__WaitScreenMaskOn = 5,
	ESceneControllerWorkState__WaitScreenMaskOff = 6,
	ESceneControllerWorkState__ESceneControllerWorkState_MAX = 7
};


// Enum Arise.ESceneControllerState
enum class ESceneControllerState : uint8_t
{
	ESceneControllerState__SceneNone = 0,
	ESceneControllerState__SceneInitilize = 1,
	ESceneControllerState__SceneSleep = 2,
	ESceneControllerState__SceneWakeup = 3,
	ESceneControllerState__SceneRun = 4,
	ESceneControllerState__SceneFinalize = 5,
	ESceneControllerState__SceneDestroy = 6,
	ESceneControllerState__ESceneControllerState_MAX = 7
};


// Enum Arise.ECameraFadeType
enum class ECameraFadeType : uint8_t
{
	ECameraFadeType__FADE_IN       = 0,
	ECameraFadeType__FADE_OUT      = 1,
	ECameraFadeType__FADE_MAX      = 2
};


// Enum Arise.EAINavLinkType
enum class EAINavLinkType : uint8_t
{
	EAINavLinkType__None           = 0,
	EAINavLinkType__Jump           = 1,
	EAINavLinkType__EAINavLinkType_MAX = 2
};


// Enum Arise.EAlphaMaskCameraFadeTaskMethod
enum class EAlphaMaskCameraFadeTaskMethod : uint8_t
{
	EAlphaMaskCameraFadeTaskMethod__None = 0,
	EAlphaMaskCameraFadeTaskMethod__DistanceBoundingSphere = 1,
	EAlphaMaskCameraFadeTaskMethod__DistanceBoundingBox = 2,
	EAlphaMaskCameraFadeTaskMethod__CameraFade = 3,
	EAlphaMaskCameraFadeTaskMethod__EAlphaMaskCameraFadeTaskMethod_MAX = 4
};


// Enum Arise.EAriseBlueprintAssetCreateMethod
enum class EAriseBlueprintAssetCreateMethod : uint8_t
{
	EAriseBlueprintAssetCreateMethod__NewObject = 0,
	EAriseBlueprintAssetCreateMethod__SpawnActor = 1,
	EAriseBlueprintAssetCreateMethod__EAriseBlueprintAssetCreateMethod_MAX = 2
};


// Enum Arise.EAriseBlueprintAssetCategory
enum class EAriseBlueprintAssetCategory : uint8_t
{
	EAriseBlueprintAssetCategory__System = 0,
	EAriseBlueprintAssetCategory__Boot = 1,
	EAriseBlueprintAssetCategory__Title = 2,
	EAriseBlueprintAssetCategory__Menu = 3,
	EAriseBlueprintAssetCategory__Field = 4,
	EAriseBlueprintAssetCategory__Fishing = 5,
	EAriseBlueprintAssetCategory__Longchat = 6,
	EAriseBlueprintAssetCategory__Battle = 7,
	EAriseBlueprintAssetCategory__Manual = 8,
	EAriseBlueprintAssetCategory__Debug = 9,
	EAriseBlueprintAssetCategory__Finalize = 10,
	EAriseBlueprintAssetCategory__EAriseBlueprintAssetCategory_MAX = 11
};


// Enum Arise.EAriseBlueprintAssetLoadPolicy
enum class EAriseBlueprintAssetLoadPolicy : uint8_t
{
	EAriseBlueprintAssetLoadPolicy__Async = 0,
	EAriseBlueprintAssetLoadPolicy__Sync = 1,
	EAriseBlueprintAssetLoadPolicy__EAriseBlueprintAssetLoadPolicy_MAX = 2
};


// Enum Arise.EAriseChunkInstallPriority
enum class EAriseChunkInstallPriority : uint8_t
{
	EAriseChunkInstallPriority__CHUNK_INSTALL_PRIORITY_IMMEDIATE = 0,
	EAriseChunkInstallPriority__CHUNK_INSTALL_PRIORITY_HIGH = 1,
	EAriseChunkInstallPriority__CHUNK_INSTALL_PRIORITY_SLOW = 2,
	EAriseChunkInstallPriority__CHUNK_INSTALL_PRIORITY_MAX = 3
};


// Enum Arise.EAriseChunkInstallSpeed
enum class EAriseChunkInstallSpeed : uint8_t
{
	EAriseChunkInstallSpeed__CHUNK_INSTALL_SPEED_PAUSE = 0,
	EAriseChunkInstallSpeed__CHUNK_INSTALL_SPEED_SLOW = 1,
	EAriseChunkInstallSpeed__CHUNK_INSTALL_SPEED_HIGH = 2,
	EAriseChunkInstallSpeed__CHUNK_INSTALL_SPEED_MAX = 3
};


// Enum Arise.EAriseChunkLocation
enum class EAriseChunkLocation : uint8_t
{
	EAriseChunkLocation__CHUNK_LOCATION_NOT_EXIST = 0,
	EAriseChunkLocation__CHUNK_LOCATION_NOT_INSTALLED = 1,
	EAriseChunkLocation__CHUNK_LOCATION_LOCAL_SLOW = 2,
	EAriseChunkLocation__CHUNK_LOCATION_LOCAL_FAST = 3,
	EAriseChunkLocation__CHUNK_LOCATION_MAX = 4
};


// Enum Arise.EAriseChunkNo
enum class EAriseChunkNo : uint8_t
{
	EAriseChunkNo__CHUNK_NO_00     = 0,
	EAriseChunkNo__CHUNK_NO_01     = 1,
	EAriseChunkNo__CHUNK_NO_02     = 2,
	EAriseChunkNo__CHUNK_NUM       = 3,
	EAriseChunkNo__CHUNK_MAX       = 4
};


// Enum Arise.EAriseCommerceResult
enum class EAriseCommerceResult : uint8_t
{
	EAriseCommerceResult__COMMERCE_RESULT_SUCCESS = 0,
	EAriseCommerceResult__COMMERCE_RESULT_CANCEL = 1,
	EAriseCommerceResult__COMMERCE_RESULT_FAILED = 2,
	EAriseCommerceResult__COMMERCE_RESULT_MAX = 3
};


// Enum Arise.EAriseSoundOutputType
enum class EAriseSoundOutputType : uint8_t
{
	EAriseSoundOutputType__STEREO  = 0,
	EAriseSoundOutputType__SURROUND = 1,
	EAriseSoundOutputType__EAriseSoundOutputType_MAX = 2
};


// Enum Arise.EAriseAdvanceInputType
enum class EAriseAdvanceInputType : uint8_t
{
	EAriseAdvanceInputType__ADVANCE_INPUT_SHORT = 0,
	EAriseAdvanceInputType__ADVANCE_INPUT_LONG = 1,
	EAriseAdvanceInputType__ADVANCE_INPUT_MAX = 2
};


// Enum Arise.EAriseCameraControlType
enum class EAriseCameraControlType : uint8_t
{
	EAriseCameraControlType__CAMERA_CONTROL_NORMAL = 0,
	EAriseCameraControlType__CAMERA_CONTROL_REVERSE = 1,
	EAriseCameraControlType__CAMERA_CONTROL_MAX = 2
};


// Enum Arise.EDLCAcquireItemType
enum class EDLCAcquireItemType : uint8_t
{
	EDLCAcquireItemType__Unknown   = 0,
	EDLCAcquireItemType__Item      = 1,
	EDLCAcquireItemType__EDLCAcquireItemType_MAX = 2
};


// Enum Arise.EAriseGameProcessState
enum class EAriseGameProcessState : uint8_t
{
	EAriseGameProcessState__Begin  = 0,
	EAriseGameProcessState__Main   = 1,
	EAriseGameProcessState__End    = 2,
	EAriseGameProcessState__EAriseGameProcessState_MAX = 3
};


// Enum Arise.EAriseCharaIconID
enum class EAriseCharaIconID : uint8_t
{
	EAriseCharaIconID__INVALID     = 0,
	EAriseCharaIconID__ARI         = 1,
	EAriseCharaIconID__SIO         = 2,
	EAriseCharaIconID__NNA         = 3,
	EAriseCharaIconID__ZGU         = 4,
	EAriseCharaIconID__MNK         = 5,
	EAriseCharaIconID__YRA         = 6,
	EAriseCharaIconID__ZFA         = 7,
	EAriseCharaIconID__BEZ         = 8,
	EAriseCharaIconID__KIL         = 9,
	EAriseCharaIconID__AGM         = 10,
	EAriseCharaIconID__DFN         = 11,
	EAriseCharaIconID__SOL         = 12,
	EAriseCharaIconID__LHI         = 13,
	EAriseCharaIconID__NPC         = 14,
	EAriseCharaIconID__NPC01       = 15,
	EAriseCharaIconID__NPC02       = 16,
	EAriseCharaIconID__NPC03       = 17,
	EAriseCharaIconID__NPC04       = 18,
	EAriseCharaIconID__NPC05       = 19,
	EAriseCharaIconID__NPC06       = 20,
	EAriseCharaIconID__NPC07       = 21,
	EAriseCharaIconID__NPC08       = 22,
	EAriseCharaIconID__FRU         = 23,
	EAriseCharaIconID__MRS         = 24,
	EAriseCharaIconID__DNS         = 25,
	EAriseCharaIconID__ODT         = 26,
	EAriseCharaIconID__CCL         = 27,
	EAriseCharaIconID__KRN         = 28,
	EAriseCharaIconID__EDN         = 29,
	EAriseCharaIconID__EIZ         = 30,
	EAriseCharaIconID__KLZ         = 31,
	EAriseCharaIconID__DAR         = 32,
	EAriseCharaIconID__LSW         = 33,
	EAriseCharaIconID__LGU         = 34,
	EAriseCharaIconID__LLA         = 35,
	EAriseCharaIconID__DOC         = 36,
	EAriseCharaIconID__ELS         = 37,
	EAriseCharaIconID__ELM         = 38,
	EAriseCharaIconID__SGU         = 39,
	EAriseCharaIconID__CBK         = 40,
	EAriseCharaIconID__CBA         = 41,
	EAriseCharaIconID__EAriseCharaIconID_MAX = 42
};


// Enum Arise.EAriseKpiVoiceLanguage
enum class EAriseKpiVoiceLanguage : uint8_t
{
	EAriseKpiVoiceLanguage__JA     = 0,
	EAriseKpiVoiceLanguage__EN     = 1,
	EAriseKpiVoiceLanguage__EAriseKpiVoiceLanguage_MAX = 2
};


// Enum Arise.EAriseKpiDlcShopResult
enum class EAriseKpiDlcShopResult : uint8_t
{
	EAriseKpiDlcShopResult__Nothing = 0,
	EAriseKpiDlcShopResult__Transition = 1,
	EAriseKpiDlcShopResult__EAriseKpiDlcShopResult_MAX = 2
};


// Enum Arise.EAriseKpiExDungeonType
enum class EAriseKpiExDungeonType : uint8_t
{
	EAriseKpiExDungeonType__EXD_ALIEN_VISITOR = 0,
	EAriseKpiExDungeonType__EXD_RECOLLECTION = 1,
	EAriseKpiExDungeonType__EXD_MAX = 2
};


// Enum Arise.EAriseKpiExDungeonData
enum class EAriseKpiExDungeonData : uint8_t
{
	EAriseKpiExDungeonData__Clear  = 0,
	EAriseKpiExDungeonData__Visit  = 1,
	EAriseKpiExDungeonData__EAriseKpiExDungeonData_MAX = 2
};


// Enum Arise.EAriseKpiAccessoryShop
enum class EAriseKpiAccessoryShop : uint8_t
{
	EAriseKpiAccessoryShop__Create = 0,
	EAriseKpiAccessoryShop__Strengthen = 1,
	EAriseKpiAccessoryShop__Synthesis = 2,
	EAriseKpiAccessoryShop__EAriseKpiAccessoryShop_MAX = 3
};


// Enum Arise.EAriseLogCategory
enum class EAriseLogCategory : uint8_t
{
	EAriseLogCategory__EEvent      = 0,
	EAriseLogCategory__ELongChat   = 1,
	EAriseLogCategory__BattleRegulation = 2,
	EAriseLogCategory__Num         = 3,
	EAriseLogCategory__EAriseLogCategory_MAX = 4
};


// Enum Arise.EAriseMiningItemType
enum class EAriseMiningItemType : uint8_t
{
	EAriseMiningItemType__Basic    = 0,
	EAriseMiningItemType__Artifact = 1,
	EAriseMiningItemType__EAriseMiningItemType_MAX = 2
};


// Enum Arise.EGuestOrder
enum class EGuestOrder : uint8_t
{
	EGuestOrder__GUEST_1ST         = 0,
	EGuestOrder__GUEST_2ND         = 1,
	EGuestOrder__GUEST_3RD         = 2,
	EGuestOrder__GUEST_4TH         = 3,
	EGuestOrder__GUEST_MAX         = 4
};


// Enum Arise.EBackupOrder
enum class EBackupOrder : uint8_t
{
	EBackupOrder__BACKUP_1ST       = 0,
	EBackupOrder__BACKUP_2ND       = 1,
	EBackupOrder__BACKUP_3RD       = 2,
	EBackupOrder__BACKUP_4TH       = 3,
	EBackupOrder__BACKUP_MAX       = 4
};


// Enum Arise.EControlPlayer
enum class EControlPlayer : uint8_t
{
	EControlPlayer__PLAYER_1P      = 0,
	EControlPlayer__PLAYER_2P      = 1,
	EControlPlayer__PLAYER_3P      = 2,
	EControlPlayer__PLAYER_4P      = 3,
	EControlPlayer__PLAYER_MAX     = 4
};


// Enum Arise.EBottleEffect
enum class EBottleEffect : uint8_t
{
	EBottleEffect__BOTTLE_EFFECT_NONE = 0,
	EBottleEffect__BOTTLE_EFFECT_HOLY = 1,
	EBottleEffect__BOTTLE_EFFECT_DARK = 2,
	EBottleEffect__BOTTLE_EFFECT_MAX = 3
};


// Enum Arise.EEquipCategory
enum class EEquipCategory : uint8_t
{
	EEquipCategory__WEAPON         = 0,
	EEquipCategory__ARMOR          = 1,
	EEquipCategory__ACCESSORY      = 2,
	EEquipCategory__MAX            = 3
};


// Enum Arise.EAriseRelationshipSeriousCheck
enum class EAriseRelationshipSeriousCheck : uint8_t
{
	EAriseRelationshipSeriousCheck__NON = 0,
	EAriseRelationshipSeriousCheck__SERIOUS_ENABLE = 1,
	EAriseRelationshipSeriousCheck__SERIOUS_DISABLE = 2,
	EAriseRelationshipSeriousCheck__EAriseRelationshipSeriousCheck_MAX = 3
};


// Enum Arise.EAriseResidentAssetCategory
enum class EAriseResidentAssetCategory : uint8_t
{
	EAriseResidentAssetCategory__System = 0,
	EAriseResidentAssetCategory__Boot = 1,
	EAriseResidentAssetCategory__Title = 2,
	EAriseResidentAssetCategory__Menu = 3,
	EAriseResidentAssetCategory__Field = 4,
	EAriseResidentAssetCategory__Fishing = 5,
	EAriseResidentAssetCategory__Longchat = 6,
	EAriseResidentAssetCategory__Battle = 7,
	EAriseResidentAssetCategory__Manual = 8,
	EAriseResidentAssetCategory__Debug = 9,
	EAriseResidentAssetCategory__EAriseResidentAssetCategory_MAX = 10
};


// Enum Arise.EAriseResidentAssetLoadPolicy
enum class EAriseResidentAssetLoadPolicy : uint8_t
{
	EAriseResidentAssetLoadPolicy__Async = 0,
	EAriseResidentAssetLoadPolicy__Sync = 1,
	EAriseResidentAssetLoadPolicy__EAriseResidentAssetLoadPolicy_MAX = 2
};


// Enum Arise.EAriseSaveFlag
enum class EAriseSaveFlag : uint8_t
{
	EAriseSaveFlag__SAVE_FLAG_LOCK = 0,
	EAriseSaveFlag__SAVE_FLAG_MAX  = 1
};


// Enum Arise.EAriseSaveParameterIndex
enum class EAriseSaveParameterIndex : uint8_t
{
	EAriseSaveParameterIndex__SAVE_PARAMETER_INDEX_FLAG = 0,
	EAriseSaveParameterIndex__SAVE_PARAMETER_INDEX_MAX = 1
};


// Enum Arise.EAriseScenarioVariableSerialize
enum class EAriseScenarioVariableSerialize : uint8_t
{
	EAriseScenarioVariableSerialize__None = 0,
	EAriseScenarioVariableSerialize__Save = 1,
	EAriseScenarioVariableSerialize__Load = 2,
	EAriseScenarioVariableSerialize__EAriseScenarioVariableSerialize_MAX = 3
};


// Enum Arise.EAriseScriptSaveDataType
enum class EAriseScriptSaveDataType : uint8_t
{
	EAriseScriptSaveDataType__SCRIPT_SAVEDATA_TYPE_BOOL = 0,
	EAriseScriptSaveDataType__SCRIPT_SAVEDATA_TYPE_FLOAT = 1,
	EAriseScriptSaveDataType__SCRIPT_SAVEDATA_TYPE_INT32 = 2,
	EAriseScriptSaveDataType__SCRIPT_SAVEDATA_TYPE_INT64 = 3,
	EAriseScriptSaveDataType__SCRIPT_SAVEDATA_TYPE_MAX = 4
};


// Enum Arise.EStatusConstraint
enum class EStatusConstraint : uint8_t
{
	EStatusConstraint__Nothing     = 0,
	EStatusConstraint__Advantaged  = 1,
	EStatusConstraint__Disadvantaged = 2,
	EStatusConstraint__Locked      = 3,
	EStatusConstraint__EStatusConstraint_MAX = 4
};


// Enum Arise.ESavedDlcCheckIcon
enum class ESavedDlcCheckIcon : uint8_t
{
	ESavedDlcCheckIcon__SAVE_DLC_NEW_ICON_CHECK_NOSTORE = 0,
	ESavedDlcCheckIcon__SAVE_DLC_NEW_ICON_CHECK_YET = 1,
	ESavedDlcCheckIcon__SAVE_DLC_NEW_ICON_CHECK_CONFIRMED = 2,
	ESavedDlcCheckIcon__SAVE_DLC_NEW_ICON_CHECK_MAX = 3
};


// Enum Arise.ESavedVoiceLanguage
enum class ESavedVoiceLanguage : uint8_t
{
	ESavedVoiceLanguage__SAVE_VOICE_NOT_SET = 0,
	ESavedVoiceLanguage__SAVE_VOICE_JAPANESE = 1,
	ESavedVoiceLanguage__SAVE_VOICE_ENGLISH = 2,
	ESavedVoiceLanguage__SAVE_VOICE_MAX = 3
};


// Enum Arise.ESavedCEBankAgreement
enum class ESavedCEBankAgreement : uint8_t
{
	ESavedCEBankAgreement__SAVE_CE_BANK_NOT_YET = 0,
	ESavedCEBankAgreement__SAVE_CE_BANK_AGREE = 1,
	ESavedCEBankAgreement__SAVE_CE_BANK_DISAGREE = 2,
	ESavedCEBankAgreement__SAVE_CE_BANK_MAX = 3
};


// Enum Arise.ESavedPPAgreement
enum class ESavedPPAgreement : uint8_t
{
	ESavedPPAgreement__SAVE_PP_NOT_YET = 0,
	ESavedPPAgreement__SAVE_PP_AGREE = 1,
	ESavedPPAgreement__SAVE_PP_DISAGREE = 2,
	ESavedPPAgreement__SAVE_PP_MAX = 3
};


// Enum Arise.ESavedEulaAgreement
enum class ESavedEulaAgreement : uint8_t
{
	ESavedEulaAgreement__SAVE_EULA_NOT_YET = 0,
	ESavedEulaAgreement__SAVE_EULA_AGREE = 1,
	ESavedEulaAgreement__SAVE_EULA_DISAGREE = 2,
	ESavedEulaAgreement__SAVE_EULA_MAX = 3
};


// Enum Arise.BtlHudFaceIcon
enum class EBtlHudFaceIcon : uint8_t
{
	BtlHudFaceIcon__BTLHUD_FACEICON_ARI = 0,
	BtlHudFaceIcon__BTLHUD_FACEICON_SIO = 1,
	BtlHudFaceIcon__BTLHUD_FACEICON_NNA = 2,
	BtlHudFaceIcon__BTLHUD_FACEICON_ZGU = 3,
	BtlHudFaceIcon__BTLHUD_FACEICON_MNK = 4,
	BtlHudFaceIcon__BTLHUD_FACEICON_YRA = 5,
	BtlHudFaceIcon__BTLHUD_FACEICON_ARI01 = 6,
	BtlHudFaceIcon__BTLHUD_FACEICON_ARI02 = 7,
	BtlHudFaceIcon__BTLHUD_FACEICON_ARI03 = 8,
	BtlHudFaceIcon__BTLHUD_FACEICON_ARI04 = 9,
	BtlHudFaceIcon__BTLHUD_FACEICON_ARI05 = 10,
	BtlHudFaceIcon__BTLHUD_FACEICON_ARI06 = 11,
	BtlHudFaceIcon__BTLHUD_FACEICON_SIO01 = 12,
	BtlHudFaceIcon__BTLHUD_FACEICON_DLC = 13,
	BtlHudFaceIcon__BTLHUD_FACEICON_DLC01 = 14,
	BtlHudFaceIcon__BTLHUD_FACEICON_MAX = 15
};


// Enum Arise.EBtlAliasCountDefine
enum class EBtlAliasCountDefine : uint8_t
{
	EBtlAliasCountDefine__STRIKE_COUNT = 0,
	EBtlAliasCountDefine__STRIKE_SUCCESS_COUNT = 1,
	EBtlAliasCountDefine__COOK_COUNT = 2,
	EBtlAliasCountDefine__EAT_FOOD_COUNT = 3,
	EBtlAliasCountDefine__EAT_FAVORITE_FOOD_COUNT = 4,
	EBtlAliasCountDefine__MAX      = 5
};


// Enum Arise.EBtlAliasDefine
enum class EBtlAliasDefine : uint8_t
{
	EBtlAliasDefine__NONE          = 0,
	EBtlAliasDefine__STRIKE_COUNT  = 1,
	EBtlAliasDefine__STRIKE_SUCCESS_COUNT = 2,
	EBtlAliasDefine__COOK_COUNT    = 3,
	EBtlAliasDefine__EAT_FOOD_COUNT = 4,
	EBtlAliasDefine__EAT_FAVORITE_FOOD_COUNT = 5,
	EBtlAliasDefine__SPECIAL_SIO_COUNT = 6,
	EBtlAliasDefine__BIG_FISHING_COUNT = 7,
	EBtlAliasDefine__ANY_LIKABLE_COUNT = 8,
	EBtlAliasDefine__WEAPON_KIND_MAKE_COUNT = 9,
	EBtlAliasDefine__SPECIAL_WEAPON_MAKE = 10,
	EBtlAliasDefine__SPECIAL_ACCESSORY_MAKE = 11,
	EBtlAliasDefine__SPECIAL_FISHING = 12,
	EBtlAliasDefine__ACCESSORY_MAKE_COUNT = 13,
	EBtlAliasDefine__ITEM_COLLECTION = 14,
	EBtlAliasDefine__OWL_COLLECTION = 15,
	EBtlAliasDefine__ARTIFACT_COUNT = 16,
	EBtlAliasDefine__LEG_SKILL_COUNT = 17,
	EBtlAliasDefine__HEAVY_SKILL_COUNT = 18,
	EBtlAliasDefine__MAGIC_SKILL_COUNT = 19,
	EBtlAliasDefine__PASTURE_COLLECTION = 20,
	EBtlAliasDefine__HEALING_SKILL_COUNT = 21,
	EBtlAliasDefine__SPECIAL_COOK  = 22,
	EBtlAliasDefine__QUEST_CLEAR   = 23,
	EBtlAliasDefine__EBtlAliasDefine_MAX = 24
};


// Enum Arise.EBtlArenaClass
enum class EBtlArenaClass : uint8_t
{
	EBtlArenaClass__Low            = 0,
	EBtlArenaClass__Middle         = 1,
	EBtlArenaClass__High           = 2,
	EBtlArenaClass__Expert         = 3,
	EBtlArenaClass__EBtlArenaClass_MAX = 4
};


// Enum Arise.EBtlArenaType
enum class EBtlArenaType : uint8_t
{
	EBtlArenaType__Single          = 0,
	EBtlArenaType__Party           = 1,
	EBtlArenaType__Special         = 2,
	EBtlArenaType__EBtlArenaType_MAX = 3
};


// Enum Arise.EBtlSkillUnit
enum class EBtlSkillUnit : uint8_t
{
	EBtlSkillUnit__VALUE           = 0,
	EBtlSkillUnit__PERCENT         = 1,
	EBtlSkillUnit__EBtlSkillUnit_MAX = 2
};


// Enum Arise.EBtlSkillDefine
enum class EBtlSkillDefine : uint8_t
{
	EBtlSkillDefine__NONE          = 0,
	EBtlSkillDefine__ICON          = 1,
	EBtlSkillDefine__SE_VOICE      = 2,
	EBtlSkillDefine__EBtlSkillDefine_MAX = 3
};


// Enum Arise.EBtlSkillCategory
enum class EBtlSkillCategory : uint8_t
{
	EBtlSkillCategory__ATTACK      = 0,
	EBtlSkillCategory__DEFENSE     = 1,
	EBtlSkillCategory__SUPPORT     = 2,
	EBtlSkillCategory__UNIQUE      = 3,
	EBtlSkillCategory__ACTION      = 4,
	EBtlSkillCategory__ARTS        = 5,
	EBtlSkillCategory__EBtlSkillCategory_MAX = 6
};


// Enum Arise.EBtlSkillType
enum class EBtlSkillType : uint8_t
{
	EBtlSkillType__PASSIVE         = 0,
	EBtlSkillType__ACTIVE          = 1,
	EBtlSkillType__SKILL           = 2,
	EBtlSkillType__RANDOM          = 3,
	EBtlSkillType__COOK            = 4,
	EBtlSkillType__ARTIFACT        = 5,
	EBtlSkillType__WEAPON          = 6,
	EBtlSkillType__ACCESSORY       = 7,
	EBtlSkillType__BASIC           = 8,
	EBtlSkillType__EBtlSkillType_MAX = 9
};


// Enum Arise.EActionCriticalStatus
enum class EActionCriticalStatus : uint8_t
{
	EActionCriticalStatus__UNCALCULATED = 0,
	EActionCriticalStatus__SUCCESS = 1,
	EActionCriticalStatus__FAIL    = 2,
	EActionCriticalStatus__EActionCriticalStatus_MAX = 3
};


// Enum Arise.EBtlCameraAnimStartType
enum class EBtlCameraAnimStartType : uint8_t
{
	EBtlCameraAnimStartType__BATTLE_WORLD = 0,
	EBtlCameraAnimStartType__OWNER_CHARACTER = 1,
	EBtlCameraAnimStartType__EBtlCameraAnimStartType_MAX = 2
};


// Enum Arise.EBtlArtsCategory
enum class EBtlArtsCategory : uint8_t
{
	EBtlArtsCategory__NORMAL_ATTACK = 0,
	EBtlArtsCategory__SKILL        = 1,
	EBtlArtsCategory__SECRET_SKILL = 2,
	EBtlArtsCategory__CHANT_MAGIC  = 3,
	EBtlArtsCategory__HEAL_MAGIC   = 4,
	EBtlArtsCategory__SPIRIT_MAGIC = 5,
	EBtlArtsCategory__EBtlArtsCategory_MAX = 6
};


// Enum Arise.EBtlArtsRangeType
enum class EBtlArtsRangeType : uint8_t
{
	EBtlArtsRangeType__FORWARD_SINGLE_SHORT = 0,
	EBtlArtsRangeType__FORWARD_SINGLE_LONG = 1,
	EBtlArtsRangeType__FORWARD_WIDE_SHORT = 2,
	EBtlArtsRangeType__FORWARD_WIDE_LONG = 3,
	EBtlArtsRangeType__CIRCLE_SHORT = 4,
	EBtlArtsRangeType__CIRCLE_LONG = 5,
	EBtlArtsRangeType__FULL_AREA   = 6,
	EBtlArtsRangeType__EBtlArtsRangeType_MAX = 7
};


// Enum Arise.EBtlSmashType
enum class EBtlSmashType : uint8_t
{
	EBtlSmashType__BLOW            = 0,
	EBtlSmashType__DOWN            = 1,
	EBtlSmashType__BREAK           = 2,
	EBtlSmashType__EBtlSmashType_MAX = 3
};


// Enum Arise.EBtlBuffOverlap
enum class EBtlBuffOverlap : uint8_t
{
	EBtlBuffOverlap__Overlap       = 0,
	EBtlBuffOverlap__NewBuffOverride = 1,
	EBtlBuffOverlap__EBtlBuffOverlap_MAX = 2
};


// Enum Arise.EBtlBuffType
enum class EBtlBuffType : uint8_t
{
	EBtlBuffType__None             = 0,
	EBtlBuffType__Buff             = 1,
	EBtlBuffType__ActiveSkill      = 2,
	EBtlBuffType__PassiveSkill     = 3,
	EBtlBuffType__Weapon           = 4,
	EBtlBuffType__Accessory        = 5,
	EBtlBuffType__Cooking          = 6,
	EBtlBuffType__Basic            = 7,
	EBtlBuffType__EBtlBuffType_MAX = 8
};


// Enum Arise.EBtlStatusBuffType
enum class EBtlStatusBuffType : uint8_t
{
	EBtlStatusBuffType__Event      = 0,
	EBtlStatusBuffType__Tickable   = 1,
	EBtlStatusBuffType__Intervention = 2,
	EBtlStatusBuffType__EBtlStatusBuffType_MAX = 3
};


// Enum Arise.EBtlCameraEasingState
enum class EBtlCameraEasingState : uint8_t
{
	EBtlCameraEasingState__Easing_IN = 0,
	EBtlCameraEasingState__Easing_KEEP = 1,
	EBtlCameraEasingState__Easing_OUT = 2,
	EBtlCameraEasingState__Easing_END = 3,
	EBtlCameraEasingState__Easing_MAX = 4
};


// Enum Arise.EBtlCameraFocusLocationState
enum class EBtlCameraFocusLocationState : uint8_t
{
	EBtlCameraFocusLocationState__NONE = 0,
	EBtlCameraFocusLocationState__FOCUS_LOCATION_IN = 1,
	EBtlCameraFocusLocationState__FOCUS_LOCATION_KEEP = 2,
	EBtlCameraFocusLocationState__FOCUS_LOCATION_OUT = 3,
	EBtlCameraFocusLocationState__EBtlCameraFocusLocationState_MAX = 4
};


// Enum Arise.EBtlDefaultAttackCollisionType
enum class EBtlDefaultAttackCollisionType : uint8_t
{
	EBtlDefaultAttackCollisionType__Sphere = 0,
	EBtlDefaultAttackCollisionType__Capsule = 1,
	EBtlDefaultAttackCollisionType__EBtlDefaultAttackCollisionType_MAX = 2
};


// Enum Arise.EBtlAttackCollisionPlotType
enum class EBtlAttackCollisionPlotType : uint8_t
{
	EBtlAttackCollisionPlotType__OWNER = 0,
	EBtlAttackCollisionPlotType__TARGET = 1,
	EBtlAttackCollisionPlotType__OTHER = 2,
	EBtlAttackCollisionPlotType__EBtlAttackCollisionPlotType_MAX = 3
};


// Enum Arise.EAriseSkillState
enum class EAriseSkillState : uint8_t
{
	EAriseSkillState__Disable      = 0,
	EAriseSkillState__Enable       = 1,
	EAriseSkillState__Effective    = 2,
	EAriseSkillState__EAriseSkillState_MAX = 3
};


// Enum Arise.EBtl_DecalMaterilParameterType
enum class EBtl_DecalMaterilParameterType : uint8_t
{
	EBtl_DecalMaterilParameterType__Unknown = 0,
	EBtl_DecalMaterilParameterType__Scolar = 1,
	EBtl_DecalMaterilParameterType__ScolarCurve = 2,
	EBtl_DecalMaterilParameterType__ScolarSimple = 3,
	EBtl_DecalMaterilParameterType__Vector = 4,
	EBtl_DecalMaterilParameterType__VectorCurve = 5,
	EBtl_DecalMaterilParameterType__VectorSimple = 6,
	EBtl_DecalMaterilParameterType__Texture = 7,
	EBtl_DecalMaterilParameterType__EBtl_MAX = 8
};


// Enum Arise.EBtlInputConfigType
enum class EBtlInputConfigType : uint8_t
{
	EBtlInputConfigType__InputEnable = 0,
	EBtlInputConfigType__BattleFinish = 1,
	EBtlInputConfigType__MainStateOnly = 2,
	EBtlInputConfigType__CutScene  = 3,
	EBtlInputConfigType__Pause     = 4,
	EBtlInputConfigType__DebugWindow = 5,
	EBtlInputConfigType__Tutorial  = 6,
	EBtlInputConfigType__SystemPause = 7,
	EBtlInputConfigType__MetaScript = 8,
	EBtlInputConfigType__PlayerChangeFormation = 9,
	EBtlInputConfigType__MapChange = 10,
	EBtlInputConfigType__BoostStrike = 11,
	EBtlInputConfigType__EBtlInputConfigType_MAX = 12
};


// Enum Arise.EBtlRequestDarknessPhase
enum class EBtlRequestDarknessPhase : uint8_t
{
	EBtlRequestDarknessPhase__NONE = 0,
	EBtlRequestDarknessPhase__IN_DARKNESS = 1,
	EBtlRequestDarknessPhase__OUT_DARKNESS = 2,
	EBtlRequestDarknessPhase__EBtlRequestDarknessPhase_MAX = 3
};


// Enum Arise.EBtlDebugPresetGetRP
enum class EBtlDebugPresetGetRP : uint8_t
{
	RP_Little                      = 0,
	RP_Normal                      = 1,
	RP_Many                        = 2,
	RP_MAX                         = 3
};


// Enum Arise.EBtlSoundPostEvent
enum class EBtlSoundPostEvent : uint8_t
{
	EBtlSoundPostEvent__NONE       = 0,
	EBtlSoundPostEvent__SND_BTL_BREAK = 1,
	EBtlSoundPostEvent__SND_BTL_MYSTIC_SAFE = 2,
	EBtlSoundPostEvent__SND_BTL_FINISH_SAFE = 3,
	EBtlSoundPostEvent__SND_BOOST1_START = 4,
	EBtlSoundPostEvent__SND_BOOST1_END = 5,
	EBtlSoundPostEvent__SND_BOOST2_START = 6,
	EBtlSoundPostEvent__SND_BOOST2_END = 7,
	EBtlSoundPostEvent__SND_BTL_ARTS_LOOP_STOP = 8,
	EBtlSoundPostEvent__EBtlSoundPostEvent_MAX = 9
};


// Enum Arise.EBtlHitEffectOffsetRotationType
enum class EBtlHitEffectOffsetRotationType : uint8_t
{
	EBtlHitEffectOffsetRotationType__Addition = 0,
	EBtlHitEffectOffsetRotationType__Combine = 1,
	EBtlHitEffectOffsetRotationType__EBtlHitEffectOffsetRotationType_MAX = 2
};


// Enum Arise.EBtlHitEffectCalculateRotationType
enum class EBtlHitEffectCalculateRotationType : uint8_t
{
	EBtlHitEffectCalculateRotationType__DamageToAttackerUnitDirection = 0,
	EBtlHitEffectCalculateRotationType__AttackerCollisionRotation = 1,
	EBtlHitEffectCalculateRotationType__EBtlHitEffectCalculateRotationType_MAX = 2
};


// Enum Arise.EBtlUnitDirectionType
enum class EBtlUnitDirectionType : uint8_t
{
	EBtlUnitDirectionType__NONE    = 0,
	EBtlUnitDirectionType__FORWARD = 1,
	EBtlUnitDirectionType__RIGHT   = 2,
	EBtlUnitDirectionType__LEFT    = 3,
	EBtlUnitDirectionType__BACKWARD = 4,
	EBtlUnitDirectionType__EBtlUnitDirectionType_MAX = 5
};


// Enum Arise.EBtlFadeFilter
enum class EBtlFadeFilter : uint8_t
{
	EBtlFadeFilter__OWNER          = 0,
	EBtlFadeFilter__PARTY          = 1,
	EBtlFadeFilter__ENEMY          = 2,
	EBtlFadeFilter__ANY            = 3,
	EBtlFadeFilter__EBtlFadeFilter_MAX = 4
};


// Enum Arise.EBtlMoveType
enum class EBtlMoveType : uint8_t
{
	EBtlMoveType__MOVE_RUN         = 0,
	EBtlMoveType__MOVE_RUN_TARGET_LOCK = 1,
	EBtlMoveType__MOVE_WALK        = 2,
	EBtlMoveType__MOVE_WALK_TARGET_LOCK = 3,
	EBtlMoveType__MOVE_FLY         = 4,
	EBtlMoveType__MOVE_FLY_DIRECTION_LOCK = 5,
	EBtlMoveType__MOVE_FLY_TARGET_LOCK = 6,
	EBtlMoveType__MOVE_MAX         = 7
};


// Enum Arise.EBtlChangeGameScene
enum class EBtlChangeGameScene : uint8_t
{
	EBtlChangeGameScene__CHANGE_PREV_GAMESCENE = 0,
	EBtlChangeGameScene__CHANGE_TO_TITLE = 1,
	EBtlChangeGameScene__CHANGE_TO_PF = 2,
	EBtlChangeGameScene__CHANGE_TO_ENDING = 3,
	EBtlChangeGameScene__CHANGE_MAX = 4
};


// Enum Arise.EBtlArenaState
enum class EBtlArenaState : uint8_t
{
	EBtlArenaState__NONE           = 0,
	EBtlArenaState__ARENA_BTL      = 1,
	EBtlArenaState__ARENA_BTL01    = 2,
	EBtlArenaState__ARENA_BTL02    = 3,
	EBtlArenaState__ARENA_FINALIZE = 4,
	EBtlArenaState__EBtlArenaState_MAX = 5
};


// Enum Arise.EBtlTimeOperationPreProcessType
enum class EBtlTimeOperationPreProcessType : uint8_t
{
	EBtlTimeOperationPreProcessType__None = 0,
	EBtlTimeOperationPreProcessType__LastOperationAllClear = 1,
	EBtlTimeOperationPreProcessType__EBtlTimeOperationPreProcessType_MAX = 2
};


// Enum Arise.EBtlFacialType
enum class EBtlFacialType : uint8_t
{
	EBtlFacialType__DEFAULT        = 0,
	EBtlFacialType__DEAD           = 1,
	EBtlFacialType__DAMAGE         = 2,
	EBtlFacialType__ATTACK         = 3,
	EBtlFacialType__ATTACK_NO_VOICE = 4,
	EBtlFacialType__EBtlFacialType_MAX = 5
};


// Enum Arise.EBtlSurfaceParticleSize
enum class EBtlSurfaceParticleSize : uint8_t
{
	EBtlSurfaceParticleSize__SMALL = 0,
	EBtlSurfaceParticleSize__MIDDLE = 1,
	EBtlSurfaceParticleSize__BIG   = 2,
	EBtlSurfaceParticleSize__EBtlSurfaceParticleSize_MAX = 3
};


// Enum Arise.EBtlDestructibleParticleAction
enum class EBtlDestructibleParticleAction : uint8_t
{
	EBtlDestructibleParticleAction__None = 0,
	EBtlDestructibleParticleAction__Destory = 1,
	EBtlDestructibleParticleAction__EBtlDestructibleParticleAction_MAX = 2
};


// Enum Arise.EBtlDestructMeshFilter
enum class EBtlDestructMeshFilter : uint8_t
{
	EBtlDestructMeshFilter__NonDestruct = 0,
	EBtlDestructMeshFilter__PlayerParty_Level0 = 1,
	EBtlDestructMeshFilter__PlayerParty_Level1 = 2,
	EBtlDestructMeshFilter__PlayerParty_Level2 = 3,
	EBtlDestructMeshFilter__PlayerParty_Level3 = 4,
	EBtlDestructMeshFilter__PlayerParty_Level4 = 5,
	EBtlDestructMeshFilter__PlayerParty_Level5 = 6,
	EBtlDestructMeshFilter__PlayerParty_Level6 = 7,
	EBtlDestructMeshFilter__PlayerParty_Level7 = 8,
	EBtlDestructMeshFilter__PlayerParty_Level8 = 9,
	EBtlDestructMeshFilter__PlayerParty_Level9 = 10,
	EBtlDestructMeshFilter__EnemyParty_Level0 = 11,
	EBtlDestructMeshFilter__EnemyParty_Level1 = 12,
	EBtlDestructMeshFilter__EnemyParty_Level2 = 13,
	EBtlDestructMeshFilter__EnemyParty_Level3 = 14,
	EBtlDestructMeshFilter__EnemyParty_Level4 = 15,
	EBtlDestructMeshFilter__EnemyParty_Level5 = 16,
	EBtlDestructMeshFilter__EnemyParty_Level6 = 17,
	EBtlDestructMeshFilter__EnemyParty_Level7 = 18,
	EBtlDestructMeshFilter__EnemyParty_Level8 = 19,
	EBtlDestructMeshFilter__EnemyParty_Level9 = 20,
	EBtlDestructMeshFilter__AnyParty_Level0 = 21,
	EBtlDestructMeshFilter__AnyParty_Level1 = 22,
	EBtlDestructMeshFilter__AnyParty_Level2 = 23,
	EBtlDestructMeshFilter__AnyParty_Level3 = 24,
	EBtlDestructMeshFilter__AnyParty_Level4 = 25,
	EBtlDestructMeshFilter__AnyParty_Level5 = 26,
	EBtlDestructMeshFilter__AnyParty_Level6 = 27,
	EBtlDestructMeshFilter__AnyParty_Level7 = 28,
	EBtlDestructMeshFilter__AnyParty_Level8 = 29,
	EBtlDestructMeshFilter__AnyParty_Level9 = 30,
	EBtlDestructMeshFilter__EBtlDestructMeshFilter_MAX = 31
};


// Enum Arise.EBtlDestructFilterLevel
enum class EBtlDestructFilterLevel : uint8_t
{
	EBtlDestructFilterLevel__NonDestruct = 0,
	EBtlDestructFilterLevel__Level0 = 1,
	EBtlDestructFilterLevel__Level1 = 2,
	EBtlDestructFilterLevel__Level2 = 3,
	EBtlDestructFilterLevel__Level3 = 4,
	EBtlDestructFilterLevel__Level4 = 5,
	EBtlDestructFilterLevel__Level5 = 6,
	EBtlDestructFilterLevel__Level6 = 7,
	EBtlDestructFilterLevel__Level7 = 8,
	EBtlDestructFilterLevel__Level8 = 9,
	EBtlDestructFilterLevel__Level9 = 10,
	EBtlDestructFilterLevel__EBtlDestructFilterLevel_MAX = 11
};


// Enum Arise.EDestructibleType
enum class EDestructibleType : uint8_t
{
	EDestructibleType__NONE        = 0,
	EDestructibleType__SOFT_POWER  = 1,
	EDestructibleType__MIDDLE_POWER = 2,
	EDestructibleType__STRONG_POWER = 3,
	EDestructibleType__EDestructibleType_MAX = 4
};


// Enum Arise.EBtlSystemEffectRank
enum class EBtlSystemEffectRank : uint8_t
{
	EBtlSystemEffectRank__Default  = 0,
	EBtlSystemEffectRank__Upper    = 1,
	EBtlSystemEffectRank__Lower    = 2,
	EBtlSystemEffectRank__EBtlSystemEffectRank_MAX = 3
};


// Enum Arise.EBtlEffectType
enum class EBtlEffectType : uint8_t
{
	EBtlEffectType__Default        = 0,
	EBtlEffectType__HitEffect      = 1,
	EBtlEffectType__EBtlEffectType_MAX = 2
};


// Enum Arise.UBtlEncountEffectWidgetState
enum class EUBtlEncountEffectWidgetState : uint8_t
{
	UBtlEncountEffectWidgetState__None = 0,
	UBtlEncountEffectWidgetState__Start = 1,
	UBtlEncountEffectWidgetState__Loop = 2,
	UBtlEncountEffectWidgetState__End = 3,
	UBtlEncountEffectWidgetState__UBtlEncountEffectWidgetState_MAX = 4
};


// Enum Arise.EBtlFieldAreaDecalActor
enum class EBtlFieldAreaDecalActor : uint8_t
{
	EBtlFieldAreaDecalActor__Visible = 0,
	EBtlFieldAreaDecalActor__Invisible = 1,
	EBtlFieldAreaDecalActor__FadeIn = 2,
	EBtlFieldAreaDecalActor__FadeOut = 3,
	EBtlFieldAreaDecalActor__EBtlFieldAreaDecalActor_MAX = 4
};


// Enum Arise.EBtlFieldAreaDecal
enum class EBtlFieldAreaDecal : uint8_t
{
	EBtlFieldAreaDecal__Visible    = 0,
	EBtlFieldAreaDecal__Invisible  = 1,
	EBtlFieldAreaDecal__FadeIn     = 2,
	EBtlFieldAreaDecal__FadeOut    = 3,
	EBtlFieldAreaDecal__EBtlFieldAreaDecal_MAX = 4
};


// Enum Arise.EBtlKnockBackDirectionType
enum class EBtlKnockBackDirectionType : uint8_t
{
	EBtlKnockBackDirectionType__AttackUnitToTarget = 0,
	EBtlKnockBackDirectionType__AttackCollisionToTarget = 1,
	EBtlKnockBackDirectionType__TargetToAttackCollision = 2,
	EBtlKnockBackDirectionType__AttackUnitForward = 3,
	EBtlKnockBackDirectionType__EBtlKnockBackDirectionType_MAX = 4
};


// Enum Arise.EBtlLearnType_YRA
enum class EBtlLearnType_YRA : uint8_t
{
	EBtlLearnType_YRA__STICK       = 0,
	EBtlLearnType_YRA__MAGIC       = 1,
	EBtlLearnType_YRA__HEAL        = 2,
	EBtlLearnType_YRA__NONE        = 3,
	EBtlLearnType_YRA__EBtlLearnType_MAX = 4
};


// Enum Arise.EBtlLearnType_MNK
enum class EBtlLearnType_MNK : uint8_t
{
	EBtlLearnType_MNK__SHIELD      = 0,
	EBtlLearnType_MNK__HEAVY_ATTACK = 1,
	EBtlLearnType_MNK__COUNTER_ATTACK = 2,
	EBtlLearnType_MNK__NONE        = 3,
	EBtlLearnType_MNK__EBtlLearnType_MAX = 4
};


// Enum Arise.EBtlLearnType_ZGU
enum class EBtlLearnType_ZGU : uint8_t
{
	EBtlLearnType_ZGU__HAND        = 0,
	EBtlLearnType_ZGU__FOOT        = 1,
	EBtlLearnType_ZGU__KI          = 2,
	EBtlLearnType_ZGU__NONE        = 3,
	EBtlLearnType_ZGU__EBtlLearnType_MAX = 4
};


// Enum Arise.EBtlLearnType_NNA
enum class EBtlLearnType_NNA : uint8_t
{
	EBtlLearnType_NNA__LIGHT       = 0,
	EBtlLearnType_NNA__WIND        = 1,
	EBtlLearnType_NNA__WATER       = 2,
	EBtlLearnType_NNA__NONE        = 3,
	EBtlLearnType_NNA__EBtlLearnType_MAX = 4
};


// Enum Arise.EBtlLearnType_SIO
enum class EBtlLearnType_SIO : uint8_t
{
	EBtlLearnType_SIO__GUN         = 0,
	EBtlLearnType_SIO__BOMB        = 1,
	EBtlLearnType_SIO__HEAL        = 2,
	EBtlLearnType_SIO__NONE        = 3,
	EBtlLearnType_SIO__EBtlLearnType_MAX = 4
};


// Enum Arise.EBtlLearnType_ARI
enum class EBtlLearnType_ARI : uint8_t
{
	EBtlLearnType_ARI__SWORD       = 0,
	EBtlLearnType_ARI__AIR         = 1,
	EBtlLearnType_ARI__FIRE_SWORD  = 2,
	EBtlLearnType_ARI__NONE        = 3,
	EBtlLearnType_ARI__EBtlLearnType_MAX = 4
};


// Enum Arise.EBtlLearnType
enum class EBtlLearnType : uint8_t
{
	EBtlLearnType__NONE            = 0,
	EBtlLearnType__SWORD           = 1,
	EBtlLearnType__AIR             = 2,
	EBtlLearnType__FIRE_SWORD      = 3,
	EBtlLearnType__GUN             = 4,
	EBtlLearnType__BOMB            = 5,
	EBtlLearnType__HEAL            = 6,
	EBtlLearnType__LIGHT           = 7,
	EBtlLearnType__WIND            = 8,
	EBtlLearnType__WATER           = 9,
	EBtlLearnType__HAND            = 10,
	EBtlLearnType__FOOT            = 11,
	EBtlLearnType__KI              = 12,
	EBtlLearnType__SHIELD          = 13,
	EBtlLearnType__HEAVY_ATTACK    = 14,
	EBtlLearnType__COUNTER_ATTACK  = 15,
	EBtlLearnType__STICK           = 16,
	EBtlLearnType__MAGIC           = 17,
	EBtlLearnType__EBtlLearnType_MAX = 18
};


// Enum Arise.EBtlSmashRotateOption
enum class EBtlSmashRotateOption : uint8_t
{
	EBtlSmashRotateOption__ROTATE_PLAYER = 0,
	EBtlSmashRotateOption__ROTATE_FIX = 1,
	EBtlSmashRotateOption__ROTATE_MAX = 2
};


// Enum Arise.EBtlMagicCondition_TurnTargetType
enum class EBtlMagicCondition_TurnTargetType : uint8_t
{
	EBtlMagicCondition_TurnTargetType__EnableCorrectionCheck = 0,
	EBtlMagicCondition_TurnTargetType__DisableCorrectionCheck = 1,
	EBtlMagicCondition_TurnTargetType__ManualInputDisableCorrectionCheck = 2,
	EBtlMagicCondition_TurnTargetType__EBtlMagicCondition_MAX = 3
};


// Enum Arise.EBtlMagicConditionCategory
enum class EBtlMagicConditionCategory : uint8_t
{
	EBtlMagicConditionCategory__Collision = 0,
	EBtlMagicConditionCategory__Extra = 1,
	EBtlMagicConditionCategory__EBtlMagicConditionCategory_MAX = 2
};


// Enum Arise.EBtlMagicTaskCategory
enum class EBtlMagicTaskCategory : uint8_t
{
	EBtlMagicTaskCategory__Movement = 0,
	EBtlMagicTaskCategory__MovementFilter = 1,
	EBtlMagicTaskCategory__Position = 2,
	EBtlMagicTaskCategory__Rotation = 3,
	EBtlMagicTaskCategory__Collision = 4,
	EBtlMagicTaskCategory__Particle = 5,
	EBtlMagicTaskCategory__SpawnMagic = 6,
	EBtlMagicTaskCategory__Sound   = 7,
	EBtlMagicTaskCategory__Mesh    = 8,
	EBtlMagicTaskCategory__Development = 9,
	EBtlMagicTaskCategory__Extra   = 10,
	EBtlMagicTaskCategory__EBtlMagicTaskCategory_MAX = 11
};


// Enum Arise.EBtlMagicDestoryFlags
enum class EBtlMagicDestoryFlags : uint8_t
{
	EBtlMagicDestoryFlags__NoFlags = 0,
	EBtlMagicDestoryFlags__Down    = 1,
	EBtlMagicDestoryFlags__CutScene = 2,
	EBtlMagicDestoryFlags__UseAllFlags = 3,
	EBtlMagicDestoryFlags__DefaultFlags = 4,
	EBtlMagicDestoryFlags__EBtlMagicDestoryFlags_MAX = 5
};


// Enum Arise.EBtlMagicTickingGroup
enum class EBtlMagicTickingGroup : uint8_t
{
	EBtlMagicTickingGroup__Notify  = 0,
	EBtlMagicTickingGroup__NonDependence = 1,
	EBtlMagicTickingGroup__Movement = 2,
	EBtlMagicTickingGroup__MovementFilter = 3,
	EBtlMagicTickingGroup__PostMovement = 4,
	EBtlMagicTickingGroup__Rotation = 5,
	EBtlMagicTickingGroup__PostRotation = 6,
	EBtlMagicTickingGroup__Finalize = 7,
	EBtlMagicTickingGroup__EBtlMagicTickingGroup_MAX = 8
};


// Enum Arise.EBtlMagicVisiableAdjust
enum class EBtlMagicVisiableAdjust : uint8_t
{
	EBtlMagicVisiableAdjust__None  = 0,
	EBtlMagicVisiableAdjust__OwnerUnit = 1,
	EBtlMagicVisiableAdjust__TargetUnit = 2,
	EBtlMagicVisiableAdjust__EBtlMagicVisiableAdjust_MAX = 3
};


// Enum Arise.EBtlMagicRotationOrigin
enum class EBtlMagicRotationOrigin : uint8_t
{
	EBtlMagicRotationOrigin__World = 0,
	EBtlMagicRotationOrigin__SELF  = 1,
	EBtlMagicRotationOrigin__PARENT = 2,
	EBtlMagicRotationOrigin__OWNER = 3,
	EBtlMagicRotationOrigin__TARGET = 4,
	EBtlMagicRotationOrigin__SELF_TO_TARGET = 5,
	EBtlMagicRotationOrigin__TARGET_TO_SELF = 6,
	EBtlMagicRotationOrigin__EBtlMagicRotationOrigin_MAX = 7
};


// Enum Arise.EBtlMagicRotationType
enum class EBtlMagicRotationType : uint8_t
{
	EBtlMagicRotationType__ROTATION_OWNER = 0,
	EBtlMagicRotationType__ROTATION_TARGET = 1,
	EBtlMagicRotationType__ROTATION_OWNER_SOCKET = 2,
	EBtlMagicRotationType__ROTATION_TARGET_SOCKET = 3,
	EBtlMagicRotationType__ROTATION_MAGIC = 4,
	EBtlMagicRotationType__ROTATION_WORLD = 5,
	EBtlMagicRotationType__ROTATION_MAX = 6
};


// Enum Arise.EBtlMagicLocationType
enum class EBtlMagicLocationType : uint8_t
{
	EBtlMagicLocationType__LOCATION_OWNER = 0,
	EBtlMagicLocationType__LOCATION_TARGET = 1,
	EBtlMagicLocationType__LOCATION_OWNER_SOCKET = 2,
	EBtlMagicLocationType__LOCATION_TARGET_SOCKET = 3,
	EBtlMagicLocationType__LOCATION_MAGIC = 4,
	EBtlMagicLocationType__LOCATION_WORLD = 5,
	EBtlMagicLocationType__LOCATION_MAX = 6
};


// Enum Arise.EBtlMagicSpawnCandidateTarget
enum class EBtlMagicSpawnCandidateTarget : uint8_t
{
	EBtlMagicSpawnCandidateTarget__PARENT_MAGIC = 0,
	EBtlMagicSpawnCandidateTarget__OWNER_UNIT_TARGET = 1,
	EBtlMagicSpawnCandidateTarget__EBtlMagicSpawnCandidateTarget_MAX = 2
};


// Enum Arise.EBtlMagicTaskAbortType
enum class EBtlMagicTaskAbortType : uint8_t
{
	EBtlMagicTaskAbortType__SelfOnly = 0,
	EBtlMagicTaskAbortType__ChildAll = 1,
	EBtlMagicTaskAbortType__All    = 2,
	EBtlMagicTaskAbortType__EBtlMagicTaskAbortType_MAX = 3
};


// Enum Arise.EBtlParameterType
enum class EBtlParameterType : uint8_t
{
	EBtlParameterType__Basic       = 0,
	EBtlParameterType__Skill       = 1,
	EBtlParameterType__EBtlParameterType_MAX = 2
};


// Enum Arise.EBtl_NPC_VISMode
enum class EBtl_NPC_VISMode : uint8_t
{
	EBtl_NPC_VISMode__Default      = 0,
	EBtl_NPC_VISMode__ForceTrue    = 1,
	EBtl_NPC_VISMode__ForceFalse   = 2,
	EBtl_NPC_VISMode__MAX          = 3
};


// Enum Arise.EBtlDeveloperSettingsLoadType
enum class EBtlDeveloperSettingsLoadType : uint8_t
{
	EBtlDeveloperSettingsLoadType__Default = 0,
	EBtlDeveloperSettingsLoadType__Minimal = 1,
	EBtlDeveloperSettingsLoadType__PartyLearn_EnemyAll = 2,
	EBtlDeveloperSettingsLoadType__PartyOnly = 3,
	EBtlDeveloperSettingsLoadType__PartyLearnOnly = 4,
	EBtlDeveloperSettingsLoadType__EBtlDeveloperSettingsLoadType_MAX = 5
};


// Enum Arise.ERunawayPhase
enum class ERunawayPhase : uint8_t
{
	ERunawayPhase__None            = 0,
	ERunawayPhase__Runaway         = 1,
	ERunawayPhase__Successful      = 2,
	ERunawayPhase__ERunawayPhase_MAX = 3
};


// Enum Arise.EBattleStateAction
enum class EBattleStateAction : uint8_t
{
	EBattleStateAction__None       = 0,
	EBattleStateAction__Initialize = 1,
	EBattleStateAction__WaitComplete = 2,
	EBattleStateAction__Activate   = 3,
	EBattleStateAction__Execute    = 4,
	EBattleStateAction__Finalize   = 5,
	EBattleStateAction__WaitFinalize = 6,
	EBattleStateAction__EBattleStateAction_MAX = 7
};


// Enum Arise.EBtlTimeDilationCategory
enum class EBtlTimeDilationCategory : uint8_t
{
	EBtlTimeDilationCategory__Default = 0,
	EBtlTimeDilationCategory__FlashRaid = 1,
	EBtlTimeDilationCategory__HitStop = 2,
	EBtlTimeDilationCategory__EBtlTimeDilationCategory_MAX = 3
};


// Enum Arise.EBtlUnitEventType
enum class EBtlUnitEventType : uint8_t
{
	EBtlUnitEventType__ARI_FIRE_STATE_CHANGED = 0,
	EBtlUnitEventType__SIO_BULLET_COUNT_CHANGED = 1,
	EBtlUnitEventType__NNA_STOCK_CHANGED = 2,
	EBtlUnitEventType__NNA_MAGIC_CANCELE_RESERVED = 3,
	EBtlUnitEventType__ZGU_AWAKE_RANK_CHANGED = 4,
	EBtlUnitEventType__MNK_GUARD_IGNITION_RANK_CHANGED = 5,
	EBtlUnitEventType__MNK_GUARD_IGNITION_STATUS_CHANGED = 6,
	EBtlUnitEventType__YRA_EXTENSION_RANK_CHANGED = 7,
	EBtlUnitEventType__SPELL_SKIPPED = 8,
	EBtlUnitEventType__Num         = 9,
	EBtlUnitEventType__EBtlUnitEventType_MAX = 10
};


// Enum Arise.EAriseSkillEffectScope
enum class EAriseSkillEffectScope : uint8_t
{
	EAriseSkillEffectScope__Staying = 0,
	EAriseSkillEffectScope__BattleOnly = 1,
	EAriseSkillEffectScope__EAriseSkillEffectScope_MAX = 2
};


// Enum Arise.EAriseSkillSupportUnit
enum class EAriseSkillSupportUnit : uint8_t
{
	EAriseSkillSupportUnit__Invalid = 0,
	EAriseSkillSupportUnit__SHARED = 1,
	EAriseSkillSupportUnit__ARI    = 2,
	EAriseSkillSupportUnit__SIO    = 3,
	EAriseSkillSupportUnit__NNA    = 4,
	EAriseSkillSupportUnit__ZGU    = 5,
	EAriseSkillSupportUnit__MNK    = 6,
	EAriseSkillSupportUnit__YRA    = 7,
	EAriseSkillSupportUnit__ARI_MNK = 8,
	EAriseSkillSupportUnit__PARTY  = 9,
	EAriseSkillSupportUnit__RESIDENT = 10,
	EAriseSkillSupportUnit__ENEMY  = 11,
	EAriseSkillSupportUnit__ALL    = 12,
	EAriseSkillSupportUnit__EAriseSkillSupportUnit_MAX = 13
};


// Enum Arise.EBtlVoiceRelationship
enum class EBtlVoiceRelationship : uint8_t
{
	EBtlVoiceRelationship__NON     = 0,
	EBtlVoiceRelationship__SYS     = 1,
	EBtlVoiceRelationship__SB1     = 2,
	EBtlVoiceRelationship__SB2     = 3,
	EBtlVoiceRelationship__UQ1     = 4,
	EBtlVoiceRelationship__UQ2     = 5,
	EBtlVoiceRelationship__SPC     = 6,
	EBtlVoiceRelationship__SB3     = 7,
	EBtlVoiceRelationship__EBtlVoiceRelationship_MAX = 8
};


// Enum Arise.ECharacterCapturePose
enum class ECharacterCapturePose : uint8_t
{
	CCP_BasePose                   = 0,
	CCP_MAX                        = 1
};


// Enum Arise.EHelpCategory
enum class EHelpCategory : uint8_t
{
	EHelpCategory__System          = 0,
	EHelpCategory__Battle          = 1,
	EHelpCategory__EHelpCategory_MAX = 2
};


// Enum Arise.EColKEYCategoryType
enum class EColKEYCategoryType : uint8_t
{
	EColKEYCategoryType__CATEGORY000 = 0,
	EColKEYCategoryType__CATEGORY001 = 1,
	EColKEYCategoryType__CATEGORY002 = 2,
	EColKEYCategoryType__EColKEYCategoryType_MAX = 3
};


// Enum Arise.EConfigKey
enum class EConfigKey : uint8_t
{
	EConfigKey__CONFIG_SCREEN_MODE = 0,
	EConfigKey__CONFIG_RESOLUTION  = 1,
	EConfigKey__CONFIG_VERTIAL_SYNC = 2,
	EConfigKey__CONFIG_FRAMERATE_LIMIT = 3,
	EConfigKey__CONFIG_BLOOM       = 4,
	EConfigKey__CONFIG_MOTION_BLUR = 5,
	EConfigKey__CONFIG_DRAW_SCALE  = 6,
	EConfigKey__CONFIG_DRAW_DISTANCE_NPC = 7,
	EConfigKey__CONFIG_DRAW_DISTANCE_OBJECT = 8,
	EConfigKey__CONFIG_DRAW_DISTANCE_GRASS = 9,
	EConfigKey__CONFIG_ANTIALIASING = 10,
	EConfigKey__CONFIG_SHADOW_QUALITY = 11,
	EConfigKey__CONFIG_TEXTURE_QUALITY = 12,
	EConfigKey__CONFIG_EFFECT_QUALITY = 13,
	EConfigKey__CONFIG_POSTPROCESS_QUALITY = 14,
	EConfigKey__CONFIG_SCREEN_SPACE_REFLECTION = 15,
	EConfigKey__CONFIG_OCCLUSION_CULLING = 16,
	EConfigKey__CONFIG_ANISOTROPY_FILTERING = 17,
	EConfigKey__CONFIG_FONT_SIZE   = 18,
	EConfigKey__CONFIG_DIFFICULTY_LEVEL = 19,
	EConfigKey__CONFIG_PRECEDING_INPUT_TIME = 20,
	EConfigKey__CONFIG_CONTROLLER_VIBRATION = 21,
	EConfigKey__CONFIG_NAVIMAP_ROTATION = 22,
	EConfigKey__CONFIG_QUEST_MARKER_MAIN = 23,
	EConfigKey__CONFIG_QUEST_MARKER_SUB = 24,
	EConfigKey__CONFIG_SUBTITLE_DISPLAY = 25,
	EConfigKey__CONFIG_BTL_CAMERA_SPEED = 26,
	EConfigKey__CONFIG_PF_CAMERA_SPEED = 27,
	EConfigKey__CONFIG_PF_CAMERA_YAW = 28,
	EConfigKey__CONFIG_PF_CAMERA_PITCH = 29,
	EConfigKey__CONFIG_KEY_CONFIGURATION = 30,
	EConfigKey__CONFIG_LIGHT_ADJUST = 31,
	EConfigKey__CONFIG_ANALYSIS_CONFIGURATION = 32,
	EConfigKey__CONFIG_SOUND_OUTPUT = 33,
	EConfigKey__CONFIG_BGM_VOLUME  = 34,
	EConfigKey__CONFIG_SE_VOLUME   = 35,
	EConfigKey__CONFIG_VOICE_VOLUME = 36,
	EConfigKey__CONFIG_BTL_BGM     = 37,
	EConfigKey__CONFIG_BTL_BGM_DETAILED = 38,
	EConfigKey__CONFIG_INITIAL_SETTING = 39,
	EConfigKey__CONFIG_AMBIENT_OCCLUSION = 40,
	EConfigKey__CONFIG_VOLUMETRIC_LIGHTING = 41,
	EConfigKey__CONFIG_SCREEN_SPACE_SHADOW = 42,
	EConfigKey__CONFIG_GLOBAL_ILLUMINATION = 43,
	EConfigKey__CONFIG_DEPTH_OF_FIELD = 44,
	EConfigKey__CONFIG_LIGHT_SETTING = 45,
	EConfigKey__CONFIG_BTL_BGM_SETTING = 46,
	EConfigKey__CONFIG_GRAPHIC     = 47,
	EConfigKey__CONFIG_GRAPHIC_INITIAL_SETTING = 48,
	EConfigKey__CONFIG_CONTROLLER_CONFIGURATOR = 49,
	EConfigKey__CONFIG_BTL_CAMERA_CORRECTION_ATTACK = 50,
	EConfigKey__CONFIG_BTL_CAMERA_CORRECTION_MOVE = 51,
	EConfigKey__CONFIG_BTL_CAMERA_AUTO_UNLOCK = 52,
	EConfigKey__CONFIG_MENU_TEXTURE_QUALITY = 53,
	EConfigKey__TYPE_MAX           = 54,
	EConfigKey__EConfigKey_MAX     = 55
};


// Enum Arise.ESetting
enum class ESetting : uint8_t
{
	ESetting__CHOICE               = 0,
	ESetting__INT                  = 1,
	ESetting__CHECKBOX             = 2,
	ESetting__GAUGE                = 3,
	ESetting__SCENE_CHANGE         = 4,
	ESetting__INITIAL              = 5,
	ESetting__ANALYSIS             = 6,
	ESetting__TYPE_MAX             = 7,
	ESetting__ESetting_MAX         = 8
};


// Enum Arise.EConfigCategory
enum class EConfigCategory : uint8_t
{
	EConfigCategory__GRAPHICS      = 0,
	EConfigCategory__GAME          = 1,
	EConfigCategory__LIGHT_SETTING = 2,
	EConfigCategory__BTL_BGM_SETTING = 3,
	EConfigCategory__TYPE_MAX      = 4,
	EConfigCategory__EConfigCategory_MAX = 5
};


// Enum Arise.EEncountSymbolState
enum class EEncountSymbolState : uint8_t
{
	EEncountSymbolState__ENCSYM_NONE = 0,
	EEncountSymbolState__ENCSYM_SLEEP = 1,
	EEncountSymbolState__ENCSYM_ACTIVE = 2,
	EEncountSymbolState__ENCSYM_ENCOUNT = 3,
	EEncountSymbolState__ENCSYM_MAX = 4
};


// Enum Arise.EEnSymGroupActiveCondision
enum class EEnSymGroupActiveCondision : uint8_t
{
	EEnSymGroupActiveCondision__Always = 0,
	EEnSymGroupActiveCondision__Noon = 1,
	EEnSymGroupActiveCondision__Night = 2,
	EEnSymGroupActiveCondision__EEnSymGroupActiveCondision_MAX = 3
};


// Enum Arise.EULA_Language
enum class EULA_Language : uint8_t
{
	EULA_Language__JPN             = 0,
	EULA_Language__ENG             = 1,
	EULA_Language__BRP             = 2,
	EULA_Language__NSP             = 3,
	EULA_Language__FRA             = 4,
	EULA_Language__ITA             = 5,
	EULA_Language__GER             = 6,
	EULA_Language__ESP             = 7,
	EULA_Language__RUS             = 8,
	EULA_Language__TC              = 9,
	EULA_Language__KOR             = 10,
	EULA_Language__EULA_MAX        = 11
};


// Enum Arise.EEventAssetType
enum class EEventAssetType : uint8_t
{
	EEventAssetType__Asset_LevelSequencerLoaded = 0,
	EEventAssetType__Asset_LevelSequencerManualLoad = 1,
	EEventAssetType__Asset_StreamLevelManualLoad = 2,
	EEventAssetType__Asset_PlayLongChat = 3,
	EEventAssetType__Asset_PlayMovie = 4,
	EEventAssetType__Asset_EmptyEvent = 5,
	EEventAssetType__Asset_MAX     = 6
};


// Enum Arise.EEventCategory
enum class EEventCategory : uint8_t
{
	EEventCategory__MEP            = 0,
	EEventCategory__SUB            = 1,
	EEventCategory__LCH            = 2,
	EEventCategory__SBQ            = 3,
	EEventCategory__SYS            = 4,
	EEventCategory__DBG            = 5,
	EEventCategory__EEventCategory_MAX = 6
};


// Enum Arise.EEventStreamLoadingState
enum class EEventStreamLoadingState : uint8_t
{
	EEventStreamLoadingState__ESLS_None = 0,
	EEventStreamLoadingState__ESLS_Loading = 1,
	EEventStreamLoadingState__ESLS_Loaded = 2,
	EEventStreamLoadingState__ESLS_Unloading = 3,
	EEventStreamLoadingState__ESLS_Unloaded = 4,
	EEventStreamLoadingState__ESLS_MAX = 5
};


// Enum Arise.EEventPlayState
enum class EEventPlayState : uint8_t
{
	EEventPlayState__EVST_Standby  = 0,
	EEventPlayState__EVST_WaitLoading = 1,
	EEventPlayState__EVST_Loaded   = 2,
	EEventPlayState__EVST_PreFade  = 3,
	EEventPlayState__EVST_PlayingSequencer = 4,
	EEventPlayState__EVST_PlayingLongchat = 5,
	EEventPlayState__EVST_PlayingMovie = 6,
	EEventPlayState__EVST_PlayEnd  = 7,
	EEventPlayState__EVST_PostFade = 8,
	EEventPlayState__EVST_LoadingScript = 9,
	EEventPlayState__EVST_RunScript = 10,
	EEventPlayState__EVST_ErrorEnd = 11,
	EEventPlayState__EVST_MAX      = 12
};


// Enum Arise.EEventType
enum class EEventType : uint8_t
{
	EEventType__BC                 = 0,
	EEventType__PF                 = 1,
	EEventType__MV                 = 2,
	EEventType__AN                 = 3,
	EEventType__S                  = 4,
	EEventType__A                  = 5,
	EEventType__B1                 = 6,
	EEventType__B2                 = 7,
	EEventType__NLC                = 8,
	EEventType__LC                 = 9,
	EEventType__SC                 = 10,
	EEventType__BT                 = 11,
	EEventType__EEventType_MAX     = 12
};


// Enum Arise.EFadeMusic
enum class EFadeMusic : uint8_t
{
	EFadeMusic__None               = 0,
	EFadeMusic__FadeIn             = 1,
	EFadeMusic__FadeOut            = 2,
	EFadeMusic__DuckIn             = 3,
	EFadeMusic__DuckOut            = 4,
	EFadeMusic__EFadeMusic_MAX     = 5
};


// Enum Arise.EFishingSE
enum class EFishingSE : uint8_t
{
	EFishingSE__SE_SYS_FISHING_PUSH = 0,
	EFishingSE__SE_SYS_FISHING_GOOD = 1,
	EFishingSE__SE_SYS_FISHING_EXCELLENT = 2,
	EFishingSE__SE_SYS_FISHING_BAD = 3,
	EFishingSE__SE_SYS_FISHING_QTE_ON = 4,
	EFishingSE__SE_SYS_FISHING_QTE_SUCCESS = 5,
	EFishingSE__SE_SYS_FISHING_DAMAGE_01 = 6,
	EFishingSE__SE_SYS_FISHING_DAMAGE_02 = 7,
	EFishingSE__SE_SYS_FISHING_DANGER = 8,
	EFishingSE__SE_SYS_FISHING_GET_UNCOMMON = 9,
	EFishingSE__SE_SYS_FISHING_GET = 10,
	EFishingSE__SE_SYS_FISHING_STAR = 11,
	EFishingSE__SE_FOL_FISHING_SWING = 12,
	EFishingSE__SE_FOL_FISHING_LINE = 13,
	EFishingSE__SE_FOL_FISHING_REEL_LOOP = 14,
	EFishingSE__SE_FOL_FISHING_REEL_01 = 15,
	EFishingSE__SE_FOL_FISHING_SPLASH_OUT_S_01 = 16,
	EFishingSE__SE_FOL_FISHING_SPLASH_OUT_S_02 = 17,
	EFishingSE__SE_FOL_FISHING_SPLASH_OUT_S_03 = 18,
	EFishingSE__SE_FOL_FISHING_SPLASH_OUT_L_01 = 19,
	EFishingSE__SE_FOL_FISHING_SPLASH_OUT_L_02 = 20,
	EFishingSE__SE_FOL_FISHING_SPLASH_OUT_L_03 = 21,
	EFishingSE__SE_FOL_FISHING_SPLASH_IN_S_01 = 22,
	EFishingSE__SE_FOL_FISHING_SPLASH_IN_S_02 = 23,
	EFishingSE__SE_FOL_FISHING_SPLASH_IN_S_03 = 24,
	EFishingSE__SE_FOL_FISHING_SPLASH_IN_L_01 = 25,
	EFishingSE__SE_FOL_FISHING_SPLASH_IN_L_02 = 26,
	EFishingSE__SE_FOL_FISHING_SPLASH_IN_L_03 = 27,
	EFishingSE__SE_FOL_FISHING_FISH_SWIM_01 = 28,
	EFishingSE__SE_FOL_FISING_FISH_MOVE_01 = 29,
	EFishingSE__FISHING_SE_MAX     = 30,
	EFishingSE__EFishingSE_MAX     = 31
};


// Enum Arise.EFishScScene
enum class EFishScScene : uint8_t
{
	EFishScScene__FisSCScenePreCast = 0,
	EFishScScene__FisSCScenePreCastRe = 1,
	EFishScScene__FisSCSceneCasting = 2,
	EFishScScene__FisSCScenePickup = 3,
	EFishScScene__FisSCSceneHooking = 4,
	EFishScScene__FisSCSceneFighting = 5,
	EFishScScene__FisSCSceneHookout = 6,
	EFishScScene__FisSCSceneResult = 7,
	EFishScScene__FisSCSceneResultRe = 8,
	EFishScScene__FisSCSceneSizeEval = 9,
	EFishScScene__FisSCSceneSizeEvalRe = 10,
	EFishScScene__EFishScScene_MAX = 11
};


// Enum Arise.ELureAction
enum class ELureAction : uint8_t
{
	ELureAction__LureActPause      = 0,
	ELureAction__LureActReel       = 1,
	ELureAction__LureActTwich      = 2,
	ELureAction__LureActJark       = 3,
	ELureAction__ELureAction_MAX   = 4
};


// Enum Arise.ELureType
enum class ELureType : uint8_t
{
	ELureType__LurePopper          = 0,
	ELureType__LurePencil          = 1,
	ELureType__LureMinnow          = 2,
	ELureType__LureCrank           = 3,
	ELureType__LureVibration       = 4,
	ELureType__LureMetal           = 5,
	ELureType__ELureType_MAX       = 6
};


// Enum Arise.EFishType
enum class EFishType : uint8_t
{
	EFishType__FISH_NONE           = 0,
	EFishType__FISH_001            = 1,
	EFishType__FISH_002            = 2,
	EFishType__FISH_003            = 3,
	EFishType__FISH_004            = 4,
	EFishType__FISH_005            = 5,
	EFishType__FISH_006            = 6,
	EFishType__FISH_007            = 7,
	EFishType__FISH_008            = 8,
	EFishType__FISH_009            = 9,
	EFishType__FISH_010            = 10,
	EFishType__FISH_011            = 11,
	EFishType__FISH_012            = 12,
	EFishType__FISH_013            = 13,
	EFishType__FISH_014            = 14,
	EFishType__FISH_015            = 15,
	EFishType__FISH_016            = 16,
	EFishType__FISH_017            = 17,
	EFishType__FISH_018            = 18,
	EFishType__FISH_019            = 19,
	EFishType__FISH_020            = 20,
	EFishType__FISH_021            = 21,
	EFishType__FISH_022            = 22,
	EFishType__FISH_023            = 23,
	EFishType__FISH_024            = 24,
	EFishType__FISH_025            = 25,
	EFishType__FISH_026            = 26,
	EFishType__FISH_027            = 27,
	EFishType__FISH_028            = 28,
	EFishType__FISH_029            = 29,
	EFishType__FISH_030            = 30,
	EFishType__FISH_031            = 31,
	EFishType__FISH_032            = 32,
	EFishType__FISH_033            = 33,
	EFishType__FISH_034            = 34,
	EFishType__FISH_035            = 35,
	EFishType__FISH_036            = 36,
	EFishType__FISH_037            = 37,
	EFishType__FISH_038            = 38,
	EFishType__FISH_039            = 39,
	EFishType__FISH_040            = 40,
	EFishType__FISH_041            = 41,
	EFishType__FISH_042            = 42,
	EFishType__FISH_043            = 43,
	EFishType__FISH_044            = 44,
	EFishType__FISH_045            = 45,
	EFishType__FISH_046            = 46,
	EFishType__FISH_047            = 47,
	EFishType__FISH_048            = 48,
	EFishType__FISH_049            = 49,
	EFishType__FISH_050            = 50,
	EFishType__FISH_MAX            = 51
};


// Enum Arise.EFishingHotSpotType
enum class EFishingHotSpotType : uint8_t
{
	EFishingHotSpotType__StaticPoint = 0,
	EFishingHotSpotType__DynamicPoint = 1,
	EFishingHotSpotType__EFishingHotSpotType_MAX = 2
};


// Enum Arise.EFunctionMountState
enum class EFunctionMountState : uint8_t
{
	EFunctionMountState__UnMount   = 0,
	EFunctionMountState__UnMounting = 1,
	EFunctionMountState__Mount     = 2,
	EFunctionMountState__Mounting  = 3,
	EFunctionMountState__EFunctionMountState_MAX = 4
};


// Enum Arise.EGCManagerCondition
enum class EGCManagerCondition : uint8_t
{
	EGCManagerCondition__UsedRelativeBaseline = 0,
	EGCManagerCondition__FreeAbsolute = 1,
	EGCManagerCondition__EGCManagerCondition_MAX = 2
};


// Enum Arise.EGCManagerUsage
enum class EGCManagerUsage : uint8_t
{
	EGCManagerUsage__GUI           = 0,
	EGCManagerUsage__PF            = 1,
	EGCManagerUsage__USAGE_MAX     = 2,
	EGCManagerUsage__EGCManagerUsage_MAX = 3
};


// Enum Arise.EItemIconTypeList
enum class EItemIconTypeList : uint8_t
{
	EItemIconTypeList__NONE        = 0,
	EItemIconTypeList__DLC         = 1,
	EItemIconTypeList__GUMMI       = 2,
	EItemIconTypeList__BOTTLE      = 3,
	EItemIconTypeList__MATERIAL    = 4,
	EItemIconTypeList__ACCESSORY   = 5,
	EItemIconTypeList__SWORD       = 6,
	EItemIconTypeList__RIFFLE      = 7,
	EItemIconTypeList__BOOK        = 8,
	EItemIconTypeList__GAUNTLET    = 9,
	EItemIconTypeList__SHIELD      = 10,
	EItemIconTypeList__ROD         = 11,
	EItemIconTypeList__ARU         = 12,
	EItemIconTypeList__SIO         = 13,
	EItemIconTypeList__RIN         = 14,
	EItemIconTypeList__ROU         = 15,
	EItemIconTypeList__KIS         = 16,
	EItemIconTypeList__TYU         = 17,
	EItemIconTypeList__BANGLE      = 18,
	EItemIconTypeList__CHECK       = 19,
	EItemIconTypeList__TALISMAN    = 20,
	EItemIconTypeList__EARRING     = 21,
	EItemIconTypeList__NECKLACE    = 22,
	EItemIconTypeList__RING        = 23,
	EItemIconTypeList__MIRACLE     = 24,
	EItemIconTypeList__COSTUME     = 25,
	EItemIconTypeList__HAIR        = 26,
	EItemIconTypeList__ATTACHMENT  = 27,
	EItemIconTypeList__VALUE       = 28,
	EItemIconTypeList__LEAF        = 29,
	EItemIconTypeList__GRAIN       = 30,
	EItemIconTypeList__VEGGIE      = 31,
	EItemIconTypeList__FRUIT       = 32,
	EItemIconTypeList__DAIRYPRODUCT = 33,
	EItemIconTypeList__MEAT        = 34,
	EItemIconTypeList__SEAFOOD     = 35,
	EItemIconTypeList__MUSHROOM    = 36,
	EItemIconTypeList__SEASONING   = 37,
	EItemIconTypeList__OTHER       = 38,
	EItemIconTypeList__TPJIZO      = 39,
	EItemIconTypeList__POSTCARD    = 40,
	EItemIconTypeList__PIECE       = 41,
	EItemIconTypeList__STATUE      = 42,
	EItemIconTypeList__ANIMAL      = 43,
	EItemIconTypeList__SUBHUM      = 44,
	EItemIconTypeList__INSECT      = 45,
	EItemIconTypeList__NATURE      = 46,
	EItemIconTypeList__WINGED      = 47,
	EItemIconTypeList__DEABLO      = 48,
	EItemIconTypeList__SOLDIER     = 49,
	EItemIconTypeList__SUNDRIES    = 50,
	EItemIconTypeList__RECIPE      = 51,
	EItemIconTypeList__CASH        = 52,
	EItemIconTypeList__FISHING_ROD = 53,
	EItemIconTypeList__LURE        = 54,
	EItemIconTypeList__ARTIFACT    = 55,
	EItemIconTypeList__EItemIconTypeList_MAX = 56
};


// Enum Arise.EItemMaxNum
enum class EItemMaxNum : uint8_t
{
	EItemMaxNum__MAXNUM_NONE       = 0,
	EItemMaxNum__MAXNUM            = 1,
	EItemMaxNum__MAXNUM01          = 2,
	EItemMaxNum__MAXNUM02          = 3,
	EItemMaxNum__MAXNUM03          = 4,
	EItemMaxNum__MAXNUM04          = 5,
	EItemMaxNum__MAXNUM_MAX        = 6
};


// Enum Arise.EItemParameter
enum class EItemParameter : uint8_t
{
	EItemParameter__NONE           = 0,
	EItemParameter__HEAL_HP        = 1,
	EItemParameter__HEAL_ALL_HP    = 2,
	EItemParameter__UP_MAX_HP      = 3,
	EItemParameter__RECOVERY       = 4,
	EItemParameter__REVIVE         = 5,
	EItemParameter__GROW_HP        = 6,
	EItemParameter__GROW_PHYSICAL_OFFENSE = 7,
	EItemParameter__GROW_PHYSICAL_DEFENSE = 8,
	EItemParameter__GROW_ELEMENTAL_OFFENSE = 9,
	EItemParameter__GROW_ELEMENTAL_DEFENSE = 10,
	EItemParameter__GROW_PENETRATABILITY = 11,
	EItemParameter__UP_PHYSICAL_OFFENSE = 12,
	EItemParameter__UP_PHYSICAL_DEFENSE = 13,
	EItemParameter__UP_ELEMENTAL_OFFENSE = 14,
	EItemParameter__UP_ELEMENTAL_DEFENSE = 15,
	EItemParameter__UP_PENETRATABILITY = 16,
	EItemParameter__DEF_FILE       = 17,
	EItemParameter__SE_FILE        = 18,
	EItemParameter__BGM_FILE       = 19,
	EItemParameter__HOLY_BOTTLE    = 20,
	EItemParameter__DARK_BOTTLE    = 21,
	EItemParameter__HEAL_TP        = 22,
	EItemParameter__GROW_TP        = 23,
	EItemParameter__GROW_SP        = 24,
	EItemParameter__GROW_DURABILITY = 25,
	EItemParameter__UP_DURABILITY  = 26,
	EItemParameter__PRICE_BUY      = 27,
	EItemParameter__PRICE_SELL     = 28,
	EItemParameter__SPIRIT_BOTTLE  = 29,
	EItemParameter__INGREDIENT_STATUS = 30,
	EItemParameter__RAIRTY         = 31,
	EItemParameter__DISH_COST      = 32,
	EItemParameter__MATERIAL_TYPE  = 33,
	EItemParameter__MATERIAL_ELEMENTAL = 34,
	EItemParameter__ACCESSORY_TYPE = 35,
	EItemParameter__ACCESSORY_SLOT = 36,
	EItemParameter__DLC_ID         = 37,
	EItemParameter__STATUE_NEEDAMOUNT = 38,
	EItemParameter__ATTACHED_CHAR  = 39,
	EItemParameter__ATTACHED_ID    = 40,
	EItemParameter__HEAL_ALL_HP_PERCENTAGE = 41,
	EItemParameter__RANDOM_SKILL_RAIRTY = 42,
	EItemParameter__SKILL_ID       = 43,
	EItemParameter__RANDOM_SKILL_RAIRTY_DIRECT = 44,
	EItemParameter__ENABLE_SBF     = 45,
	EItemParameter__JUDGE_CORRECTION = 46,
	EItemParameter__DAMAGE_TO_FISH = 47,
	EItemParameter__TENSION_CORRECTION = 48,
	EItemParameter__RARITY_CORRECTION = 49,
	EItemParameter__LURE_SCORE     = 50,
	EItemParameter__LURE_TYPE      = 51,
	EItemParameter__ACCESSORY_CATEGORY = 52,
	EItemParameter__VISUALDB_LABEL = 53,
	EItemParameter__RANDOM_SKILL_RAIRTY_FIX = 54,
	EItemParameter__LURE_TARGET1   = 55,
	EItemParameter__LURE_TARGET2   = 56,
	EItemParameter__LURE_TARGET3   = 57,
	EItemParameter__LURE_TARGET4   = 58,
	EItemParameter__SHARE_PROTECTED = 59,
	EItemParameter__ALL_PARTY_BASE_HP_UP = 60,
	EItemParameter__ALL_PARTY_LEVEL_UP = 61,
	EItemParameter__EItemParameter_MAX = 62
};


// Enum Arise.EItemCategory
enum class EItemCategory : uint8_t
{
	EItemCategory__NONE            = 0,
	EItemCategory__TOOL            = 1,
	EItemCategory__MATERIAL        = 2,
	EItemCategory__WEAPON          = 3,
	EItemCategory__ARMOR           = 4,
	EItemCategory__ACCESSORY       = 5,
	EItemCategory__VALUE           = 6,
	EItemCategory__COSTUME         = 7,
	EItemCategory__DLC             = 8,
	EItemCategory__COOK            = 9,
	EItemCategory__OTHER           = 10,
	EItemCategory__UNIQUE          = 11,
	EItemCategory__EItemCategory_MAX = 12
};


// Enum Arise.EItemParamStrIndex
enum class EItemParamStrIndex : uint8_t
{
	EItemParamStrIndex__ITEM_PARAM = 0,
	EItemParamStrIndex__ITEM_PARAM01 = 1,
	EItemParamStrIndex__ITEM_PARAM_MAX = 2
};


// Enum Arise.EItemParamValueIndex
enum class EItemParamValueIndex : uint8_t
{
	EItemParamValueIndex__ITEM_PARAM = 0,
	EItemParamValueIndex__ITEM_PARAM01 = 1,
	EItemParamValueIndex__ITEM_PARAM02 = 2,
	EItemParamValueIndex__ITEM_PARAM03 = 3,
	EItemParamValueIndex__ITEM_PARAM_MAX = 4
};


// Enum Arise.EItemUnusedType
enum class EItemUnusedType : uint8_t
{
	EItemUnusedType__ITEM_UNUSED_NONE = 0,
	EItemUnusedType__ITEM_UNUSED_HP_MAX = 1,
	EItemUnusedType__ITEM_UNUSED_SP_MAX = 2,
	EItemUnusedType__ITEM_UNUSED_TP_MAX = 3,
	EItemUnusedType__ITEM_UNUSED_DEAD = 4,
	EItemUnusedType__ITEM_UNUSED_NO_DEAD = 5,
	EItemUnusedType__ITEM_UNUSED_ABNORMAL = 6,
	EItemUnusedType__ITEM_UNUSED_INVALID_ABNORMAL = 7,
	EItemUnusedType__ITEM_UNUSED_GROW_LIMIT = 8,
	EItemUnusedType__ITEM_UNUSED_MAX = 9
};


// Enum Arise.EItemCommonFlag
enum class EItemCommonFlag : uint8_t
{
	EItemCommonFlag__ITEM_FLAG_MOVE_USE = 0,
	EItemCommonFlag__ITEM_FLAG_BATTLE_USE = 1,
	EItemCommonFlag__ITEM_FLAG_NO_DROP = 2,
	EItemCommonFlag__ITEM_FLAG_NO_BOOK = 3,
	EItemCommonFlag__ITEM_FLAG_LIMIT_RELEASE = 4,
	EItemCommonFlag__ITEM_FLAG_DELETE_ITEM = 5,
	EItemCommonFlag__ITEM_FLAG_SYSTEM = 6,
	EItemCommonFlag__ITEM_FLAG_COPYRIGHT = 7,
	EItemCommonFlag__ITEM_FLAG_DLC = 8,
	EItemCommonFlag__ITEM_FLAG_MAX = 9
};


// Enum Arise.EItemWorkCategory
enum class EItemWorkCategory : uint8_t
{
	EItemWorkCategory__Accessory   = 0,
	EItemWorkCategory__Ore         = 1,
	EItemWorkCategory__EItemWorkCategory_MAX = 2
};


// Enum Arise.EAriseLLMTag
enum class EAriseLLMTag : uint8_t
{
	EAriseLLMTag__Used             = 0,
	EAriseLLMTag__Engine           = 1,
	EAriseLLMTag__UObject          = 2,
	EAriseLLMTag__Animation        = 3,
	EAriseLLMTag__Meshes           = 4,
	EAriseLLMTag__Textures         = 5,
	EAriseLLMTag__RenderTargets    = 6,
	EAriseLLMTag__Particles        = 7,
	EAriseLLMTag__UI               = 8,
	EAriseLLMTag__PhysX            = 9,
	EAriseLLMTag__Audio            = 10,
	EAriseLLMTag__FileSystem       = 11,
	EAriseLLMTag__AsyncLoading     = 12,
	EAriseLLMTag__DerivedDataCache = 13,
	EAriseLLMTag__AssetRegistry    = 14,
	EAriseLLMTag__AriseMisc        = 15,
	EAriseLLMTag__Others           = 16,
	EAriseLLMTag__Untagged         = 17,
	EAriseLLMTag__Free             = 18,
	EAriseLLMTag__EAriseLLMTag_MAX = 19
};


// Enum Arise.EFastTravelState
enum class EFastTravelState : uint8_t
{
	EFastTravelState__FT_NOT_FOUND = 0,
	EFastTravelState__FT_ENABLED   = 1,
	EFastTravelState__FT_DISABLED  = 2,
	EFastTravelState__FT_MAX       = 3
};


// Enum Arise.EIconDataUsage
enum class EIconDataUsage : uint8_t
{
	EIconDataUsage__USAGE_COMPASS  = 0,
	EIconDataUsage__USAGE_NAVIGATION_MAP = 1,
	EIconDataUsage__USAGE_LOCATION_MAP_ICON = 2,
	EIconDataUsage__USAGE_LOCATION_MAP_FOCUSABLE = 3,
	EIconDataUsage__USAGE_LOCATION_MAP_STATIC = 4,
	EIconDataUsage__USAGE_LOCATION_MAP_DYNAMIC = 5,
	EIconDataUsage__USAGE_MAX      = 6
};


// Enum Arise.EMapGimmickType
enum class EMapGimmickType : uint8_t
{
	EMapGimmickType__NONE          = 0,
	EMapGimmickType__CHR_ARI_FIRESWORD = 1,
	EMapGimmickType__CHR_SIO_HEAL  = 2,
	EMapGimmickType__CHR_RIN_ELECSHOCK = 3,
	EMapGimmickType__CHR_LAW_PUNCH = 4,
	EMapGimmickType__CHR_KSR_SHIELD = 5,
	EMapGimmickType__CHR_TEO_PLANTACTIVE = 6,
	EMapGimmickType__GNR_ORB       = 7,
	EMapGimmickType__GNR_ORBSTAND  = 8,
	EMapGimmickType__MAX           = 9
};


// Enum Arise.EMapIconPictureEnum
enum class EMapIconPictureEnum : uint8_t
{
	EMapIconPictureEnum__MapIcon_PlayerCharacter = 0,
	EMapIconPictureEnum__MapIcon_MapIn = 1,
	EMapIconPictureEnum__MapIcon_Footprint = 2,
	EMapIconPictureEnum__MapIcon_KeepOut = 3,
	EMapIconPictureEnum__MapIcon_MapLink = 4,
	EMapIconPictureEnum__MapIcon_MainEvent = 5,
	EMapIconPictureEnum__MapIcon_SubEvent = 6,
	EMapIconPictureEnum__MapIcon_NPCChat = 7,
	EMapIconPictureEnum__MapIcon_StrongEnemy = 8,
	EMapIconPictureEnum__MapIcon_Camp = 9,
	EMapIconPictureEnum__MapIcon_Treasure = 10,
	EMapIconPictureEnum__MapIcon_TreasureOpened = 11,
	EMapIconPictureEnum__MapIcon_SearchPoint = 12,
	EMapIconPictureEnum__MapIcon_BreakPoint = 13,
	EMapIconPictureEnum__MapIcon_SubBefore = 14,
	EMapIconPictureEnum__MapIcon_SubProgress = 15,
	EMapIconPictureEnum__MapIcon_SubComplete = 16,
	EMapIconPictureEnum__MapIcon_OwlPoint = 17,
	EMapIconPictureEnum__MapIcon_FastTravelPoint = 18,
	EMapIconPictureEnum__MapIcon_FastTravelPointClear = 19,
	EMapIconPictureEnum__MapIcon_Inn = 20,
	EMapIconPictureEnum__MapIcon_Shop = 21,
	EMapIconPictureEnum__MapIcon_WeaponShop = 22,
	EMapIconPictureEnum__MapIcon_AccessoryShop = 23,
	EMapIconPictureEnum__MapIcon_Kitchen = 24,
	EMapIconPictureEnum__MapIcon_QuestDesk = 25,
	EMapIconPictureEnum__MapIcon_NormalEnemy = 26,
	EMapIconPictureEnum__MapIcon_FishingPoint = 27,
	EMapIconPictureEnum__MapIcon_Base = 28,
	EMapIconPictureEnum__MapIcon_Hawkers = 29,
	EMapIconPictureEnum__MapIcon_Gimmick = 30,
	EMapIconPictureEnum__MapIcon_ShipBefore = 31,
	EMapIconPictureEnum__MapIcon_ShipAfter = 32,
	EMapIconPictureEnum__MapIcon_Ladder = 33,
	EMapIconPictureEnum__MapIcon_Fall = 34,
	EMapIconPictureEnum__MapIcon_Harbor = 35,
	EMapIconPictureEnum__MapIcon_Farm = 36,
	EMapIconPictureEnum__MapIcon_Fishman = 37,
	EMapIconPictureEnum__MapIcon_OwlKing = 38,
	EMapIconPictureEnum__MapIcon_Training = 39,
	EMapIconPictureEnum__MapIcon_NPCIChat = 40,
	EMapIconPictureEnum__MapIcon_Elevator = 41,
	EMapIconPictureEnum__MapIcon_SearchPointGet = 42,
	EMapIconPictureEnum__MapIcon_BreakPointGet = 43,
	EMapIconPictureEnum__MapIcon_Hierarchy = 44,
	EMapIconPictureEnum__MapIcon_None = 45,
	EMapIconPictureEnum__MapIcon_MAX = 46
};


// Enum Arise.EMapIconType
enum class EMapIconType : uint8_t
{
	EMapIconType__None             = 0,
	EMapIconType__MapLink          = 1,
	EMapIconType__KeepOut          = 2,
	EMapIconType__Dungeon          = 3,
	EMapIconType__MapName          = 4,
	EMapIconType__MapIn            = 5,
	EMapIconType__PlayerCharacter  = 6,
	EMapIconType__Footprint        = 7,
	EMapIconType__PlayerCamera     = 8,
	EMapIconType__MainEvent        = 9,
	EMapIconType__SubEvent         = 10,
	EMapIconType__SubBefore        = 11,
	EMapIconType__SubProgress      = 12,
	EMapIconType__SubComplete      = 13,
	EMapIconType__NPCChat          = 14,
	EMapIconType__StrongEnemy      = 15,
	EMapIconType__Camp             = 16,
	EMapIconType__Treasure         = 17,
	EMapIconType__TreasureOpened   = 18,
	EMapIconType__SearchPoint      = 19,
	EMapIconType__SearchPointGet   = 20,
	EMapIconType__BreakPoint       = 21,
	EMapIconType__BreakPointGet    = 22,
	EMapIconType__OwlPoint         = 23,
	EMapIconType__FastTravelPoint  = 24,
	EMapIconType__FastTravelPointClear = 25,
	EMapIconType__Inn              = 26,
	EMapIconType__Shop             = 27,
	EMapIconType__WeaponShop       = 28,
	EMapIconType__AccessoryShop    = 29,
	EMapIconType__Kitchen          = 30,
	EMapIconType__Harbor           = 31,
	EMapIconType__Farm             = 32,
	EMapIconType__QuestDesk        = 33,
	EMapIconType__NormalEnemy      = 34,
	EMapIconType__FishingPoint     = 35,
	EMapIconType__Base             = 36,
	EMapIconType__Gimmick          = 37,
	EMapIconType__Ladder           = 38,
	EMapIconType__Elevator         = 39,
	EMapIconType__Fall             = 40,
	EMapIconType__Fishman          = 41,
	EMapIconType__OwlKing          = 42,
	EMapIconType__Training         = 43,
	EMapIconType__Hawkers          = 44,
	EMapIconType__NPCIChat         = 45,
	EMapIconType__BothQuest        = 46,
	EMapIconType__RangeArea        = 47,
	EMapIconType__Hierarchy        = 48,
	EMapIconType__ShipBefore       = 49,
	EMapIconType__ShipAfter        = 50,
	EMapIconType__EMapIconType_MAX = 51
};


// Enum Arise.EMapOrderFolderRegion
enum class EMapOrderFolderRegion : uint8_t
{
	EMapOrderFolderRegion__FOLDER_DEBUG = 0,
	EMapOrderFolderRegion__FOLDER_SHIPPING = 1,
	EMapOrderFolderRegion__FOLDER_DLC1 = 2,
	EMapOrderFolderRegion__FOLDER_MAX = 3
};


// Enum Arise.EMapOrderManager_MapVisibledResult
enum class EMapOrderManager_MapVisibledResult : uint8_t
{
	EMapOrderManager_MapVisibledResult__VisibledAllLevel = 0,
	EMapOrderManager_MapVisibledResult__Error_UnknownMap = 1,
	EMapOrderManager_MapVisibledResult__Error_LevelNotValid = 2,
	EMapOrderManager_MapVisibledResult__Error_LevelNotVisibled = 3,
	EMapOrderManager_MapVisibledResult__EMapOrderManager_MAX = 4
};


// Enum Arise.MenuArenaBattleRule
enum class EMenuArenaBattleRule : uint8_t
{
	MenuArenaBattleRule__BattleRule_Single = 0,
	MenuArenaBattleRule__BattleRule_DownOnly = 1,
	MenuArenaBattleRule__BattleRule_Fall = 2,
	MenuArenaBattleRule__BattleRule_Rematch = 3,
	MenuArenaBattleRule__BattleRule_MAX = 4
};


// Enum Arise.MenuArenaStageRank
enum class EMenuArenaStageRank : uint8_t
{
	MenuArenaStageRank__Rank_Low   = 0,
	MenuArenaStageRank__Rank_Middle = 1,
	MenuArenaStageRank__Rank_High  = 2,
	MenuArenaStageRank__Rank_Expert = 3,
	MenuArenaStageRank__Rank_MAX   = 4
};


// Enum Arise.MenuArenaListType
enum class EMenuArenaListType : uint8_t
{
	MenuArenaListType__Type_Character = 0,
	MenuArenaListType__Type_Difficulty = 1,
	MenuArenaListType__Type_MAX    = 2
};


// Enum Arise.MenuArenaCategory
enum class EMenuArenaCategory : uint8_t
{
	MenuArenaCategory__Category_Single = 0,
	MenuArenaCategory__Category_Party = 1,
	MenuArenaCategory__Category_Special = 2,
	MenuArenaCategory__Category_MAX = 3
};


// Enum Arise.EMenuArtsParentType
enum class EMenuArtsParentType : uint8_t
{
	EMenuArtsParentType__None      = 0,
	EMenuArtsParentType__Base      = 1,
	EMenuArtsParentType__Derived   = 2,
	EMenuArtsParentType__Connect   = 3,
	EMenuArtsParentType__EMenuArtsParentType_MAX = 4
};


// Enum Arise.EMenuArtsPositionType
enum class EMenuArtsPositionType : uint8_t
{
	EMenuArtsPositionType__NoData  = 0,
	EMenuArtsPositionType__Ground  = 1,
	EMenuArtsPositionType__Air     = 2,
	EMenuArtsPositionType__EMenuArtsPositionType_MAX = 3
};


// Enum Arise.EMenuArtsType
enum class EMenuArtsType : uint8_t
{
	EMenuArtsType__Ground          = 0,
	EMenuArtsType__Air             = 1,
	EMenuArtsType__Strike          = 2,
	EMenuArtsType__Mystic          = 3,
	EMenuArtsType__ArtsList        = 4,
	EMenuArtsType__Magic           = 5,
	EMenuArtsType__AntiAir         = 6,
	EMenuArtsType__AntiGround      = 7,
	EMenuArtsType__NoData          = 8,
	EMenuArtsType__EMenuArtsType_MAX = 9
};


// Enum Arise.EMenuBattleOperateType
enum class EMenuBattleOperateType : uint8_t
{
	EMenuBattleOperateType__Operate_Auto = 0,
	EMenuBattleOperateType__Operate_Semiauto = 1,
	EMenuBattleOperateType__Operate_Manual = 2,
	EMenuBattleOperateType__Operate_MAX = 3
};


// Enum Arise.MenuModelMotionType
enum class EMenuModelMotionType : uint8_t
{
	MenuModelMotionType__Normal    = 0,
	MenuModelMotionType__DLC1      = 1,
	MenuModelMotionType__DLC2      = 2,
	MenuModelMotionType__DLC3      = 3,
	MenuModelMotionType__DLC4      = 4,
	MenuModelMotionType__DLC5      = 5,
	MenuModelMotionType__DLC6      = 6,
	MenuModelMotionType__DLC7      = 7,
	MenuModelMotionType__DLC8      = 8,
	MenuModelMotionType__DLC9      = 9,
	MenuModelMotionType__None      = 10,
	MenuModelMotionType__MenuModelMotionType_MAX = 11
};


// Enum Arise.EMenuTopModelSortType
enum class EMenuTopModelSortType : uint8_t
{
	EMenuTopModelSortType__ID      = 0,
	EMenuTopModelSortType__Order   = 1,
	EMenuTopModelSortType__EMenuTopModelSortType_MAX = 2
};


// Enum Arise.EMenuVisualSlotType
enum class EMenuVisualSlotType : uint8_t
{
	EMenuVisualSlotType__Hair      = 0,
	EMenuVisualSlotType__Costume   = 1,
	EMenuVisualSlotType__Attach1   = 2,
	EMenuVisualSlotType__Attach2   = 3,
	EMenuVisualSlotType__Weapon    = 4,
	EMenuVisualSlotType__EMenuVisualSlotType_MAX = 5
};


// Enum Arise.EMenuEquipItemSortType
enum class EMenuEquipItemSortType : uint8_t
{
	EMenuEquipItemSortType__None   = 0,
	EMenuEquipItemSortType__Default = 1,
	EMenuEquipItemSortType__Attack = 2,
	EMenuEquipItemSortType__ElementAttack = 3,
	EMenuEquipItemSortType__Defence = 4,
	EMenuEquipItemSortType__ElementDefence = 5,
	EMenuEquipItemSortType__Penetrate = 6,
	EMenuEquipItemSortType__Endurance = 7,
	EMenuEquipItemSortType__New    = 8,
	EMenuEquipItemSortType__EMenuEquipItemSortType_MAX = 9
};


// Enum Arise.EFarmAnimalType
enum class EFarmAnimalType : uint8_t
{
	EFarmAnimalType__AnimalType_Farm = 0,
	EFarmAnimalType__AnimalType_Support = 1,
	EFarmAnimalType__AnimalType_Other = 2,
	EFarmAnimalType__AnimalType_MAX = 3
};


// Enum Arise.PFAnimalNo
enum class EPFAnimalNo : uint8_t
{
	PFAnimalNo__None               = 0,
	PFAnimalNo__Cow                = 1,
	PFAnimalNo__Pig                = 2,
	PFAnimalNo__Chicken            = 3,
	PFAnimalNo__Horse              = 4,
	PFAnimalNo__Sheep              = 5,
	PFAnimalNo__Bousagi            = 6,
	PFAnimalNo__Dog                = 7,
	PFAnimalNo__Cat                = 8,
	PFAnimalNo__Mouse              = 9,
	PFAnimalNo__MAX                = 10
};


// Enum Arise.PFAnimalGender
enum class EPFAnimalGender : uint8_t
{
	PFAnimalGender__Male           = 0,
	PFAnimalGender__Female         = 1,
	PFAnimalGender__Other          = 2,
	PFAnimalGender__MAX            = 3
};


// Enum Arise.PFAnimalGrowState
enum class EPFAnimalGrowState : uint8_t
{
	PFAnimalGrowState__Child       = 0,
	PFAnimalGrowState__Adult       = 1,
	PFAnimalGrowState__MAX         = 2
};


// Enum Arise.PFAnimalArea
enum class EPFAnimalArea : uint8_t
{
	PFAnimalArea__Area_Outdoor     = 0,
	PFAnimalArea__Area_Indoor      = 1,
	PFAnimalArea__MAX              = 2
};


// Enum Arise.MenuFarmMessageType
enum class EMenuFarmMessageType : uint8_t
{
	MenuFarmMessageType__None      = 0,
	MenuFarmMessageType__Complete  = 1,
	MenuFarmMessageType__Failure   = 2,
	MenuFarmMessageType__Damage    = 3,
	MenuFarmMessageType__SubErase_Dog = 4,
	MenuFarmMessageType__SubErase_Cat = 5,
	MenuFarmMessageType__SubErase_Multi = 6,
	MenuFarmMessageType__AnimalPlus = 7,
	MenuFarmMessageType__SpacePlus = 8,
	MenuFarmMessageType__MenuFarmMessageType_MAX = 9
};


// Enum Arise.MenuFarmPlantStatus
enum class EMenuFarmPlantStatus : uint8_t
{
	MenuFarmPlantStatus__None      = 0,
	MenuFarmPlantStatus__NoLeave   = 1,
	MenuFarmPlantStatus__Leave     = 2,
	MenuFarmPlantStatus__Complete  = 3,
	MenuFarmPlantStatus__Failure   = 4,
	MenuFarmPlantStatus__MenuFarmPlantStatus_MAX = 5
};


// Enum Arise.EMenuItemUsableType
enum class EMenuItemUsableType : uint8_t
{
	EMenuItemUsableType__Unuse     = 0,
	EMenuItemUsableType__HP        = 1,
	EMenuItemUsableType__Status    = 2,
	EMenuItemUsableType__Other     = 3,
	EMenuItemUsableType__AddItem   = 4,
	EMenuItemUsableType__EMenuItemUsableType_MAX = 5
};


// Enum Arise.EMenuItemFilterType
enum class EMenuItemFilterType : uint8_t
{
	EMenuItemFilterType__None      = 0,
	EMenuItemFilterType__Recovery  = 1,
	EMenuItemFilterType__Using     = 2,
	EMenuItemFilterType__StatusUp  = 3,
	EMenuItemFilterType__Eat       = 4,
	EMenuItemFilterType__Food      = 5,
	EMenuItemFilterType__Material  = 6,
	EMenuItemFilterType__Weapon_ARI = 7,
	EMenuItemFilterType__Weapon_SIO = 8,
	EMenuItemFilterType__Weapon_NNA = 9,
	EMenuItemFilterType__Weapon_ZGU = 10,
	EMenuItemFilterType__Weapon_MNK = 11,
	EMenuItemFilterType__Weapon_YRA = 12,
	EMenuItemFilterType__Protecter_Man = 13,
	EMenuItemFilterType__Protecter_Woman = 14,
	EMenuItemFilterType__Protecter_Combinate = 15,
	EMenuItemFilterType__Armor_ARI = 16,
	EMenuItemFilterType__Armor_SIO = 17,
	EMenuItemFilterType__Armor_NNA = 18,
	EMenuItemFilterType__Armor_ZGU = 19,
	EMenuItemFilterType__Armor_MNK = 20,
	EMenuItemFilterType__Armor_YRA = 21,
	EMenuItemFilterType__Skill_A   = 22,
	EMenuItemFilterType__Skill_B   = 23,
	EMenuItemFilterType__Skill_C   = 24,
	EMenuItemFilterType__EMenuItemFilterType_MAX = 25
};


// Enum Arise.EMenuItemSortType
enum class EMenuItemSortType : uint8_t
{
	EMenuItemSortType__ItemID      = 0,
	EMenuItemSortType__NewGet      = 1,
	EMenuItemSortType__Rarity      = 2,
	EMenuItemSortType__Price       = 3,
	EMenuItemSortType__Num         = 4,
	EMenuItemSortType__Attack      = 5,
	EMenuItemSortType__MAttack     = 6,
	EMenuItemSortType__Penetrate   = 7,
	EMenuItemSortType__Defence     = 8,
	EMenuItemSortType__MDefence    = 9,
	EMenuItemSortType__Endurance   = 10,
	EMenuItemSortType__HP          = 11,
	EMenuItemSortType__SP          = 12,
	EMenuItemSortType__Rank        = 13,
	EMenuItemSortType__Skill       = 14,
	EMenuItemSortType__Cost        = 15,
	EMenuItemSortType__Name        = 16,
	EMenuItemSortType__Sall        = 17,
	EMenuItemSortType__EMenuItemSortType_MAX = 18
};


// Enum Arise.MenuCategoryUsingType
enum class EMenuCategoryUsingType : uint8_t
{
	MenuCategoryUsingType__NONE    = 0,
	MenuCategoryUsingType__HEAL_HP = 1,
	MenuCategoryUsingType__HEAL_HP_ALL = 2,
	MenuCategoryUsingType__BOOST_HP = 3,
	MenuCategoryUsingType__HEAL_TP = 4,
	MenuCategoryUsingType__HP_UP   = 5,
	MenuCategoryUsingType__SP_UP   = 6,
	MenuCategoryUsingType__ATK_UP  = 7,
	MenuCategoryUsingType__DEF_UP  = 8,
	MenuCategoryUsingType__EAT_UP  = 9,
	MenuCategoryUsingType__EDF_UP  = 10,
	MenuCategoryUsingType__PEN_UP  = 11,
	MenuCategoryUsingType__END_UP  = 12,
	MenuCategoryUsingType__HOLY_BOTTLE = 13,
	MenuCategoryUsingType__DARK_BOTTLE = 14,
	MenuCategoryUsingType__SPIRIT_BOTTLE = 15,
	MenuCategoryUsingType__GROW_TP = 16,
	MenuCategoryUsingType__HEAL_HP_ALL01 = 17,
	MenuCategoryUsingType__REVIVE  = 18,
	MenuCategoryUsingType__HEAL_HP_FULL = 19,
	MenuCategoryUsingType__RECOVERY = 20,
	MenuCategoryUsingType__LV_UP   = 21,
	MenuCategoryUsingType__CP_UP   = 22,
	MenuCategoryUsingType__HP_UP_ALL = 23,
	MenuCategoryUsingType__MenuCategoryUsingType_MAX = 24
};


// Enum Arise.EMenuItemCategory
enum class EMenuItemCategory : uint8_t
{
	EMenuItemCategory__None        = 0,
	EMenuItemCategory__Use         = 1,
	EMenuItemCategory__Material    = 2,
	EMenuItemCategory__Weapon      = 3,
	EMenuItemCategory__Protector   = 4,
	EMenuItemCategory__Accessory   = 5,
	EMenuItemCategory__Visual      = 6,
	EMenuItemCategory__Valuable    = 7,
	EMenuItemCategory__Download    = 8,
	EMenuItemCategory__Other       = 9,
	EMenuItemCategory__Battle      = 10,
	EMenuItemCategory__Cook        = 11,
	EMenuItemCategory__New         = 12,
	EMenuItemCategory__Material_Acc = 13,
	EMenuItemCategory__EMenuItemCategory_MAX = 14
};


// Enum Arise.EMenuDlcItemCategory
enum class EMenuDlcItemCategory : uint8_t
{
	EMenuDlcItemCategory__None     = 0,
	EMenuDlcItemCategory__Use      = 1,
	EMenuDlcItemCategory__Material = 2,
	EMenuDlcItemCategory__Weapon   = 3,
	EMenuDlcItemCategory__Visual   = 4,
	EMenuDlcItemCategory__Artifact = 5,
	EMenuDlcItemCategory__Music    = 6,
	EMenuDlcItemCategory__Other    = 7,
	EMenuDlcItemCategory__New      = 8,
	EMenuDlcItemCategory__EMenuDlcItemCategory_MAX = 9
};


// Enum Arise.EMenuBGType
enum class EMenuBGType : uint8_t
{
	EMenuBGType__BG_NONE           = 0,
	EMenuBGType__BG_THROUGH        = 1,
	EMenuBGType__BG_CAPTURE        = 2,
	EMenuBGType__BG_LEVEL          = 3,
	EMenuBGType__BG_WORLDMAP       = 4,
	EMenuBGType__BG_STARMAP        = 5,
	EMenuBGType__BG_BTLTOP         = 6,
	EMenuBGType__BG_TOP            = 7,
	EMenuBGType__BG_TOP_TTL        = 8,
	EMenuBGType__BG_TOP_DLC        = 9,
	EMenuBGType__BG_TOP_CLR        = 10,
	EMenuBGType__BG_TOP_MAP        = 11,
	EMenuBGType__BG_TOP_TIT        = 12,
	EMenuBGType__BG_MAX            = 13
};


// Enum Arise.EWidgetUse
enum class EWidgetUse : uint8_t
{
	EWidgetUse__LEVEL              = 0,
	EWidgetUse__CAPTURE            = 1,
	EWidgetUse__BTL_BG             = 2,
	EWidgetUse__STARMAP            = 3,
	EWidgetUse__WORLDMAP           = 4,
	EWidgetUse__MAIN               = 5,
	EWidgetUse__HELP               = 6,
	EWidgetUse__FRAME              = 7,
	EWidgetUse__MENU_SC            = 8,
	EWidgetUse__HEADER             = 9,
	EWidgetUse__HEADER3D           = 10,
	EWidgetUse__TOP_BG             = 11,
	EWidgetUse__TOP_PARTICLE       = 12,
	EWidgetUse__POST_PROC          = 13,
	EWidgetUse__LIGHT              = 14,
	EWidgetUse__EWidgetUse_MAX     = 15
};


// Enum Arise.MenuSEType
enum class EMenuSEType : uint8_t
{
	MenuSEType__MENU_IN            = 0,
	MenuSEType__MENU_OUT           = 1,
	MenuSEType__CURSOR             = 2,
	MenuSEType__CURSOR_TOP         = 3,
	MenuSEType__CURSOR_SUB         = 4,
	MenuSEType__DECISION           = 5,
	MenuSEType__CANCEL             = 6,
	MenuSEType__BEEP               = 7,
	MenuSEType__HEAL_HP            = 8,
	MenuSEType__TYPE_END           = 9,
	MenuSEType__MenuSEType_MAX     = 10
};


// Enum Arise.MenuPad
enum class EMenuPad : uint8_t
{
	MenuPad__LEFT_UP               = 0,
	MenuPad__LEFT_DOWN             = 1,
	MenuPad__LEFT_LEFT             = 2,
	MenuPad__LEFT_RIGHT            = 3,
	MenuPad__RIGHT_UP              = 4,
	MenuPad__RIGHT_DOWN            = 5,
	MenuPad__RIGHT_LEFT            = 6,
	MenuPad__RIGHT_RIGHT           = 7,
	MenuPad__L1                    = 8,
	MenuPad__L2                    = 9,
	MenuPad__L3                    = 10,
	MenuPad__R1                    = 11,
	MenuPad__R2                    = 12,
	MenuPad__R3                    = 13,
	MenuPad__START                 = 14,
	MenuPad__SELECT                = 15,
	MenuPad__DECIDE                = 16,
	MenuPad__CANCEL                = 17,
	MenuPad__LS_UP                 = 18,
	MenuPad__LS_DOWN               = 19,
	MenuPad__LS_LEFT               = 20,
	MenuPad__LS_RIGHT              = 21,
	MenuPad__RS_UP                 = 22,
	MenuPad__RS_DOWN               = 23,
	MenuPad__RS_LEFT               = 24,
	MenuPad__RS_RIGHT              = 25,
	MenuPad__NUM                   = 26,
	MenuPad__MenuPad_MAX           = 27
};


// Enum Arise.EMenuModelPositionSaveType
enum class EMenuModelPositionSaveType : uint8_t
{
	EMenuModelPositionSaveType__Equip = 0,
	EMenuModelPositionSaveType__Visual = 1,
	EMenuModelPositionSaveType__Weapon = 2,
	EMenuModelPositionSaveType__Status = 3,
	EMenuModelPositionSaveType__DLC = 4,
	EMenuModelPositionSaveType__EMenuModelPositionSaveType_MAX = 5
};


// Enum Arise.EMenuFarmAreaType
enum class EMenuFarmAreaType : uint8_t
{
	EMenuFarmAreaType__Stock       = 0,
	EMenuFarmAreaType__Farm        = 1,
	EMenuFarmAreaType__All         = 2,
	EMenuFarmAreaType__EMenuFarmAreaType_MAX = 3
};


// Enum Arise.ESaveDataHeaderParam
enum class ESaveDataHeaderParam : uint8_t
{
	PARAM_PACKED_00                = 0,
	PARAM_LEVEL                    = 1,
	PARAM_PACKED_01                = 2,
	PARAM_LOCATION_ID              = 3,
	PARAM_IMAGE_ENABLED            = 4,
	PARAM_MAIN_QUEST_ID            = 5,
	PARAM_RESERVED                 = 6,
	PARAM_APP_VERSION              = 7,
	PARAM_SC                       = 8,
	PARAM_MAX                      = 9
};


// Enum Arise.ETitleDemoMovieType
enum class ETitleDemoMovieType : uint8_t
{
	ETitleDemoMovieType__DEMO_MOVIE_NONE = 0,
	ETitleDemoMovieType__DEMO_MOVIE_01 = 1,
	ETitleDemoMovieType__DEMO_MOVIE_02 = 2,
	ETitleDemoMovieType__DEMO_MOVIE_MAX = 3
};


// Enum Arise.MenuCategoryIconType
enum class EMenuCategoryIconType : uint8_t
{
	MenuCategoryIconType__ICON_USE = 0,
	MenuCategoryIconType__ICON_MATERIAL = 1,
	MenuCategoryIconType__ICON_VALUE = 2,
	MenuCategoryIconType__ICON_OTHER = 3,
	MenuCategoryIconType__ICON_ALL = 4,
	MenuCategoryIconType__ICON_WEAPON = 5,
	MenuCategoryIconType__ICON_ARMOR = 6,
	MenuCategoryIconType__ICON_ACCESSORY = 7,
	MenuCategoryIconType__ICON_QUEST_MAIN = 8,
	MenuCategoryIconType__ICON_QUEST_SUB = 9,
	MenuCategoryIconType__ICON_QUEST_WANTED = 10,
	MenuCategoryIconType__ICON_CHECK = 11,
	MenuCategoryIconType__ICON_TALISMAN = 12,
	MenuCategoryIconType__ICON_JEWEL = 13,
	MenuCategoryIconType__ICON_BOOTS = 14,
	MenuCategoryIconType__ICON_FEATHER = 15,
	MenuCategoryIconType__ICON_CROSS = 16,
	MenuCategoryIconType__ICON_SPECIAL = 17,
	MenuCategoryIconType__ICON_CHAT = 18,
	MenuCategoryIconType__ICON_MOVIE = 19,
	MenuCategoryIconType__ICON_MEAT = 20,
	MenuCategoryIconType__ICON_FISH = 21,
	MenuCategoryIconType__ICON_VEGETABLE = 22,
	MenuCategoryIconType__ICON_GRAIN = 23,
	MenuCategoryIconType__ICON_DESSERT = 24,
	MenuCategoryIconType__ICON_ENEMY = 25,
	MenuCategoryIconType__ICON_BOSS = 26,
	MenuCategoryIconType__ICON_SYSTEM = 27,
	MenuCategoryIconType__ICON_BATTLE = 28,
	MenuCategoryIconType__ICON_COLLECTION = 29,
	MenuCategoryIconType__ICON_SELECT = 30,
	MenuCategoryIconType__ICON_EFFECTGUARD = 31,
	MenuCategoryIconType__ICON_STATE_UP = 32,
	MenuCategoryIconType__ICON_ETC = 33,
	MenuCategoryIconType__ICON_NEW = 34,
	MenuCategoryIconType__ICON_BLANK = 35,
	MenuCategoryIconType__ICON_MAX = 36
};


// Enum Arise.MenuIconType
enum class EMenuIconType : uint8_t
{
	MenuIconType__ITEM             = 0,
	MenuIconType__ORDER            = 1,
	MenuIconType__TACTICS          = 2,
	MenuIconType__EQUIP            = 3,
	MenuIconType__ARTS             = 4,
	MenuIconType__ALIAS            = 5,
	MenuIconType__LIBRARY          = 6,
	MenuIconType__BOOK             = 7,
	MenuIconType__Space09          = 8,
	MenuIconType__SAVE             = 9,
	MenuIconType__LOAD             = 10,
	MenuIconType__CONFIG           = 11,
	MenuIconType__STATUS           = 12,
	MenuIconType__VISUAL           = 13,
	MenuIconType__COOKING          = 14,
	MenuIconType__CAMP             = 15,
	MenuIconType__INDEFINITE       = 16,
	MenuIconType__PAUSE            = 17,
	MenuIconType__INN              = 18,
	MenuIconType__MENU             = 19,
	MenuIconType__RECALL           = 20,
	MenuIconType__DEPART           = 21,
	MenuIconType__SHOP             = 22,
	MenuIconType__ACCESSORY        = 23,
	MenuIconType__WEAPON           = 24,
	MenuIconType__LOCATIONMAP      = 25,
	MenuIconType__FASTTRAVEL       = 26,
	MenuIconType__ESCAPE           = 27,
	MenuIconType__FARM             = 28,
	MenuIconType__RELIC            = 29,
	MenuIconType__TRAINING         = 30,
	MenuIconType__DLCSHOP          = 31,
	MenuIconType__EAT              = 32,
	MenuIconType__MenuIconType_MAX = 33
};


// Enum Arise.MenuShopItemSortType
enum class EMenuShopItemSortType : uint8_t
{
	MenuShopItemSortType__ID       = 0,
	MenuShopItemSortType__NAME     = 1,
	MenuShopItemSortType__PRICE    = 2,
	MenuShopItemSortType__GETTIME  = 3,
	MenuShopItemSortType__SALE     = 4,
	MenuShopItemSortType__ATTACK   = 5,
	MenuShopItemSortType__EATTACK  = 6,
	MenuShopItemSortType__PENETRATE = 7,
	MenuShopItemSortType__DEFFENCE = 8,
	MenuShopItemSortType__EDEFFENCE = 9,
	MenuShopItemSortType__ENDURANCE = 10,
	MenuShopItemSortType__MenuShopItemSortType_MAX = 11
};


// Enum Arise.MenuShopItemCategory
enum class EMenuShopItemCategory : uint8_t
{
	MenuShopItemCategory__ALL      = 0,
	MenuShopItemCategory__USE      = 1,
	MenuShopItemCategory__MATERIAL = 2,
	MenuShopItemCategory__WEAPON   = 3,
	MenuShopItemCategory__ARMOR    = 4,
	MenuShopItemCategory__ACCESSORY = 5,
	MenuShopItemCategory__MATERIAL_ACC = 6,
	MenuShopItemCategory__ETC      = 7,
	MenuShopItemCategory__CATEGORY_MAX = 8,
	MenuShopItemCategory__MenuShopItemCategory_MAX = 9
};


// Enum Arise.EMenuWeaponRecipeSortType
enum class EMenuWeaponRecipeSortType : uint8_t
{
	EMenuWeaponRecipeSortType__Default = 0,
	EMenuWeaponRecipeSortType__Name = 1,
	EMenuWeaponRecipeSortType__GetTime = 2,
	EMenuWeaponRecipeSortType__Attack = 3,
	EMenuWeaponRecipeSortType__ElementAttack = 4,
	EMenuWeaponRecipeSortType__Penetrate = 5,
	EMenuWeaponRecipeSortType__EMenuWeaponRecipeSortType_MAX = 6
};


// Enum Arise.EMenuSkillPanelCategory
enum class EMenuSkillPanelCategory : uint8_t
{
	EMenuSkillPanelCategory__CATE_SCENARIO = 0,
	EMenuSkillPanelCategory__CATE_SUBQUE = 1,
	EMenuSkillPanelCategory__CATE_YARIKOMI = 2,
	EMenuSkillPanelCategory__CATE_DLC = 3,
	EMenuSkillPanelCategory__CATE_MAX = 4
};


// Enum Arise.EMenuTopID
enum class EMenuTopID : uint8_t
{
	EMenuTopID__ID_CHAP00          = 0,
	EMenuTopID__ID_CHAP01          = 1,
	EMenuTopID__ID_CHAP02          = 2,
	EMenuTopID__ID_CHAP03          = 3,
	EMenuTopID__ID_CHAP04          = 4,
	EMenuTopID__ID_CHAP05          = 5,
	EMenuTopID__ID_CHAP06          = 6,
	EMenuTopID__ID_CHAP07          = 7,
	EMenuTopID__ID_CHAP08          = 8,
	EMenuTopID__ID_CHAP09          = 9,
	EMenuTopID__ID_CHAP10          = 10,
	EMenuTopID__ID_CHAP11          = 11,
	EMenuTopID__ID_CHAP12          = 12,
	EMenuTopID__ID_CHAP13          = 13,
	EMenuTopID__ID_CHAP14          = 14,
	EMenuTopID__ID_CHAP15          = 15,
	EMenuTopID__ID_TTL             = 16,
	EMenuTopID__ID_DLC             = 17,
	EMenuTopID__ID_CLR             = 18,
	EMenuTopID__ID_MAP             = 19,
	EMenuTopID__ID_TIT             = 20,
	EMenuTopID__ID_MAX             = 21
};


// Enum Arise.EMinimapIcon
enum class EMinimapIcon : uint8_t
{
	EMinimapIcon__PlayerCharacter  = 0,
	EMinimapIcon__InvasionLocation = 1,
	EMinimapIcon__Footprint        = 2,
	EMinimapIcon__Marker           = 3,
	EMinimapIcon__MapLink          = 4,
	EMinimapIcon__MainEvent        = 5,
	EMinimapIcon__SubEvent         = 6,
	EMinimapIcon__NPCChat          = 7,
	EMinimapIcon__StrongEnemy      = 8,
	EMinimapIcon__Camp             = 9,
	EMinimapIcon__Town             = 10,
	EMinimapIcon__Dungeon          = 11,
	EMinimapIcon__Field            = 12,
	EMinimapIcon__EMinimapIcon_MAX = 13
};


// Enum Arise.EOpenRecipe
enum class EOpenRecipe : uint8_t
{
	EOpenRecipe__NONE              = 0,
	EOpenRecipe__GET_WEAPON        = 1,
	EOpenRecipe__CLEAR_QUEST       = 2,
	EOpenRecipe__CLEAR_EVENT       = 3,
	EOpenRecipe__HAS_MAIN_ALIAS    = 4,
	EOpenRecipe__GET_SUB_ALIAS     = 5,
	EOpenRecipe__IS_ITEM           = 6,
	EOpenRecipe__GET_WEAPON_RECIPE = 7,
	EOpenRecipe__CREATE_WEAPON_RECIPE = 8,
	EOpenRecipe__USE_WEAPON        = 9,
	EOpenRecipe__CREATE_COOK_RECIPIE = 10,
	EOpenRecipe__GET_COOK_RECIPIE  = 11,
	EOpenRecipe__AWAKE_QUEST       = 12,
	EOpenRecipe__ACCEPT_QUEST      = 13,
	EOpenRecipe__EOpenRecipe_MAX   = 14
};


// Enum Arise.EPFCommonDatabaseKey
enum class EPFCommonDatabaseKey : uint8_t
{
	EPFCommonDatabaseKey__ScriptCameraPreset = 0,
	EPFCommonDatabaseKey__CampDatabase = 1,
	EPFCommonDatabaseKey__CampCameraPreset = 2,
	EPFCommonDatabaseKey__FishingRewardItem = 3,
	EPFCommonDatabaseKey__MAX      = 4
};


// Enum Arise.EPFDelegateType
enum class EPFDelegateType : uint8_t
{
	EnableControl                  = 0,
	DisableControl                 = 1,
	EPFDelegateType_MAX            = 2
};


// Enum Arise.EEnSymBoolPin
enum class EEnSymBoolPin : uint8_t
{
	EEnSymBoolPin__SUCCESS         = 0,
	EEnSymBoolPin__FAILED          = 1,
	EEnSymBoolPin__EEnSymBoolPin_MAX = 2
};


// Enum Arise.EEnSymFloatType
enum class EEnSymFloatType : uint8_t
{
	EEnSymFloatType__ExpriationAge = 0,
	EEnSymFloatType__LostTime      = 1,
	EEnSymFloatType__ChaseTime     = 2,
	EEnSymFloatType__DeleteTime    = 3,
	EEnSymFloatType__GiveupTime    = 4,
	EEnSymFloatType__RushTime      = 5,
	EEnSymFloatType__TurnBlendSpace = 6,
	EEnSymFloatType__RandomMoveYaw = 7,
	EEnSymFloatType__RandomMoveLength = 8,
	EEnSymFloatType__EEnSymFloatType_MAX = 9
};


// Enum Arise.EEnSymBoolType
enum class EEnSymBoolType : uint8_t
{
	EEnSymBoolType__SearchArea     = 0,
	EEnSymBoolType__MoveRoute      = 1,
	EEnSymBoolType__Perception     = 2,
	EEnSymBoolType__FindedTarget   = 3,
	EEnSymBoolType__Moving         = 4,
	EEnSymBoolType__BackMoveRoute  = 5,
	EEnSymBoolType__EntrySearchArea = 6,
	EEnSymBoolType__FollowStart    = 7,
	EEnSymBoolType__DeleteSymbol   = 8,
	EEnSymBoolType__Escape         = 9,
	EEnSymBoolType__CanEscape      = 10,
	EEnSymBoolType__CheckEscape    = 11,
	EEnSymBoolType__RunStateWait   = 12,
	EEnSymBoolType__LockFinded     = 13,
	EEnSymBoolType__AIPaused       = 14,
	EEnSymBoolType__Repop          = 15,
	EEnSymBoolType__Sound          = 16,
	EEnSymBoolType__BackHome       = 17,
	EEnSymBoolType__RushBreak      = 18,
	EEnSymBoolType__EEnSymBoolType_MAX = 19
};


// Enum Arise.EEnSymRotatorType
enum class EEnSymRotatorType : uint8_t
{
	EEnSymRotatorType__HomeRotator = 0,
	EEnSymRotatorType__EEnSymRotatorType_MAX = 1
};


// Enum Arise.EEnSymVectorType
enum class EEnSymVectorType : uint8_t
{
	EEnSymVectorType__HomeLocation = 0,
	EEnSymVectorType__LastTargetLocation = 1,
	EEnSymVectorType__LastSelfLocation = 2,
	EEnSymVectorType__WanderingAreaSize = 3,
	EEnSymVectorType__MovePoint    = 4,
	EEnSymVectorType__EscapeDir    = 5,
	EEnSymVectorType__GoalLocation = 6,
	EEnSymVectorType__RandomMoveRangeMin = 7,
	EEnSymVectorType__RandomMoveRangeMax = 8,
	EEnSymVectorType__LastMovedLocation = 9,
	EEnSymVectorType__EEnSymVectorType_MAX = 10
};


// Enum Arise.EEnSymSizeType
enum class EEnSymSizeType : uint8_t
{
	EEnSymSizeType__SIZE_SMALL     = 0,
	EEnSymSizeType__SIZE_DEFAULT   = 1,
	EEnSymSizeType__SIZE_LARGE     = 2,
	EEnSymSizeType__SIZE_MAX       = 3
};


// Enum Arise.EEnSymFollowType
enum class EEnSymFollowType : uint8_t
{
	EEnSymFollowType__FOLLOW_TYPE_NORMAL = 0,
	EEnSymFollowType__FOLLOW_TYPE_RUSH = 1,
	EEnSymFollowType__FOLLOW_TYPE_SILENCE = 2,
	EEnSymFollowType__FOLLOW_TYPE_MAX = 3
};


// Enum Arise.EEnSymWanderingType
enum class EEnSymWanderingType : uint8_t
{
	EEnSymWanderingType__WANDERING_TYPE_WAIT = 0,
	EEnSymWanderingType__WANDERING_TYPE_WANDER = 1,
	EEnSymWanderingType__WANDERING_TYPE_AIR = 2,
	EEnSymWanderingType__WANDERING_TYPE_ROUTE = 3,
	EEnSymWanderingType__WANDERING_TYPE_ROUTE_BACK = 4,
	EEnSymWanderingType__WANDERING_TYPE_MAX = 5
};


// Enum Arise.EEnSymWaitType
enum class EEnSymWaitType : uint8_t
{
	EEnSymWaitType__WAIT_TYPE_NONE = 0,
	EEnSymWaitType__WAIT_TYPE_WAITING = 1,
	EEnSymWaitType__WAIT_TYPE_GROUND = 2,
	EEnSymWaitType__WAIT_TYPE_MIMIC = 3,
	EEnSymWaitType__WAIT_TYPE_CEIL = 4,
	EEnSymWaitType__WAIT_TYPE_MAX  = 5
};


// Enum Arise.EPFLightweightNpcAction
enum class EPFLightweightNpcAction : uint8_t
{
	EPFLightweightNpcAction__Idle  = 0,
	EPFLightweightNpcAction__Walk  = 1,
	EPFLightweightNpcAction__EPFLightweightNpcAction_MAX = 2
};


// Enum Arise.EPFNavAreaFlag
enum class EPFNavAreaFlag : uint8_t
{
	EPFNavAreaFlag__Unknown        = 0,
	EPFNavAreaFlag__Door           = 1,
	EPFNavAreaFlag__Jump           = 2,
	EPFNavAreaFlag__Fly            = 3,
	EPFNavAreaFlag__Self           = 4,
	EPFNavAreaFlag__EPFNavAreaFlag_MAX = 5
};


// Enum Arise.EPFNpcActorWalk
enum class EPFNpcActorWalk : uint8_t
{
	EPFNpcActorWalk__Walk          = 0,
	EPFNpcActorWalk__Run           = 1,
	EPFNpcActorWalk__EPFNpcActorWalk_MAX = 2
};


// Enum Arise.EPFNpcAnimPlayActionLoop
enum class EPFNpcAnimPlayActionLoop : uint8_t
{
	EPFNpcAnimPlayActionLoop__Default = 0,
	EPFNpcAnimPlayActionLoop__NeverLoop = 1,
	EPFNpcAnimPlayActionLoop__ForeverLoop = 2,
	EPFNpcAnimPlayActionLoop__EPFNpcAnimPlayActionLoop_MAX = 3
};


// Enum Arise.EPFNpcCameraFadingMode
enum class EPFNpcCameraFadingMode : uint8_t
{
	EPFNpcCameraFadingMode__Far    = 0,
	EPFNpcCameraFadingMode__Near   = 1,
	EPFNpcCameraFadingMode__EPFNpcCameraFadingMode_MAX = 2
};


// Enum Arise.EPFNpcInteractionType
enum class EPFNpcInteractionType : uint8_t
{
	EPFNpcInteractionType__NPC_INTERACTION_NONE = 0,
	EPFNpcInteractionType__NPC_INTERACTION_ONETOP = 1,
	EPFNpcInteractionType__NPC_INTERACTION_EVENT = 2,
	EPFNpcInteractionType__NPC_INTERACTION_SHOP = 3,
	EPFNpcInteractionType__NPC_INTERACTION_INN = 4,
	EPFNpcInteractionType__NPC_INTERACTION_QUEST_CLIENT = 5,
	EPFNpcInteractionType__NPC_INTERACTION_QUEST_INFORMATION = 6,
	EPFNpcInteractionType__NPC_INTERACTION_QUEST_MAIN = 7,
	EPFNpcInteractionType__NPC_INTERACTION_SHOP_BLACKSMITH = 8,
	EPFNpcInteractionType__NPC_INTERACTION_SHOP_ACCESSORY = 9,
	EPFNpcInteractionType__NPC_INTERACTION_SHIP = 10,
	EPFNpcInteractionType__NPC_INTERACTION_OWL = 11,
	EPFNpcInteractionType__NPC_INTERACTION_UTILITY = 12,
	EPFNpcInteractionType__NPC_INTERACTION_RECOVERY = 13,
	EPFNpcInteractionType__NPC_INTERACTION_FARM = 14,
	EPFNpcInteractionType__NPC_INTERACTION_COLOSSEUM = 15,
	EPFNpcInteractionType__NPC_INTERACTION_INFORMATION = 16,
	EPFNpcInteractionType__NPC_INTERACTION_GENERAL_STORE = 17,
	EPFNpcInteractionType__NPC_INTERACTION_INJURED_PERSON = 18,
	EPFNpcInteractionType__NPC_INTERACTION_FISHING_TACKLE = 19,
	EPFNpcInteractionType__NPC_INTERACTION_QUEST_ORDER = 20,
	EPFNpcInteractionType__NPC_INTERACTION_QUEST_REPORT = 21,
	EPFNpcInteractionType__NPC_INTERACTION_QUEST_TARGET = 22,
	EPFNpcInteractionType__NPC_INTERACTION_PERCH = 23,
	EPFNpcInteractionType__NPC_INTERACTION_MAX = 24
};


// Enum Arise.EPFNpcSpawnPriority
enum class EPFNpcSpawnPriority : uint8_t
{
	EPFNpcSpawnPriority__Normal    = 0,
	EPFNpcSpawnPriority__AboveNormal = 1,
	EPFNpcSpawnPriority__Middle    = 2,
	EPFNpcSpawnPriority__AboveMiddle = 3,
	EPFNpcSpawnPriority__High      = 4,
	EPFNpcSpawnPriority__AboveHigh = 5,
	EPFNpcSpawnPriority__Highest   = 6,
	EPFNpcSpawnPriority__EPFNpcSpawnPriority_MAX = 7
};


// Enum Arise.EPFNpcWeaponVisibleType
enum class EPFNpcWeaponVisibleType : uint8_t
{
	EPFNpcWeaponVisibleType__Default = 0,
	EPFNpcWeaponVisibleType__Invisible = 1,
	EPFNpcWeaponVisibleType__Visible_Mount = 2,
	EPFNpcWeaponVisibleType__Visible_Unmount = 3,
	EPFNpcWeaponVisibleType__EPFNpcWeaponVisibleType_MAX = 4
};


// Enum Arise.EPFNpcSymbolIcon
enum class EPFNpcSymbolIcon : uint8_t
{
	EPFNpcSymbolIcon__Talk         = 0,
	EPFNpcSymbolIcon__Search       = 1,
	EPFNpcSymbolIcon__MainQuest    = 2,
	EPFNpcSymbolIcon__SubQuest     = 3,
	EPFNpcSymbolIcon__EPFNpcSymbolIcon_MAX = 4
};


// Enum Arise.EPFNpcActInfoType
enum class EPFNpcActInfoType : uint8_t
{
	EPFNpcActInfoType__NPC_ACTINFO_TALK = 0,
	EPFNpcActInfoType__NPC_ACTINFO_SEARCH = 1,
	EPFNpcActInfoType__NPC_ACTINFO_MAX = 2
};


// Enum Arise.EPFNpcCharacterSpawnType
enum class EPFNpcCharacterSpawnType : uint8_t
{
	EPFNpcCharacterSpawnType__Unknown = 0,
	EPFNpcCharacterSpawnType__Stand = 1,
	EPFNpcCharacterSpawnType__Walk = 2,
	EPFNpcCharacterSpawnType__Event = 3,
	EPFNpcCharacterSpawnType__Camp = 4,
	EPFNpcCharacterSpawnType__EPFNpcCharacterSpawnType_MAX = 5
};


// Enum Arise.ENpcDatabaseKey
enum class ENpcDatabaseKey : uint8_t
{
	ENpcDatabaseKey__DefineData_Release = 0,
	ENpcDatabaseKey__DefineData_Debug = 1,
	ENpcDatabaseKey__FacialPreset  = 2,
	ENpcDatabaseKey__MAX           = 3
};


// Enum Arise.EPFNpcInteraction
enum class EPFNpcInteraction : uint8_t
{
	EPFNpcInteraction__InteractionTalk = 0,
	EPFNpcInteraction__InteractionEvent = 1,
	EPFNpcInteraction__EPFNpcInteraction_MAX = 2
};


// Enum Arise.EPFNpcWalkCollideShape
enum class EPFNpcWalkCollideShape : uint8_t
{
	EPFNpcWalkCollideShape__None   = 0,
	EPFNpcWalkCollideShape__Capsule = 1,
	EPFNpcWalkCollideShape__Box    = 2,
	EPFNpcWalkCollideShape__EPFNpcWalkCollideShape_MAX = 3
};


// Enum Arise.EOneTopDatabaseKey
enum class EOneTopDatabaseKey : uint8_t
{
	EOneTopDatabaseKey__OneTopData_Release = 0,
	EOneTopDatabaseKey__OneTopData_Debug = 1,
	EOneTopDatabaseKey__MAX        = 2
};


// Enum Arise.EPlacementDatabaseKey
enum class EPlacementDatabaseKey : uint8_t
{
	EPlacementDatabaseKey__BreakPoint = 0,
	EPlacementDatabaseKey__SearchPoint = 1,
	EPlacementDatabaseKey__TreasurePoint = 2,
	EPlacementDatabaseKey__TPObject = 3,
	EPlacementDatabaseKey__FastTravelPoint = 4,
	EPlacementDatabaseKey__FacilityPoint = 5,
	EPlacementDatabaseKey__OwlPoint = 6,
	EPlacementDatabaseKey__CampPoint = 7,
	EPlacementDatabaseKey__FishingPoint = 8,
	EPlacementDatabaseKey__CookingPoint = 9,
	EPlacementDatabaseKey__BountyEnemyPoint = 10,
	EPlacementDatabaseKey__PlayerPassBlocking = 11,
	EPlacementDatabaseKey__MainQuestPoint = 12,
	EPlacementDatabaseKey__MapGimmick = 13,
	EPlacementDatabaseKey__NpcPoint = 14,
	EPlacementDatabaseKey__LadderPoint = 15,
	EPlacementDatabaseKey__FallingPoint = 16,
	EPlacementDatabaseKey__NpcTalk = 17,
	EPlacementDatabaseKey__SearchModel = 18,
	EPlacementDatabaseKey__SearchPointItem = 19,
	EPlacementDatabaseKey__TreasurePointItem = 20,
	EPlacementDatabaseKey__SearchOwl = 21,
	EPlacementDatabaseKey__MiningPointItem = 22,
	EPlacementDatabaseKey__EncountSymbol = 23,
	EPlacementDatabaseKey__RecoveryPoint = 24,
	EPlacementDatabaseKey__StarShipPoint = 25,
	EPlacementDatabaseKey__MAX     = 26
};


// Enum Arise.EPFPlacementInteraction
enum class EPFPlacementInteraction : uint8_t
{
	EPFPlacementInteraction__Unknown = 0,
	EPFPlacementInteraction__BreakPoint = 1,
	EPFPlacementInteraction__SearchPoint = 2,
	EPFPlacementInteraction__TreasurePoint = 3,
	EPFPlacementInteraction__TPObject = 4,
	EPFPlacementInteraction__FastTravelPoint = 5,
	EPFPlacementInteraction__OwlPoint = 6,
	EPFPlacementInteraction__CampPoint = 7,
	EPFPlacementInteraction__FishingPoint = 8,
	EPFPlacementInteraction__CookingPoint = 9,
	EPFPlacementInteraction__BountyEnemyPoint = 10,
	EPFPlacementInteraction__PlayerPassBlocking = 11,
	EPFPlacementInteraction__MainQuestPoint = 12,
	EPFPlacementInteraction__MapGimmick = 13,
	EPFPlacementInteraction__RecoveryPoint = 14,
	EPFPlacementInteraction__NumMaxPoint = 15,
	EPFPlacementInteraction__EPFPlacementInteraction_MAX = 16
};


// Enum Arise.EPFNpcSpawnType
enum class EPFNpcSpawnType : uint8_t
{
	EPFNpcSpawnType__PlayerFree    = 0,
	EPFNpcSpawnType__Event         = 1,
	EPFNpcSpawnType__EPFNpcSpawnType_MAX = 2
};


// Enum Arise.EPFNpcSpawnStatus
enum class EPFNpcSpawnStatus : uint8_t
{
	EPFNpcSpawnStatus__HasEvent    = 0,
	EPFNpcSpawnStatus__HasQuest    = 1,
	EPFNpcSpawnStatus__HasShortChat = 2,
	EPFNpcSpawnStatus__HasFacility = 3,
	EPFNpcSpawnStatus__HasOneTop   = 4,
	EPFNpcSpawnStatus__Mob         = 5,
	EPFNpcSpawnStatus__EPFNpcSpawnStatus_MAX = 6
};


// Enum Arise.EPFNpcTalkReaction
enum class EPFNpcTalkReaction : uint8_t
{
	EPFNpcTalkReaction__NPC_TALK_REACTION_KEEP = 0,
	EPFNpcTalkReaction__NPC_TALK_REACTION_LOOKAT = 1,
	EPFNpcTalkReaction__NPC_TALK_REACTION_TURN = 2,
	EPFNpcTalkReaction__NPC_TALK_REACTION_MAX = 3
};


// Enum Arise.EPFNpcCollideShape
enum class EPFNpcCollideShape : uint8_t
{
	EPFNpcCollideShape__NPC_COLLIDE_SHAPE_NONE = 0,
	EPFNpcCollideShape__NPC_COLLIDE_SHAPE_CAPSULE = 1,
	EPFNpcCollideShape__NPC_COLLIDE_SHAPE_BOX = 2,
	EPFNpcCollideShape__NPC_COLLIDE_SHAPE_MAX = 3
};


// Enum Arise.EPFNpcSpline
enum class EPFNpcSpline : uint8_t
{
	EPFNpcSpline__NPC_SPLINE_NORMAL = 0,
	EPFNpcSpline__NPC_SPLINE_REVERSE = 1,
	EPFNpcSpline__NPC_SPLINE_MAX   = 2
};


// Enum Arise.EPFNpcMoveSpeed
enum class EPFNpcMoveSpeed : uint8_t
{
	EPFNpcMoveSpeed__NPC_MOVE_SPEED_WALK = 0,
	EPFNpcMoveSpeed__NPC_MOVE_SPEED_RUN = 1,
	EPFNpcMoveSpeed__NPC_MOVE_SPEED_MAX = 2
};


// Enum Arise.EPFNpcIdle
enum class EPFNpcIdle : uint8_t
{
	EPFNpcIdle__NPC_IDLE_NEUTRAL   = 0,
	EPFNpcIdle__NPC_IDLE_WORK      = 1,
	EPFNpcIdle__NPC_IDLE_MAX       = 2
};


// Enum Arise.EPFNpcBehavior
enum class EPFNpcBehavior : uint8_t
{
	EPFNpcBehavior__NPC_BEHAVIOR_BLANK = 0,
	EPFNpcBehavior__NPC_BEHAVIOR_MOVE = 1,
	EPFNpcBehavior__NPC_BEHAVIOR_TALK = 2,
	EPFNpcBehavior__NPC_BEHAVIOR_MAX = 3
};


// Enum Arise.ESearchItemRarity
enum class ESearchItemRarity : uint8_t
{
	ESearchItemRarity__Normal      = 0,
	ESearchItemRarity__Rare        = 1,
	ESearchItemRarity__ESearchItemRarity_MAX = 2
};


// Enum Arise.ESearchModelBounds
enum class ESearchModelBounds : uint8_t
{
	ESearchModelBounds__Component  = 0,
	ESearchModelBounds__Vertices   = 1,
	ESearchModelBounds__ESearchModelBounds_MAX = 2
};


// Enum Arise.ESearchModelState
enum class ESearchModelState : uint8_t
{
	ESearchModelState__Closed      = 0,
	ESearchModelState__Opened      = 1,
	ESearchModelState__Close       = 2,
	ESearchModelState__Open        = 3,
	ESearchModelState__ESearchModelState_MAX = 4
};


// Enum Arise.EPFPlacementSerialize
enum class EPFPlacementSerialize : uint8_t
{
	EPFPlacementSerialize__Unknown = 0,
	EPFPlacementSerialize__BreakPoint = 1,
	EPFPlacementSerialize__SearchPoint = 2,
	EPFPlacementSerialize__TreasurePoint = 3,
	EPFPlacementSerialize__TPObject = 4,
	EPFPlacementSerialize__FastTravelPoint = 5,
	EPFPlacementSerialize__OwlPoint = 6,
	EPFPlacementSerialize__CampPoint = 7,
	EPFPlacementSerialize__FishingPoint = 8,
	EPFPlacementSerialize__CookingPoint = 9,
	EPFPlacementSerialize__BountyEnemyPoint = 10,
	EPFPlacementSerialize__PlayerPassBlocking = 11,
	EPFPlacementSerialize__MainQuestPoint = 12,
	EPFPlacementSerialize__MapGimmick = 13,
	EPFPlacementSerialize__NpcPoint = 14,
	EPFPlacementSerialize__LadderPoint = 15,
	EPFPlacementSerialize__FallingPoint = 16,
	EPFPlacementSerialize__EncountSymbol = 17,
	EPFPlacementSerialize__RecoveryPoint = 18,
	EPFPlacementSerialize__StarShipPoint = 19,
	EPFPlacementSerialize__NumMaxPoint = 20,
	EPFPlacementSerialize__EPFPlacementSerialize_MAX = 21
};


// Enum Arise.EPFAxisInput
enum class EPFAxisInput : uint8_t
{
	EPFAxisInput__MoveForward      = 0,
	EPFAxisInput__MoveRight        = 1,
	EPFAxisInput__RotatePitch      = 2,
	EPFAxisInput__RotateYaw        = 3,
	EPFAxisInput__TypeMax          = 4,
	EPFAxisInput__EPFAxisInput_MAX = 5
};


// Enum Arise.EPFButtonInput
enum class EPFButtonInput : uint8_t
{
	EPFButtonInput__Decide         = 0,
	EPFButtonInput__Cancel         = 1,
	EPFButtonInput__Interaction    = 2,
	EPFButtonInput__Jump           = 3,
	EPFButtonInput__ChangeCameraDistance = 4,
	EPFButtonInput__ResetCameraAngle = 5,
	EPFButtonInput__Gallop         = 6,
	EPFButtonInput__TypeMax        = 7,
	EPFButtonInput__EPFButtonInput_MAX = 8
};


// Enum Arise.EPFSearchPointStatus
enum class EPFSearchPointStatus : uint8_t
{
	EPFSearchPointStatus__Unacquired_DEPRECATED = 0,
	EPFSearchPointStatus__AcquireOnlyOnce_DEPRECATED = 1,
	EPFSearchPointStatus__WaitingForPop_DEPRECATED = 2,
	EPFSearchPointStatus__CanPop_DEPRECATED = 3,
	EPFSearchPointStatus__Zero     = 4,
	EPFSearchPointStatus__Invalidate = 5,
	EPFSearchPointStatus__CanRepop = 6,
	EPFSearchPointStatus__WaitingForRepop = 7,
	EPFSearchPointStatus__EPFSearchPointStatus_MAX = 8
};


// Enum Arise.EPFUIParts
enum class EPFUIParts : uint8_t
{
	EPFUIParts__NAVI_MAP           = 0,
	EPFUIParts__DESTINATION_STAR_ICON = 1,
	EPFUIParts__POP_UP_ANNOUNCE    = 2,
	EPFUIParts__PLAYABLE_HELP      = 3,
	EPFUIParts__OPERATION_BUTTON_HELP = 4,
	EPFUIParts__MAP_LINK_DESTINATION = 5,
	EPFUIParts__INTERACT_ICON      = 6,
	EPFUIParts__INTERACT_BUTTON_HELP = 7,
	EPFUIParts__STAR_SPIRITUAL_GAUGE = 8,
	EPFUIParts__DIETARY_EFFECT_GAUGE = 9,
	EPFUIParts__NEXT_MAIN_QUEST_TEXT = 10,
	EPFUIParts__NEXT_SUB_QUEST_TEXT = 11,
	EPFUIParts__ENCOUNTER_GAUGE    = 12,
	EPFUIParts__ENEMY_APPROACH_ICON = 13,
	EPFUIParts__BATTLE_RESULT      = 14,
	EPFUIParts__LONG_CHAT_BUTTON   = 15,
	EPFUIParts__SHORT_CHAT         = 16,
	EPFUIParts__MESSAGE_WINDOW     = 17,
	EPFUIParts__SYSTEM_WINDOW      = 18,
	EPFUIParts__AREA_CHANGE_NAME   = 19,
	EPFUIParts__TP_GAUGE           = 20,
	EPFUIParts__MAX                = 21
};


// Enum Arise.EPFUIPattern
enum class EPFUIPattern : uint8_t
{
	EPFUIPattern__NONE             = 0,
	EPFUIPattern__MAIN_QUEST_UPDATE = 1,
	EPFUIPattern__OPEN_MESSAGE_WINDOW = 2,
	EPFUIPattern__OPNE_DIALOG      = 3,
	EPFUIPattern__GET_TITLE_EVENT  = 4,
	EPFUIPattern__SUB_QUEST_UPDATE = 5,
	EPFUIPattern__REMUNERATION     = 6,
	EPFUIPattern__MAX              = 7
};


// Enum Arise.EOption
enum class EOption : uint8_t
{
	EOption__NONE                  = 0,
	EOption__ITEM_MAX              = 1,
	EOption__RP_CHARA              = 2,
	EOption__OPTIONTYPE            = 3,
	EOption__OPTIONTYPE01          = 4,
	EOption__OPTIONTYPE02          = 5,
	EOption__OPTIONTYPE_MAX        = 6,
	EOption__EOption_MAX           = 7
};


// Enum Arise.EPassBlockMsgType
enum class EPassBlockMsgType : uint8_t
{
	EPassBlockMsgType__MsgNone     = 0,
	EPassBlockMsgType__MsgShortChat = 1,
	EPassBlockMsgType__MsgWindow   = 2,
	EPassBlockMsgType__MsgScript   = 3,
	EPassBlockMsgType__MsgEvent    = 4,
	EPassBlockMsgType__MsgNpc      = 5,
	EPassBlockMsgType__MsgSysBlock = 6,
	EPassBlockMsgType__EPassBlockMsgType_MAX = 7
};


// Enum Arise.EPlayRecordList
enum class EPlayRecordList : uint8_t
{
	EPlayRecordList__PLAY_RECORD_TOTAL_TIME = 0,
	EPlayRecordList__PLAY_RECORD_TOTAL_GRADE = 1,
	EPlayRecordList__PLAY_RECORD_USE_GRADE = 2,
	EPlayRecordList__PLAY_RECORD_TOTAL_GALD = 3,
	EPlayRecordList__PLAY_RECORD_TOTAL_PAY_GALD = 4,
	EPlayRecordList__PLAY_RECORD_GALD = 5,
	EPlayRecordList__PLAYRECORD_007 = 6,
	EPlayRecordList__PLAYRECORD_008 = 7,
	EPlayRecordList__PLAYRECORD_009 = 8,
	EPlayRecordList__PLAYRECORD_010 = 9,
	EPlayRecordList__PLAYRECORD_011 = 10,
	EPlayRecordList__PLAYRECORD_012 = 11,
	EPlayRecordList__PLAYRECORD_013 = 12,
	EPlayRecordList__PLAYRECORD_014 = 13,
	EPlayRecordList__PLAYRECORD_015 = 14,
	EPlayRecordList__PLAYRECORD_016 = 15,
	EPlayRecordList__PLAYRECORD_017 = 16,
	EPlayRecordList__PLAYRECORD_018 = 17,
	EPlayRecordList__PLAYRECORD_019 = 18,
	EPlayRecordList__PLAYRECORD_020 = 19,
	EPlayRecordList__PLAYRECORD_021 = 20,
	EPlayRecordList__PLAYRECORD_022 = 21,
	EPlayRecordList__PLAYRECORD_023 = 22,
	EPlayRecordList__PLAYRECORD_024 = 23,
	EPlayRecordList__PLAYRECORD_025 = 24,
	EPlayRecordList__PLAYRECORD_026 = 25,
	EPlayRecordList__PLAYRECORD_027 = 26,
	EPlayRecordList__PLAYRECORD_028 = 27,
	EPlayRecordList__PLAYRECORD_029 = 28,
	EPlayRecordList__PLAY_RECORD_TOTAL_BTLTIME = 29,
	EPlayRecordList__PLAY_RECORD_BTL_COUNT = 30,
	EPlayRecordList__PLAY_RECORD_MAX_HIT_COUNT = 31,
	EPlayRecordList__PLAY_RECORD_MAX_HIT_DAMAGE = 32,
	EPlayRecordList__PLAYRECORD_034 = 33,
	EPlayRecordList__PLAY_RECORD_DEFEAT_ENEMY = 34,
	EPlayRecordList__PLAY_RECORD_DEFEAT_ENEMY_TYPE = 35,
	EPlayRecordList__PLAY_RECORD_DEFEAT_GIGANT_TYPE = 36,
	EPlayRecordList__PLAY_RECORD_RUNAWAY = 37,
	EPlayRecordList__PLAY_RECORD_BOOST_ATTACK = 38,
	EPlayRecordList__PLAY_RECORD_BOOST_STRIKE = 39,
	EPlayRecordList__PLAY_RECORD_COUNTER_RAID = 40,
	EPlayRecordList__PLAYRECORD_042 = 41,
	EPlayRecordList__PLAY_RECORD_BOOST_ATTACK_BREAK = 42,
	EPlayRecordList__PLAY_RECORD_FLOWER = 43,
	EPlayRecordList__EPlayRecordList_MAX = 44
};


// Enum Arise.EQuestType
enum class EQuestType : uint8_t
{
	EQuestType__MainQuest          = 0,
	EQuestType__SubQuest           = 1,
	EQuestType__EQuestType_MAX     = 2
};


// Enum Arise.EQuestDatabaseKey
enum class EQuestDatabaseKey : uint8_t
{
	EQuestDatabaseKey__Message     = 0,
	EQuestDatabaseKey__Guide       = 1,
	EQuestDatabaseKey__Lineup      = 2,
	EQuestDatabaseKey__EnemyCounter = 3,
	EQuestDatabaseKey__ItemCounter = 4,
	EQuestDatabaseKey__Clear       = 5,
	EQuestDatabaseKey__MAX         = 6
};


// Enum Arise.EQuestGuideCategory
enum class EQuestGuideCategory : uint8_t
{
	EQuestGuideCategory__Main      = 0,
	EQuestGuideCategory__Sub       = 1,
	EQuestGuideCategory__Wanted    = 2,
	EQuestGuideCategory__EQuestGuideCategory_MAX = 3
};


// Enum Arise.EQuestStepProgress
enum class EQuestStepProgress : uint8_t
{
	EQuestStepProgress__Closed     = 0,
	EQuestStepProgress__Opened     = 1,
	EQuestStepProgress__Cleared    = 2,
	EQuestStepProgress__EQuestStepProgress_MAX = 3
};


// Enum Arise.EQuestGuideProgress
enum class EQuestGuideProgress : uint8_t
{
	EQuestGuideProgress__Closed    = 0,
	EQuestGuideProgress__Lineuped  = 1,
	EQuestGuideProgress__Opened    = 2,
	EQuestGuideProgress__Cleared   = 3,
	EQuestGuideProgress__Reorder   = 4,
	EQuestGuideProgress__EQuestGuideProgress_MAX = 5
};


// Enum Arise.EInheritanceScenarioFlagCategory
enum class EInheritanceScenarioFlagCategory : uint8_t
{
	EInheritanceScenarioFlagCategory__NONE = 0,
	EInheritanceScenarioFlagCategory__MAP = 1,
	EInheritanceScenarioFlagCategory__TROPHY = 2,
	EInheritanceScenarioFlagCategory__LC = 3,
	EInheritanceScenarioFlagCategory__GRS = 4,
	EInheritanceScenarioFlagCategory__EInheritanceScenarioFlagCategory_MAX = 5
};


// Enum Arise.EScenarioBitFlagCategory
enum class EScenarioBitFlagCategory : uint8_t
{
	EScenarioBitFlagCategory__SYSTEM = 0,
	EScenarioBitFlagCategory__BATTLE = 1,
	EScenarioBitFlagCategory__MENU = 2,
	EScenarioBitFlagCategory__MAIN = 3,
	EScenarioBitFlagCategory__SUB  = 4,
	EScenarioBitFlagCategory__LCHAT = 5,
	EScenarioBitFlagCategory__SCHAT = 6,
	EScenarioBitFlagCategory__GIMMICK = 7,
	EScenarioBitFlagCategory__MAP  = 8,
	EScenarioBitFlagCategory__MAPPOINT = 9,
	EScenarioBitFlagCategory__UNIQUE = 10,
	EScenarioBitFlagCategory__SCRIPT = 11,
	EScenarioBitFlagCategory__MOVIE = 12,
	EScenarioBitFlagCategory__MINIGAME = 13,
	EScenarioBitFlagCategory__PARTY = 14,
	EScenarioBitFlagCategory__ITEM = 15,
	EScenarioBitFlagCategory__DEBUG_GIMMICK = 16,
	EScenarioBitFlagCategory__DEBUG_MINIGAME = 17,
	EScenarioBitFlagCategory__DEBUG = 18,
	EScenarioBitFlagCategory__FASTTRAVEL = 19,
	EScenarioBitFlagCategory__LCHAT_PLAY = 20,
	EScenarioBitFlagCategory__EScenarioBitFlagCategory_MAX = 21
};


// Enum Arise.ESceneFadeSpeed
enum class ESceneFadeSpeed : uint8_t
{
	ESceneFadeSpeed__FadeNormalSpeed = 0,
	ESceneFadeSpeed__FadeSlowSpeed = 1,
	ESceneFadeSpeed__FadeHiSpeed   = 2,
	ESceneFadeSpeed__FadeFreeSpeed = 3,
	ESceneFadeSpeed__ESceneFadeSpeed_MAX = 4
};


// Enum Arise.ESceneFadeColor
enum class ESceneFadeColor : uint8_t
{
	ESceneFadeColor__FadeNone      = 0,
	ESceneFadeColor__FadeBlack     = 1,
	ESceneFadeColor__FadeWhite     = 2,
	ESceneFadeColor__ESceneFadeColor_MAX = 3
};


// Enum Arise.ESceneFadeType
enum class ESceneFadeType : uint8_t
{
	ESceneFadeType__FadeNone       = 0,
	ESceneFadeType__FadeIn         = 1,
	ESceneFadeType__FadeOut        = 2,
	ESceneFadeType__FadeEnd        = 3,
	ESceneFadeType__ESceneFadeType_MAX = 4
};


// Enum Arise.ESearchOwlType
enum class ESearchOwlType : uint8_t
{
	ESearchOwlType__OWL_COLOR_A    = 0,
	ESearchOwlType__OWL_COLOR_B    = 1,
	ESearchOwlType__OWL_COLOR_C    = 2,
	ESearchOwlType__OWL_COLOR_D    = 3,
	ESearchOwlType__OWL_COLOR_E    = 4,
	ESearchOwlType__OWL_COLOR_F    = 5,
	ESearchOwlType__OWL_COLOR_MAX  = 6
};


// Enum Arise.EShopType
enum class EShopType : uint8_t
{
	EShopType__Item                = 0,
	EShopType__Weapon              = 1,
	EShopType__Accessory           = 2,
	EShopType__EShopType_MAX       = 3
};


// Enum Arise.EAriseSCHLocationType
enum class EAriseSCHLocationType : uint8_t
{
	EAriseSCHLocationType__Region  = 0,
	EAriseSCHLocationType__Area    = 1,
	EAriseSCHLocationType__Location = 2,
	EAriseSCHLocationType__Scene   = 3,
	EAriseSCHLocationType__None    = 4,
	EAriseSCHLocationType__EAriseSCHLocationType_MAX = 5
};


// Enum Arise.EPriorityType
enum class EPriorityType : uint8_t
{
	EPriorityType__A               = 0,
	EPriorityType__B               = 1,
	EPriorityType__C               = 2,
	EPriorityType__D               = 3,
	EPriorityType__E               = 4,
	EPriorityType__F               = 5,
	EPriorityType__EPriorityType_MAX = 6
};


// Enum Arise.ESpeakerType
enum class ESpeakerType : uint8_t
{
	ESpeakerType__INVALID          = 0,
	ESpeakerType__ARI              = 1,
	ESpeakerType__SIO              = 2,
	ESpeakerType__NNA              = 3,
	ESpeakerType__ZGU              = 4,
	ESpeakerType__MNK              = 5,
	ESpeakerType__YRA              = 6,
	ESpeakerType__ZFA              = 7,
	ESpeakerType__BEZ              = 8,
	ESpeakerType__KIL              = 9,
	ESpeakerType__AGM              = 10,
	ESpeakerType__DFN              = 11,
	ESpeakerType__SOL              = 12,
	ESpeakerType__LHI              = 13,
	ESpeakerType__NPC              = 14,
	ESpeakerType__NPC01            = 15,
	ESpeakerType__NPC02            = 16,
	ESpeakerType__NPC03            = 17,
	ESpeakerType__NPC04            = 18,
	ESpeakerType__NPC05            = 19,
	ESpeakerType__NPC06            = 20,
	ESpeakerType__NPC07            = 21,
	ESpeakerType__NPC08            = 22,
	ESpeakerType__FRU              = 23,
	ESpeakerType__MRS              = 24,
	ESpeakerType__DNS              = 25,
	ESpeakerType__ODT              = 26,
	ESpeakerType__CCL              = 27,
	ESpeakerType__KRN              = 28,
	ESpeakerType__EDN              = 29,
	ESpeakerType__EIZ              = 30,
	ESpeakerType__KLZ              = 31,
	ESpeakerType__DAR              = 32,
	ESpeakerType__LSW              = 33,
	ESpeakerType__LGU              = 34,
	ESpeakerType__LLA              = 35,
	ESpeakerType__DOC              = 36,
	ESpeakerType__ELS              = 37,
	ESpeakerType__ELM              = 38,
	ESpeakerType__SGU              = 39,
	ESpeakerType__CBK              = 40,
	ESpeakerType__CBA              = 41,
	ESpeakerType__EMOTION          = 42,
	ESpeakerType__SELF             = 43,
	ESpeakerType__ALLPEOPLE        = 44,
	ESpeakerType__PARTY            = 45,
	ESpeakerType__ALLY             = 46,
	ESpeakerType__ENEMY            = 47,
	ESpeakerType__PUBLIC           = 48,
	ESpeakerType__OBJECT           = 49,
	ESpeakerType__ESpeakerType_MAX = 50
};


// Enum Arise.EFaceIcon
enum class EFaceIcon : uint8_t
{
	EFaceIcon__NORMAL              = 0,
	EFaceIcon__JOY                 = 1,
	EFaceIcon__ANGER               = 2,
	EFaceIcon__SAD                 = 3,
	EFaceIcon__BLUNDER             = 4,
	EFaceIcon__SURPRISE            = 5,
	EFaceIcon__EFaceIcon_MAX       = 6
};


// Enum Arise.EShortchatIconType
enum class EShortchatIconType : uint8_t
{
	EShortchatIconType__ARI        = 0,
	EShortchatIconType__SIO        = 1,
	EShortchatIconType__NNA        = 2,
	EShortchatIconType__ZGU        = 3,
	EShortchatIconType__MNK        = 4,
	EShortchatIconType__YRA        = 5,
	EShortchatIconType__Icon7      = 6,
	EShortchatIconType__Icon8      = 7,
	EShortchatIconType__Icon9      = 8,
	EShortchatIconType__Icon10     = 9,
	EShortchatIconType__Icon11     = 10,
	EShortchatIconType__Icon12     = 11,
	EShortchatIconType__Icon13     = 12,
	EShortchatIconType__Icon14     = 13,
	EShortchatIconType__Icon15     = 14,
	EShortchatIconType__Icon16     = 15,
	EShortchatIconType__Icon17     = 16,
	EShortchatIconType__Icon18     = 17,
	EShortchatIconType__Icon19     = 18,
	EShortchatIconType__Icon20     = 19,
	EShortchatIconType__Icon21     = 20,
	EShortchatIconType__Icon22     = 21,
	EShortchatIconType__Icon23     = 22,
	EShortchatIconType__Icon24     = 23,
	EShortchatIconType__Icon25     = 24,
	EShortchatIconType__Icon26     = 25,
	EShortchatIconType__Icon27     = 26,
	EShortchatIconType__Icon28     = 27,
	EShortchatIconType__Icon29     = 28,
	EShortchatIconType__Icon30     = 29,
	EShortchatIconType__Icon31     = 30,
	EShortchatIconType__Icon32     = 31,
	EShortchatIconType__Icon33     = 32,
	EShortchatIconType__Icon34     = 33,
	EShortchatIconType__Icon35     = 34,
	EShortchatIconType__Icon36     = 35,
	EShortchatIconType__EShortchatIconType_MAX = 36
};


// Enum Arise.ESCH_PFActionType
enum class ESCH_PFActionType : uint8_t
{
	ESCH_PFActionType__JUMP_LANDING_DAMAGE = 0,
	ESCH_PFActionType__SWIM_SLOW_TRANS = 1,
	ESCH_PFActionType__TOUCH_SQUAT = 2,
	ESCH_PFActionType__LOSE_TRANS_IDLE = 3,
	ESCH_PFActionType__SYS_IDLE_CHARA = 4,
	ESCH_PFActionType__HIGH_PLACE  = 5,
	ESCH_PFActionType__HOT         = 6,
	ESCH_PFActionType__COLD        = 7,
	ESCH_PFActionType__HIGHLAND    = 8,
	ESCH_PFActionType__ESCH_MAX    = 9
};


// Enum Arise.EPFSCHObjDefine
enum class EPFSCHObjDefine : uint8_t
{
	EPFSCHObjDefine__INVALID       = 0,
	EPFSCHObjDefine__Npc           = 1,
	EPFSCHObjDefine__Boss          = 2,
	EPFSCHObjDefine__Artifact      = 3,
	EPFSCHObjDefine__Owl           = 4,
	EPFSCHObjDefine__Treasure      = 5,
	EPFSCHObjDefine__Collection    = 6,
	EPFSCHObjDefine__ItemRare      = 7,
	EPFSCHObjDefine__ItemRare01    = 8,
	EPFSCHObjDefine__ItemRare02    = 9,
	EPFSCHObjDefine__OreRank       = 10,
	EPFSCHObjDefine__OreRank01     = 11,
	EPFSCHObjDefine__OreRank02     = 12,
	EPFSCHObjDefine__Ranch         = 13,
	EPFSCHObjDefine__Arena         = 14,
	EPFSCHObjDefine__Fishing       = 15,
	EPFSCHObjDefine__Camp          = 16,
	EPFSCHObjDefine__Kitchen       = 17,
	EPFSCHObjDefine__Information   = 18,
	EPFSCHObjDefine__General       = 19,
	EPFSCHObjDefine__Blacksmith    = 20,
	EPFSCHObjDefine__Sculptor      = 21,
	EPFSCHObjDefine__Ore           = 22,
	EPFSCHObjDefine__Inn           = 23,
	EPFSCHObjDefine__Quest         = 24,
	EPFSCHObjDefine__YoungWoman    = 25,
	EPFSCHObjDefine__Cat           = 26,
	EPFSCHObjDefine__Rare          = 27,
	EPFSCHObjDefine__StrongBoss    = 28,
	EPFSCHObjDefine__QuestEnemy    = 29,
	EPFSCHObjDefine__QuestItem     = 30,
	EPFSCHObjDefine__Meat          = 31,
	EPFSCHObjDefine__EPFSCHObjDefine_MAX = 32
};


// Enum Arise.ESCHPFOwlDetectFlagCheckType
enum class ESCHPFOwlDetectFlagCheckType : uint8_t
{
	ESCHPFOwlDetectFlagCheckType__CheckNone = 0,
	ESCHPFOwlDetectFlagCheckType__CheckTrue = 1,
	ESCHPFOwlDetectFlagCheckType__CheckFalse = 2,
	ESCHPFOwlDetectFlagCheckType__ESCHPFOwlDetectFlagCheckType_MAX = 3
};


// Enum Arise.EArisePFSCPauseState
enum class EArisePFSCPauseState : uint8_t
{
	EArisePFSCPauseState__None     = 0,
	EArisePFSCPauseState__AutoSave = 1,
	EArisePFSCPauseState__Scene    = 2,
	EArisePFSCPauseState__State    = 3,
	EArisePFSCPauseState__Battle   = 4,
	EArisePFSCPauseState__SystemWindow = 5,
	EArisePFSCPauseState__Menu     = 6,
	EArisePFSCPauseState__Interact = 7,
	EArisePFSCPauseState__EArisePFSCPauseState_MAX = 8
};


// Enum Arise.EStaffrollImageDirection
enum class EStaffrollImageDirection : uint8_t
{
	EStaffrollImageDirection__None = 0,
	EStaffrollImageDirection__Center = 1,
	EStaffrollImageDirection__Right = 2,
	EStaffrollImageDirection__Left = 3,
	EStaffrollImageDirection__Center_S_Size = 4,
	EStaffrollImageDirection__EStaffrollImageDirection_MAX = 5
};


// Enum Arise.EStaffrollImageAnime
enum class EStaffrollImageAnime : uint8_t
{
	EStaffrollImageAnime__None     = 0,
	EStaffrollImageAnime__Open     = 1,
	EStaffrollImageAnime__Close    = 2,
	EStaffrollImageAnime__EStaffrollImageAnime_MAX = 3
};


// Enum Arise.EStaffrollDirection
enum class EStaffrollDirection : uint8_t
{
	EStaffrollDirection__None      = 0,
	EStaffrollDirection__Center    = 1,
	EStaffrollDirection__Right     = 2,
	EStaffrollDirection__Left      = 3,
	EStaffrollDirection__EStaffrollDirection_MAX = 4
};


// Enum Arise.EStaffrollFormatType
enum class EStaffrollFormatType : uint8_t
{
	EStaffrollFormatType__Normal   = 0,
	EStaffrollFormatType__Small    = 1,
	EStaffrollFormatType__Title_Red = 2,
	EStaffrollFormatType__CompanyLogo = 3,
	EStaffrollFormatType__End      = 4,
	EStaffrollFormatType__PositionName_Color1 = 5,
	EStaffrollFormatType__PositionName_Color2 = 6,
	EStaffrollFormatType__Fin      = 7,
	EStaffrollFormatType__ChangeFade = 8,
	EStaffrollFormatType__BigText  = 9,
	EStaffrollFormatType__EStaffrollFormatType_MAX = 10
};


// Enum Arise.EAssetLoadingPriority
enum class EAssetLoadingPriority : uint8_t
{
	EAssetLoadingPriority__ResidentChara = 0,
	EAssetLoadingPriority__Level   = 1,
	EAssetLoadingPriority__Battle_Preload = 2,
	EAssetLoadingPriority__PF_NPC  = 3,
	EAssetLoadingPriority__PF_Etc  = 4,
	EAssetLoadingPriority__PF_Treasure = 5,
	EAssetLoadingPriority__Immediate = 6,
	EAssetLoadingPriority__GameSection_MainGame = 7,
	EAssetLoadingPriority__GameSection_Title = 8,
	EAssetLoadingPriority__GameSection_Boot = 9,
	EAssetLoadingPriority__GameSection_InitSystem = 10,
	EAssetLoadingPriority__EAssetLoadingPriority_MAX = 11
};


// Enum Arise.EApplicationLocale
enum class EApplicationLocale : uint8_t
{
	EApplicationLocale__All        = 0,
	EApplicationLocale__Japan      = 1,
	EApplicationLocale__NorthAmerica = 2,
	EApplicationLocale__Europe     = 3,
	EApplicationLocale__Asia       = 4,
	EApplicationLocale__EApplicationLocale_MAX = 5
};


// Enum Arise.EGamePlatform
enum class EGamePlatform : uint8_t
{
	EGamePlatform__Windows         = 0,
	EGamePlatform__PS4             = 1,
	EGamePlatform__XboxOne         = 2,
	EGamePlatform__Unknown         = 3,
	EGamePlatform__EGamePlatform_MAX = 4
};


// Enum Arise.ESystemWindowFlag
enum class ESystemWindowFlag : uint8_t
{
	ESystemWindowFlag__Disable_Decide = 0,
	ESystemWindowFlag__Disable_Cancel = 1,
	ESystemWindowFlag__Origin_Top  = 2,
	ESystemWindowFlag__Origin_Bottom = 3,
	ESystemWindowFlag__Origin_Left = 4,
	ESystemWindowFlag__Origin_Right = 5,
	ESystemWindowFlag__Origin_Center = 6,
	ESystemWindowFlag__Align_Left  = 7,
	ESystemWindowFlag__Align_Right = 8,
	ESystemWindowFlag__Align_Center = 9,
	ESystemWindowFlag__Choice_Align_Left = 10,
	ESystemWindowFlag__Choice_Align_Right = 11,
	ESystemWindowFlag__Choice_Align_Center = 12,
	ESystemWindowFlag__Choice_Block_Left = 13,
	ESystemWindowFlag__Choice_Block_Right = 14,
	ESystemWindowFlag__Choice_Block_Center = 15,
	ESystemWindowFlag__Choice_Cursor_Hidden = 16,
	ESystemWindowFlag__Disable_Pause = 17,
	ESystemWindowFlag__ESystemWindowFlag_MAX = 18
};


// Enum Arise.ESystemWindowAutoPosition
enum class ESystemWindowAutoPosition : uint8_t
{
	ESystemWindowAutoPosition__AutoPosition_Off = 0,
	ESystemWindowAutoPosition__AutoPosition_Center = 1,
	ESystemWindowAutoPosition__AutoPosition_Left = 2,
	ESystemWindowAutoPosition__AutoPosition_Right = 3,
	ESystemWindowAutoPosition__AutoPosition_Top = 4,
	ESystemWindowAutoPosition__AutoPosition_Bottom = 5,
	ESystemWindowAutoPosition__AutoPosition_LeftTop = 6,
	ESystemWindowAutoPosition__AutoPosition_LeftBottom = 7,
	ESystemWindowAutoPosition__AutoPosition_RightTop = 8,
	ESystemWindowAutoPosition__AutoPosition_RightBottom = 9,
	ESystemWindowAutoPosition__AutoPosition_ENUM_END = 10,
	ESystemWindowAutoPosition__AutoPosition_MAX = 11
};


// Enum Arise.EUIElementType
enum class EUIElementType : uint8_t
{
	EUIElementType__PF_Minimap     = 0,
	EUIElementType__PF_MinimapRotate = 1,
	EUIElementType__PF_DirectionGuide = 2,
	EUIElementType__UIElementMax   = 3,
	EUIElementType__EUIElementType_MAX = 4
};


// Enum Arise.EInputDeviceType
enum class EInputDeviceType : uint8_t
{
	EInputDeviceType__KEYBOARD     = 0,
	EInputDeviceType__GAMEPAD      = 1,
	EInputDeviceType__EInputDeviceType_MAX = 2
};


// Enum Arise.EButtonIconSet
enum class EButtonIconSet : uint8_t
{
	EButtonIconSet__KEYBOARD       = 0,
	EButtonIconSet__XINPUT_XONE    = 1,
	EButtonIconSet__DUALSHOCK4     = 2,
	EButtonIconSet__AUTO           = 3,
	EButtonIconSet__EButtonIconSet_MAX = 4
};


// Enum Arise.EVisualItemEquipType
enum class EVisualItemEquipType : uint8_t
{
	EVisualItemEquipType__UNKNOWN  = 0,
	EVisualItemEquipType__GLASSESA = 1,
	EVisualItemEquipType__GLASSESB = 2,
	EVisualItemEquipType__GLASSESC = 3,
	EVisualItemEquipType__GLASSESD = 4,
	EVisualItemEquipType__GLASSESE = 5,
	EVisualItemEquipType__GLASSESF = 6,
	EVisualItemEquipType__EYEPATCHR = 7,
	EVisualItemEquipType__EYEPATCHRL = 8,
	EVisualItemEquipType__BANDAGER = 9,
	EVisualItemEquipType__BANDAGEL = 10,
	EVisualItemEquipType__DEAR     = 11,
	EVisualItemEquipType__CEAR     = 12,
	EVisualItemEquipType__REAR     = 13,
	EVisualItemEquipType__DHORN    = 14,
	EVisualItemEquipType__CROWN    = 15,
	EVisualItemEquipType__FLOW     = 16,
	EVisualItemEquipType__ROSE     = 17,
	EVisualItemEquipType__RIBBON   = 18,
	EVisualItemEquipType__ANG      = 19,
	EVisualItemEquipType__DEVIL    = 20,
	EVisualItemEquipType__BUTTE    = 21,
	EVisualItemEquipType__WINGR    = 22,
	EVisualItemEquipType__WINGL    = 23,
	EVisualItemEquipType__TAILA    = 24,
	EVisualItemEquipType__TAILB    = 25,
	EVisualItemEquipType__TAILC    = 26,
	EVisualItemEquipType__TAILD    = 27,
	EVisualItemEquipType__FURURU   = 28,
	EVisualItemEquipType__EVisualItemEquipType_MAX = 29
};


// Enum Arise.EWorldLevelType
enum class EWorldLevelType : uint8_t
{
	EWorldLevelType__LVTYPE_FREE   = 0,
	EWorldLevelType__LVTYPE_FIELD  = 1,
	EWorldLevelType__LVTYPE_TOWN   = 2,
	EWorldLevelType__LVTYPE_DUNGEON = 3,
	EWorldLevelType__LVTYPE_EVENT  = 4,
	EWorldLevelType__LVTYPE_MAX    = 5
};


// Enum Arise.EEffectState
enum class EEffectState : uint8_t
{
	EEffectState__Init             = 0,
	EEffectState__On               = 1,
	EEffectState__Off              = 2,
	EEffectState__Disable          = 3,
	EEffectState__Nothing          = 4,
	EEffectState__EEffectState_MAX = 5
};


// Enum Arise.ELightState
enum class ELightState : uint8_t
{
	ELightState__Init              = 0,
	ELightState__On                = 1,
	ELightState__Off               = 2,
	ELightState__FadeOn            = 3,
	ELightState__FadeOff           = 4,
	ELightState__Disable           = 5,
	ELightState__Nothing           = 6,
	ELightState__ELightState_MAX   = 7
};



//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// ScriptStruct Arise.AccessoryExp
// 0x0008
struct FAccessoryExp
{
	int                                                Rank;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                NextExp;                                                  // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.AccessoryParam
// 0x0028
struct FAccessoryParam
{
	int                                                Lv;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<int>                                        Stone;                                                    // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<int>                                        Accessory;                                                // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.AccessoryExpTableRow
// 0x0030
struct FAccessoryExpTableRow
{
	TArray<struct FAccessoryExp>                       Data;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FAccessoryParam>                     AddExp;                                                   // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FAccessoryParam>                     UseGald;                                                  // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.AlphaMaskFadeTaskNode
// 0x0010
struct FAlphaMaskFadeTaskNode
{
	class UAlphaMaskCameraFadeTask*                    Task;                                                     // 0x0000(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAlphaMaskCameraFadeTask*                    ExecuteTask;                                              // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct Arise.AlphaMaskPriorityLabel
// 0x0008
struct FAlphaMaskPriorityLabel
{
	struct FName                                       Label;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.AriseBlueprintAssetData
// 0x0030
struct FAriseBlueprintAssetData
{
	EAriseBlueprintAssetCategory                       Category;                                                 // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FName                                       ID;                                                       // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FSoftClassPath                              AssetPath;                                                // 0x0010(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	EAriseBlueprintAssetCreateMethod                   CreateMethod;                                             // 0x0028(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               bForDebugOnly;                                            // 0x0029(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x002A(0x0006) MISSED OFFSET
};

// ScriptStruct Arise.AriseBlueprintAssetDatabase
// 0x0010
struct FAriseBlueprintAssetDatabase
{
	TArray<struct FAriseBlueprintAssetData>            Data;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.AriseCharacterBasePartsData
// 0x0040
struct FAriseCharacterBasePartsData
{
	struct FSoftObjectPath                             Mesh;                                                     // 0x0000(0x0018) (Edit)
	struct FVector                                     LocationOffset;                                           // 0x0018(0x000C) (Edit, IsPlainOldData)
	struct FRotator                                    RotationOffset;                                           // 0x0024(0x000C) (Edit, IsPlainOldData)
	struct FVector                                     ScaleOffset;                                              // 0x0030(0x000C) (Edit, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.AriseCharacterCombinePartsData
// 0x0050
struct FAriseCharacterCombinePartsData
{
	struct FSoftObjectPath                             Mesh;                                                     // 0x0000(0x0018) (Edit)
	bool                                               bAttach;                                                  // 0x0018(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
	struct FName                                       SocketName;                                               // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     LocationOffset;                                           // 0x0028(0x000C) (Edit, IsPlainOldData)
	struct FRotator                                    RotationOffset;                                           // 0x0034(0x000C) (Edit, IsPlainOldData)
	struct FVector                                     ScaleOffset;                                              // 0x0040(0x000C) (Edit, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x004C(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.AriseCharacterPartsData
// 0x0050
struct FAriseCharacterPartsData
{
	struct FAriseCharacterBasePartsData                BaseParts;                                                // 0x0000(0x0040) (Edit)
	TArray<struct FAriseCharacterCombinePartsData>     CombineParts;                                             // 0x0040(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct Arise.AriseCommerceCategoryInfo
// 0x0020
struct FAriseCommerceCategoryInfo
{
	struct FString                                     mLabel;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FString>                             mContentLabels;                                           // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.AriseCommerceContentInfo
// 0x0018
struct FAriseCommerceContentInfo
{
	struct FString                                     mLabel;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	bool                                               mSale;                                                    // 0x0010(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               mPurchased;                                               // 0x0011(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0012(0x0002) MISSED OFFSET
	int                                                mPrice;                                                   // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.PadKeyAssign
// 0x0050
struct FPadKeyAssign
{
	TMap<struct FName, int>                            AssignList;                                               // 0x0000(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.MouseKeyAssign
// 0x0050
struct FMouseKeyAssign
{
	TMap<struct FName, int>                            AssignList;                                               // 0x0000(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.KeyboardKeyAssign
// 0x0050
struct FKeyboardKeyAssign
{
	TMap<struct FName, int>                            AssignList;                                               // 0x0000(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.GraphicsConfigData
// 0x0064
struct FGraphicsConfigData
{
	int                                                ScreenMode;                                               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Resolution;                                               // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                VerticalSync;                                             // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FramLimit;                                                // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Bloom;                                                    // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MotionBlur;                                               // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DrawScale;                                                // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DrawDistanceNPC;                                          // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DrawDistanceObject;                                       // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DrawDistanceGrass;                                        // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                AntiAliasing;                                             // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ShadowQuality;                                            // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TextureQuality;                                           // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                EffectQuality;                                            // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PostProcessQuality;                                       // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ScreenSpaceReflection;                                    // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                OcclusionCulling;                                         // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                AnisotropyFiltering;                                      // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FontSize;                                                 // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                AmbientOcclusion;                                         // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                VolumetricLighting;                                       // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ScreenSpaceShadow;                                        // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                GlobalIllumination;                                       // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DepthOfField;                                             // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                HighResolution;                                           // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.GameConfigData
// 0x000C
struct FGameConfigData
{
	int                                                PFCameraSpeed;                                            // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PFCameraYaw;                                              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PFCameraPitch;                                            // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.ConfigBgmData
// 0x0040
struct FConfigBgmData
{
	int                                                ID;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FString                                     DlcName;                                                  // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FName                                       TitleLabel;                                               // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       GameTitleLabel;                                           // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                GameTitleSort;                                            // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                BgmSort;                                                  // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       BgmDataLabel;                                             // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       BGMLabel;                                                 // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.DLCAcquireItemData
// 0x0020
struct FDLCAcquireItemData
{
	EDLCAcquireItemType                                Type;                                                     // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FString                                     Label;                                                    // 0x0008(0x0010) (BlueprintVisible, ZeroConstructor)
	int                                                Count;                                                    // 0x0018(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.BtlEncountGroupParam
// 0x0010
struct FBtlEncountGroupParam
{
	struct FName                                       Label;                                                    // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Rare;                                                     // 0x0008(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
};

// ScriptStruct Arise.BtlResultInfo
// 0x0018
struct FBtlResultInfo
{
	EBtlResultType                                     Result;                                                   // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	TArray<struct FBtlEncountGroupParam>               EncountGroupList;                                         // 0x0008(0x0010) (BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.AriseTextureSizeInfo
// 0x0030
struct FAriseTextureSizeInfo
{
	unsigned char                                      UnknownData00[0x14];                                      // 0x0000(0x0014) MISSED OFFSET
	int                                                TotalMaxAllowedSize;                                      // 0x0014(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	int                                                TotalCurrentSize;                                         // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	int                                                WorldMaxAllowedSize;                                      // 0x001C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	int                                                WorldCurrentSize;                                         // 0x0020(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	int                                                CharaMaxAllowedSize;                                      // 0x0024(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	int                                                CharaCurrentSize;                                         // 0x0028(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.LongChatPlayArgs
// 0x0050
struct FLongChatPlayArgs
{
	TMap<struct FName, struct FString>                 Args;                                                     // 0x0000(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.AriseGameTime
// 0x0008
struct FAriseGameTime
{
	int                                                Hour;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Minute;                                                   // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.AriseIconData
// 0x0078
struct FAriseIconData
{
	struct FString                                     mLabel;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     DlcName;                                                  // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	EAriseCharaIconID                                  IconId;                                                   // 0x0020(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
	struct FScenarioCondition                          mScenario;                                                // 0x0028(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FSoftObjectPath                             mIconPath;                                                // 0x0048(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FSoftObjectPath                             mBattleIconPath;                                          // 0x0060(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
};

// ScriptStruct Arise.AriseIconDataCollection
// 0x0010
struct FAriseIconDataCollection
{
	TArray<struct FAriseIconData>                      mData;                                                    // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.ItemParameter
// 0x0008
struct FItemParameter
{
	int                                                ID;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Value;                                                    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.ItemAbilityWorkData
// 0x000C
struct FItemAbilityWorkData
{
	int                                                AbilityID;                                                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Rank;                                                     // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Value;                                                    // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.ItemWorkData
// 0x0038
struct FItemWorkData
{
	int                                                UniqueId;                                                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ItemID;                                                   // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FItemParameter>                      Parameter;                                                // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FItemAbilityWorkData>                AbilityWorkData;                                          // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Rank;                                                     // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Flag;                                                     // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET
};

// ScriptStruct Arise.ItemParameterNamed
// 0x0018
struct FItemParameterNamed
{
	int                                                ID;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FString                                     Value;                                                    // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.ItemCommonFlag
// 0x0001
struct FItemCommonFlag
{
	bool                                               Enable;                                                   // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.ItemData
// 0x0078
struct FItemData
{
	int                                                UniqueId;                                                 // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                ID;                                                       // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       DlcName;                                                  // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       Label;                                                    // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      Category;                                                 // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
	struct FText                                       Icon;                                                     // 0x0020(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	unsigned char                                      MaxNum;                                                   // 0x0038(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0039(0x0007) MISSED OFFSET
	TArray<struct FItemParameter>                      ParamNums;                                                // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FItemParameterNamed>                 ParamNames;                                               // 0x0050(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FItemCommonFlag>                     Flag;                                                     // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                Sort;                                                     // 0x0070(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                DlcID;                                                    // 0x0074(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.AriseListBoxStyle
// 0x0008 (0x0010 - 0x0008)
struct FAriseListBoxStyle : public FSlateWidgetStyle
{
	bool                                               AutoVerticalMargin;                                       // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
};

// ScriptStruct Arise.ListWidgetInitData
// 0x0040
struct FListWidgetInitData
{
	TArray<int>                                        IntData;                                                  // 0x0000(0x0010) (BlueprintVisible, ZeroConstructor)
	TArray<float>                                      FloatData;                                                // 0x0010(0x0010) (BlueprintVisible, ZeroConstructor)
	TArray<unsigned char>                              ByteData;                                                 // 0x0020(0x0010) (BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             StringData;                                               // 0x0030(0x0010) (BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.AriseMiningItemSaveInfo
// 0x0018
struct FAriseMiningItemSaveInfo
{
	int                                                ItemID;                                                   // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EAriseMiningItemType                               Type;                                                     // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	TArray<int>                                        AbilityID;                                                // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.AriseMiningPointSaveInfo
// 0x0028
struct FAriseMiningPointSaveInfo
{
	struct FString                                     Name;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FAriseMiningItemSaveInfo>            Items;                                                    // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Rarelity;                                                 // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                CookSkill;                                                // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.PartyOrder
// 0x0078
struct FPartyOrder
{
	TArray<EArisePartyID>                              Order;                                                    // 0x0000(0x0010) (ZeroConstructor)
	TArray<EArisePartyID>                              BackupOrder;                                              // 0x0010(0x0010) (ZeroConstructor)
	EArisePartyID                                      PartyTop;                                                 // 0x0020(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
	TArray<EAriseGuestID>                              Guest;                                                    // 0x0028(0x0010) (ZeroConstructor)
	TArray<EAriseGuestID>                              Companion;                                                // 0x0038(0x0010) (ZeroConstructor)
	EOperationMode                                     BackupOperation;                                          // 0x0048(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
	TArray<EArisePartyID>                              BackupPartyTop;                                           // 0x0050(0x0010) (ZeroConstructor)
	TArray<EArisePartyID>                              BackupBattleTop;                                          // 0x0060(0x0010) (ZeroConstructor)
	bool                                               bLockPartyTop;                                            // 0x0070(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0071(0x0007) MISSED OFFSET
};

// ScriptStruct Arise.ArisePlayerStatus
// 0x0008
struct FArisePlayerStatus
{
	class UArisePCStatus*                              Status;                                                   // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.ArisePlatformAssetData
// 0x0028
struct FArisePlatformAssetData
{
	struct FString                                     ID;                                                       // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FSoftObjectPath                             Asset;                                                    // 0x0010(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
};

// ScriptStruct Arise.ArisePlatformAssetDataCollection
// 0x0010
struct FArisePlatformAssetDataCollection
{
	TArray<struct FArisePlatformAssetData>             Record;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.ArisePlayerAttachmentData
// 0x0008
struct FArisePlayerAttachmentData
{
	int                                                AttachmentID;                                             // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                VariationIndex;                                           // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.ArisePlayerVisualData
// 0x0020
struct FArisePlayerVisualData
{
	int                                                Hair;                                                     // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Costume;                                                  // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<struct FArisePlayerAttachmentData>          Attachments;                                              // 0x0008(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	int                                                Weapon;                                                   // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.AriseLevelUpResult
// 0x0004
struct FAriseLevelUpResult
{
	int                                                UpLevel;                                                  // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.LvStatusData
// 0x001C
struct FLvStatusData
{
	int                                                HP;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Atk;                                                      // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Def;                                                      // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                EAtk;                                                     // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                EDef;                                                     // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Pen;                                                      // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                End;                                                      // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.InitLearnSkillData
// 0x0018
struct FInitLearnSkillData
{
	struct FString                                     ID;                                                       // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                Key;                                                      // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.InitStatusData
// 0x0070
struct FInitStatusData
{
	struct FName                                       DlcName;                                                  // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Level;                                                    // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                SP;                                                       // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	TArray<struct FString>                             Alias;                                                    // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     Weapon;                                                   // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     Armor;                                                    // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     Hair;                                                     // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     Costume;                                                  // 0x0050(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FInitLearnSkillData>                 Skills;                                                   // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.LvExpData
// 0x0020
struct FLvExpData
{
	int                                                Exp;                                                      // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<int>                                        CharacterTable;                                           // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	bool                                               StartLv;                                                  // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               LimitLv;                                                  // 0x0019(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x001A(0x0006) MISSED OFFSET
};

// ScriptStruct Arise.XmlDatabaseItem
// 0x0028
struct FXmlDatabaseItem
{
	struct FString                                     Key;                                                      // 0x0000(0x0010) (Edit, ZeroConstructor)
	struct FSoftObjectPath                             Path;                                                     // 0x0010(0x0018) (Edit)
};

// ScriptStruct Arise.StringDictionaryItem
// 0x0028
struct FStringDictionaryItem
{
	struct FString                                     Key;                                                      // 0x0000(0x0010) (Edit, ZeroConstructor)
	struct FSoftObjectPath                             Path;                                                     // 0x0010(0x0018) (Edit)
};

// ScriptStruct Arise.AriseRelationShipData
// 0x0050
struct FAriseRelationShipData
{
	struct FString                                     mLabel;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     DlcName;                                                  // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                FIconID;                                                  // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EAriseCharaIconID                                  IconId;                                                   // 0x0024(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EAriseRelationship                                 mRelationship;                                            // 0x0025(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EAriseRelationshipSeriousCheck                     mSeriousCheck;                                            // 0x0026(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               mEnable;                                                  // 0x0027(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                mLikable;                                                 // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	struct FScenarioCondition                          mScenario;                                                // 0x0030(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
};

// ScriptStruct Arise.AriseRelationShipDataCollection
// 0x0010
struct FAriseRelationShipDataCollection
{
	TArray<struct FAriseRelationShipData>              mData;                                                    // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.AriseResidentAssetData
// 0x0028
struct FAriseResidentAssetData
{
	EAriseResidentAssetCategory                        Category;                                                 // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FName                                       ID;                                                       // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FSoftObjectPath                             AssetPath;                                                // 0x0010(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
};

// ScriptStruct Arise.AriseResidentAssetDatabase
// 0x0010
struct FAriseResidentAssetDatabase
{
	TArray<struct FAriseResidentAssetData>             Data;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.AriseSaveArgument
// 0x0008
struct FAriseSaveArgument
{
	int                                                mSlotIndex;                                               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EAriseSaveThumbneilType                            mThumbneilType;                                           // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
};

// ScriptStruct Arise.AriseSaveHeader
// 0x32058
struct FAriseSaveHeader
{
	TEnumAsByte<EAriseSaveType>                        mSaveType;                                                // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	int64_t                                            mPlayTime;                                                // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FDateTime                                   mUpdateTime;                                              // 0x0010(0x0008) (Edit, BlueprintVisible)
	int                                                mParameter[0x10];                                         // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      mImage[0x20000];                                          // 0x0058(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x12000];                                   // 0x20058(0x12000) MISSED OFFSET
};

// ScriptStruct Arise.AriseLoadArgument
// 0x0008
struct FAriseLoadArgument
{
	int                                                mSlotIndex;                                               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               mVerify;                                                  // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
};

// ScriptStruct Arise.AriseSaveResultToDo
// 0x0038
struct FAriseSaveResultToDo
{
	EAriseSaveToDoMessage                              mMessage;                                                 // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EAriseSaveVerify                                   mVerifyResult;                                            // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               mDelete;                                                  // 0x0002(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x0003(0x0005) MISSED OFFSET
	TArray<int>                                        mDLC_ErrorId;                                             // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FString>                             mDLC_RevertCategory;                                      // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<int>                                        mHeaderBrokenSlotIndexes;                                 // 0x0028(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct Arise.AriseDebugSaveFile
// 0x0020
struct FAriseDebugSaveFile
{
	struct FString                                     mFilePath;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FDateTime                                   mUpdateTime;                                              // 0x0010(0x0008) (Edit, BlueprintVisible)
	int                                                mSize;                                                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.AriseDeleteArgument
// 0x0004
struct FAriseDeleteArgument
{
	int                                                mSlotIndex;                                               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.ScenarioFlagUniqueSetterEvent
// 0x0010
struct FScenarioFlagUniqueSetterEvent
{
	struct FScriptDelegate                             Delegate;                                                 // 0x0000(0x0014) (ZeroConstructor, InstancedReference)
};

// ScriptStruct Arise.AriseScenarioFlag_DatabaseLabel
// 0x0010
struct FAriseScenarioFlag_DatabaseLabel
{
	struct FString                                     Name;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.AriseScriptSaveDataInfo
// 0x0020
struct FAriseScriptSaveDataInfo
{
	struct FString                                     Name;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	EAriseScriptSaveDataType                           Type;                                                     // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	int                                                Num;                                                      // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bInherit;                                                 // 0x0018(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
};

// ScriptStruct Arise.StatusImageUV
// 0x0010
struct FStatusImageUV
{
	float                                              X;                                                        // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              Y;                                                        // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              W;                                                        // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              H;                                                        // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.StatusImageLayout
// 0x0010
struct FStatusImageLayout
{
	float                                              PosX;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              PosY;                                                     // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              ScaleX;                                                   // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              ScaleY;                                                   // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.CharaImageData
// 0x0050
struct FCharaImageData
{
	struct FString                                     ImagePath;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FScenarioCondition                          Scenario;                                                 // 0x0010(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	struct FStatusImageUV                              UV;                                                       // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
	TArray<struct FStatusImageLayout>                  Layout;                                                   // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.StatusImageData
// 0x0018
struct FStatusImageData
{
	int                                                CharacterID;                                              // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<struct FCharaImageData>                     ImageData;                                                // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.StatusImageDataList
// 0x0010
struct FStatusImageDataList
{
	TArray<struct FStatusImageData>                    Data;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.AriseTacticsElement
// 0x0010
struct FAriseTacticsElement
{
	int                                                Condition;                                                // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Action;                                                   // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                How;                                                      // 0x0008(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Enable;                                                   // 0x000C(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
};

// ScriptStruct Arise.AriseTacticsSet
// 0x0020
struct FAriseTacticsSet
{
	int                                                ID;                                                       // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<struct FAriseTacticsElement>                List;                                                     // 0x0008(0x0010) (BlueprintVisible, ZeroConstructor)
	bool                                               bEdit;                                                    // 0x0018(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
};

// ScriptStruct Arise.AriseWaypointNode
// 0x0020
struct FAriseWaypointNode
{
	int                                                ThisIndex;                                                // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                ParentIndex;                                              // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                DataIndex;                                                // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	TArray<int>                                        ChildIndex;                                               // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.AriseWaypointData
// 0x000C
struct FAriseWaypointData
{
	struct FVector                                     Location;                                                 // 0x0000(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.AriseWaypointTree
// 0x0028
struct FAriseWaypointTree
{
	TArray<struct FAriseWaypointNode>                  NodeList;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FAriseWaypointData>                  DataList;                                                 // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                RootNodeIndex;                                            // 0x0020(0x0004) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.BtlDebugParameter
// 0x0040
struct FBtlDebugParameter
{
	bool                                               IsNotDieParty;                                            // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsNotDieEnemy;                                            // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsEnemyAI;                                                // 0x0002(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsPartyAI;                                                // 0x0003(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsFixedHPPercent;                                         // 0x0004(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	int                                                FixedHPPercent;                                           // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsUnlimitedTP;                                            // 0x000C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsOverwriteTP;                                            // 0x000D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x000E(0x0002) MISSED OFFSET
	int                                                OverwriteTP;                                              // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsUnlimitedSP;                                            // 0x0014(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsOverwriteSP;                                            // 0x0015(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x0016(0x0002) MISSED OFFSET
	int                                                OverwriteSP;                                              // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsOverwriteComboInterval;                                 // 0x001C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
	float                                              OverwriteComboInterval;                                   // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsUnlimitedStrike;                                        // 0x0024(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsUnlimitedOverlimit;                                     // 0x0025(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsForceStrikeSmash;                                       // 0x0026(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsBreakEndurance;                                         // 0x0027(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsIgnoreStrikeSmashCondition;                             // 0x0028(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsForceDown;                                              // 0x0029(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsForceCritical;                                          // 0x002A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsForceWeakness;                                          // 0x002B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsForceResistance;                                        // 0x002C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsForceCoreBreak;                                         // 0x002D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowDamageCollision;                                     // 0x002E(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowAttackCollision;                                     // 0x002F(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowSizeComponent;                                       // 0x0030(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowSelfCapsule;                                         // 0x0031(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowBaseCapsule;                                         // 0x0032(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowDamageArrow;                                         // 0x0033(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowMagicDebug;                                          // 0x0034(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsArsExecuteListOrderMode;                               // 0x0035(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowBattleShortChat;                                     // 0x0036(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bForceVoiceConditionScenarioRelationship;                 // 0x0037(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bDisableAttackVoice;                                      // 0x0038(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bDisableBGM;                                              // 0x0039(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsLearnArtsAll;                                          // 0x003A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsBattleHudHidden;                                       // 0x003B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsShowDisplayEncountInfoLoadState;                       // 0x003C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBtlRank                                           OverwriteRank;                                            // 0x003D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIgnoreFacial;                                            // 0x003E(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x1];                                       // 0x003F(0x0001) MISSED OFFSET
};

// ScriptStruct Arise.BattleSandboxPartyParam
// 0x0003
struct FBattleSandboxPartyParam
{
	EArisePartyID                                      PartyId;                                                  // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	bool                                               IsNotDie;                                                 // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	EOperationMode                                     OperationMode;                                            // 0x0002(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
};

// ScriptStruct Arise.BattleSandboxGuestParam
// 0x0002
struct FBattleSandboxGuestParam
{
	EAriseGuestID                                      GuestId;                                                  // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	bool                                               IsNotDie;                                                 // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
};

// ScriptStruct Arise.PFEncountSymbolGroupID
// 0x0010
struct FPFEncountSymbolGroupID
{
	struct FDatabaseLabel                              ID;                                                       // 0x0000(0x0010) (Edit, BlueprintVisible)
};

// ScriptStruct Arise.PFEncountSymbolBattleID
// 0x0010
struct FPFEncountSymbolBattleID
{
	struct FDatabaseLabel                              ID;                                                       // 0x0000(0x0010) (Edit, BlueprintVisible)
};

// ScriptStruct Arise.BtlTacticsCondition
// 0x0008
struct FBtlTacticsCondition
{
	struct FName                                       Label;                                                    // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.BtlTacticsAction
// 0x0008
struct FBtlTacticsAction
{
	struct FName                                       Label;                                                    // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.BtlTacticsHow
// 0x0008
struct FBtlTacticsHow
{
	struct FName                                       Label;                                                    // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.BattleSandboxTactics
// 0x0018
struct FBattleSandboxTactics
{
	struct FBtlTacticsCondition                        Condition;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, Config, GlobalConfig)
	struct FBtlTacticsAction                           Action;                                                   // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, Config, GlobalConfig)
	struct FBtlTacticsHow                              How;                                                      // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, Config, GlobalConfig)
};

// ScriptStruct Arise.BattleSandboxTacticsPreset
// 0x0010
struct FBattleSandboxTacticsPreset
{
	TArray<struct FBattleSandboxTactics>               Tactics;                                                  // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, Config, GlobalConfig)
};

// ScriptStruct Arise.BattleSandboxCostumeName
// 0x0008
struct FBattleSandboxCostumeName
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.BattleSandboxCostumeV2
// 0x0028
struct FBattleSandboxCostumeV2
{
	EArisePartyID                                      PartyId;                                                  // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FBattleSandboxCostumeName                   Costume;                                                  // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, Config, GlobalConfig)
	struct FBattleSandboxCostumeName                   Hair;                                                     // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, Config, GlobalConfig)
	TArray<struct FBattleSandboxCostumeName>           Attachment;                                               // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, Config, GlobalConfig)
};

// ScriptStruct Arise.PartsData
// 0x0020
struct FPartsData
{
	struct FString                                     PartsItemID;                                              // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     PartsImage;                                               // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.ArtifactData
// 0x00D8
struct FArtifactData
{
	struct FString                                     Label;                                                    // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     DlcName;                                                  // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     ComplateItemID;                                           // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     UncomplateItemID;                                         // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     ExItemID;                                                 // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     EffectID;                                                 // 0x0050(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     ExEffectID;                                               // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     ChatID;                                                   // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     Image;                                                    // 0x0080(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     ExImage;                                                  // 0x0090(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     ItemID;                                                   // 0x00A0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FPartsData>                          PartsData;                                                // 0x00B0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     ExPartsItemID;                                            // 0x00C0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	bool                                               CountFlag;                                                // 0x00D0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               DefaultFlag;                                              // 0x00D1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               EXNewGameFlag;                                            // 0x00D2(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               NoSwicthFlag;                                             // 0x00D3(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00D4(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.ArtifactDataList
// 0x0010
struct FArtifactDataList
{
	TArray<struct FArtifactData>                       DataList;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.TriviaSerifData
// 0x0018
struct FTriviaSerifData
{
	unsigned char                                      TalkerId;                                                 // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      Direction;                                                // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0002(0x0006) MISSED OFFSET
	struct FString                                     Label;                                                    // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.TriviaData
// 0x0020
struct FTriviaData
{
	struct FString                                     TriviaLabel;                                              // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FTriviaSerifData>                    SerifList;                                                // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.TriviaDataCollection
// 0x0010
struct FTriviaDataCollection
{
	TArray<struct FTriviaData>                         mData;                                                    // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.BattleHudOption
// 0x0004
struct FBattleHudOption
{
	unsigned char                                      bVisibleArtsHud : 1;                                      // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bVisiblePartyHud : 1;                                     // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bVisibleTpGauge : 1;                                      // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bVisibleHitCount : 1;                                     // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bVisibleStrikeHud : 1;                                    // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bVisiblePlayerHud : 1;                                    // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bVisibleTargetHud : 1;                                    // 0x0000(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
};

// ScriptStruct Arise.BattleHudNotifyText
// 0x0038
struct FBattleHudNotifyText
{
	int                                                ReplaceValue;                                             // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FScriptDelegate                             GetReplaceNotifyText;                                     // 0x0008(0x0014) (ZeroConstructor, InstancedReference)
	struct FDictionaryText                             Text;                                                     // 0x0018(0x0020)
};

// ScriptStruct Arise.BattleDelayDamge
// 0x0018
struct FBattleDelayDamge
{
	struct FVector                                     Position;                                                 // 0x0000(0x000C) (Transient, IsPlainOldData)
	int                                                Number;                                                   // 0x000C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                TickGroup;                                                // 0x0010(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      IsEnemey : 1;                                             // 0x0014(0x0001) (Transient)
	unsigned char                                      IsCritical : 1;                                           // 0x0014(0x0001) (Transient)
	unsigned char                                      IsWeak : 1;                                               // 0x0014(0x0001) (Transient)
	unsigned char                                      IsResist : 1;                                             // 0x0014(0x0001) (Transient)
	unsigned char                                      IsCore : 1;                                               // 0x0014(0x0001) (Transient)
	unsigned char                                      IsCoreBreak : 1;                                          // 0x0014(0x0001) (Transient)
	unsigned char                                      IsBoostBreak : 1;                                         // 0x0014(0x0001) (Transient)
	unsigned char                                      IsPoison : 1;                                             // 0x0014(0x0001) (Transient)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
};

// ScriptStruct Arise.BtlHudVisible_DatatableLabel
// 0x0008
struct FBtlHudVisible_DatatableLabel
{
	struct FName                                       Label;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.BtlArts_XmlDatatableLabel
// 0x0008
struct FBtlArts_XmlDatatableLabel
{
	struct FName                                       Label;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.BtlResultDropItem
// 0x000C
struct FBtlResultDropItem
{
	int                                                ItemID;                                                   // 0x0000(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                AddNum;                                                   // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsRareDorop;                                             // 0x0008(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsLimitOverNum;                                           // 0x0009(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsNewFlag;                                                // 0x000A(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x000B(0x0001) MISSED OFFSET
};

// ScriptStruct Arise.BattleResultHudInfomationPartyData
// 0x0010
struct FBattleResultHudInfomationPartyData
{
	int                                                Level;                                                    // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Exp;                                                      // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PrevHp;                                                   // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                RecoveryHp;                                               // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.BattleResultHudInfomation
// 0x00A8
struct FBattleResultHudInfomation
{
	TMap<EArisePartyID, struct FBattleResultHudInfomationPartyData> PartyData;                                                // 0x0000(0x0050) (ZeroConstructor)
	TArray<EArisePartyID>                              PartyOrder;                                               // 0x0050(0x0010) (ZeroConstructor)
	TArray<struct FBtlResultDropItem>                  DropItems;                                                // 0x0060(0x0010) (ZeroConstructor)
	int                                                ExpBase;                                                  // 0x0070(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Exp;                                                      // 0x0074(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ExpBonus;                                                 // 0x0078(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RpBase;                                                   // 0x007C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RP;                                                       // 0x0080(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RpBonus;                                                  // 0x0084(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AddBattleBonusBase;                                       // 0x0088(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AddBattleBonus;                                           // 0x008C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AddBattleBonusRate;                                       // 0x0090(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Time;                                                     // 0x0094(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PrevTp;                                                   // 0x0098(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxTp;                                                    // 0x009C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RecoveryTp;                                               // 0x00A0(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00A4(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.BtlSkillSetData
// 0x000C
struct FBtlSkillSetData
{
	int                                                SkillID;                                                  // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Value;                                                    // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                RisePoint;                                                // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.BtlAliasData
// 0x0090
struct FBtlAliasData
{
	int                                                ID;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FString                                     Label;                                                    // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     DlcName;                                                  // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	bool                                               Flag;                                                     // 0x0028(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0029(0x0003) MISSED OFFSET
	int                                                PartyId;                                                  // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	TArray<int>                                        LowAliases;                                               // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FItemParameterNamed>                 ParamNames;                                               // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FItemParameter>                      ParamNums;                                                // 0x0050(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FBtlSkillSetData>                    SkillSets;                                                // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     Picture;                                                  // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                AliasParamName;                                           // 0x0080(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                ParamValue;                                               // 0x0084(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Chapter;                                                  // 0x0088(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Section;                                                  // 0x008C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.BtlAliasDatabaseRow
// 0x0010
struct FBtlAliasDatabaseRow
{
	TArray<struct FBtlAliasData>                       Record;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.BtlArenaRewardData
// 0x0048
struct FBtlArenaRewardData
{
	struct FString                                     ItemLabel;                                                // 0x0000(0x0010) (ZeroConstructor, Deprecated)
	int                                                ItemID;                                                   // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Num;                                                      // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FString                                     Param00;                                                  // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	float                                              Value00;                                                  // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	struct FString                                     Param01;                                                  // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	float                                              Value01;                                                  // 0x0040(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.BtlArenaData
// 0x0110
struct FBtlArenaData
{
	int                                                ID;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FName                                       Label;                                                    // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       Name;                                                     // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       DlcName;                                                  // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Type;                                                     // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Class;                                                    // 0x0024(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Character;                                                // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Level;                                                    // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Chapter;                                                  // 0x0030(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
	struct FName                                       ScenarioBit;                                              // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               Hide;                                                     // 0x0040(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0041(0x0007) MISSED OFFSET
	TArray<struct FName>                               EncountGroup;                                             // 0x0048(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                Gald;                                                     // 0x0058(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Interval;                                                 // 0x005C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Time;                                                     // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               Down;                                                     // 0x0064(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               Fall;                                                     // 0x0065(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x0066(0x0002) MISSED OFFSET
	TArray<struct FBtlArenaRewardData>                 Reward;                                                   // 0x0068(0x0010) (ZeroConstructor, Deprecated)
	TArray<struct FBtlArenaRewardData>                 FirstRewards;                                             // 0x0078(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FBtlArenaRewardData>                 TargetRewards;                                            // 0x0088(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                FirstClear;                                               // 0x0098(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                TargetClear;                                              // 0x009C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FString                                     Alias;                                                    // 0x00A0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     PreEvent;                                                 // 0x00B0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     PostEventWin;                                             // 0x00C0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     PostEventLose;                                            // 0x00D0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     QuestID;                                                  // 0x00E0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     QuestStartFlag;                                           // 0x00F0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     QuestEndFlag;                                             // 0x0100(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.BtlArenaEventData
// 0x0038
struct FBtlArenaEventData
{
	struct FString                                     Label;                                                    // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     Name;                                                     // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FSoftObjectPath                             Path;                                                     // 0x0020(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
};

// ScriptStruct Arise.BtlArenaDatabaseRow
// 0x0020
struct FBtlArenaDatabaseRow
{
	TArray<struct FBtlArenaData>                       Record;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FBtlArenaEventData>                  Events;                                                   // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.BtlSkillData
// 0x00B0
struct FBtlSkillData
{
	struct FString                                     ID;                                                       // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     Name;                                                     // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FString                                     DlcName;                                                  // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                Type;                                                     // 0x0030(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Category;                                                 // 0x0034(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                SupportUnit;                                              // 0x0038(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                EffectScope;                                              // 0x003C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	TArray<struct FName>                               TargetEffects;                                            // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	float                                              Value;                                                    // 0x0050(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               Random;                                                   // 0x0054(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0055(0x0003) MISSED OFFSET
	int                                                Reality;                                                  // 0x0058(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                Probabillity;                                             // 0x005C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              Add;                                                      // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              Max;                                                      // 0x0064(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FString                                     High;                                                     // 0x0068(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	TArray<struct FItemParameterNamed>                 ParamNames;                                               // 0x0078(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	int                                                SkillID;                                                  // 0x0088(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                IconNo;                                                   // 0x008C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EBtlSkillUnit                                      Unit;                                                     // 0x0090(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0091(0x0003) MISSED OFFSET
	float                                              FixValue;                                                 // 0x0094(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FSoftObjectPath                             Script;                                                   // 0x0098(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst)
};

// ScriptStruct Arise.BtlSkillDatabaseRow
// 0x0010
struct FBtlSkillDatabaseRow
{
	TArray<struct FBtlSkillData>                       Record;                                                   // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
};

// ScriptStruct Arise.BtlArtsHandle
// 0x0020
struct FBtlArtsHandle
{
	TWeakObjectPtr<class ABtlCharacterBase>            OwnerUnit;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	struct FName                                       ArtsLabel;                                                // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	int                                                ArtsIndex;                                                // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	int                                                ArtsSlotIndex;                                            // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	int                                                ArtsRequestId;                                            // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct Arise.UsedArtsInfo
// 0x0018
struct FUsedArtsInfo
{
	int                                                Count;                                                    // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<struct FName>                               Targeted;                                                 // 0x0008(0x0010) (ZeroConstructor)
};

// ScriptStruct Arise.ActionHittedUnitInfo
// 0x0010
struct FActionHittedUnitInfo
{
	class ABtlCharacterBase*                           Unit;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EActionCriticalStatus                              Critical;                                                 // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               EnduranceCalculated;                                      // 0x0009(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x000A(0x0006) MISSED OFFSET
};

// ScriptStruct Arise.ActionHittedUnit
// 0x0030
struct FActionHittedUnit
{
	struct FBtlArtsHandle                              ArtsHandle;                                               // 0x0000(0x0020) (Edit, BlueprintVisible)
	TArray<struct FActionHittedUnitInfo>               Hitted;                                                   // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.ActionArtsTurnTargetInfo
// 0x0001
struct FActionArtsTurnTargetInfo
{
	unsigned char                                      bIsTurnTarget : 1;                                        // 0x0000(0x0001)
	unsigned char                                      bIsManualInput : 1;                                       // 0x0000(0x0001)
};

// ScriptStruct Arise.ActionCancelParam
// 0x0020
struct FActionCancelParam
{
	bool                                               bAttack;                                                  // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bMove;                                                    // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bJump;                                                    // 0x0002(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bStep;                                                    // 0x0003(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bGuard;                                                   // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bMagic;                                                   // 0x0005(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bItem;                                                    // 0x0006(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0007(0x0001) MISSED OFFSET
	int                                                RequiredArtsCount;                                        // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                UserValue;                                                // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     UserString;                                               // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Arise.BtlAISignalData
// 0x0008
struct FBtlAISignalData
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct Arise.BtlTacticsData
// 0x0038
struct FBtlTacticsData
{
	int                                                ID;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FString                                     DlcName;                                                  // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst)
	struct FName                                       Label;                                                    // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EBtlTacticsCategory                                Category;                                                 // 0x0020(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EBtlTacticsCondition                               Condition;                                                // 0x0021(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EBtlTacticsAction                                  Action;                                                   // 0x0022(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	EBtlTacticsHow                                     How;                                                      // 0x0023(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                argInt;                                                   // 0x0024(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              argFloat;                                                 // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	struct FName                                       argName;                                                  // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
};

// ScriptStruct Arise.BtlTacticsRequestAI
// 0x00B8
struct FBtlTacticsRequestAI
{
	bool                                               isRequest;                                                // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FBtlTacticsData                             Condition;                                                // 0x0008(0x0038) (BlueprintVisible, BlueprintReadOnly, Transient)
	struct FBtlTacticsData                             How;                                                      // 0x0040(0x0038) (BlueprintVisible, BlueprintReadOnly, Transient)
	struct FBtlTacticsData                             Action;                                                   // 0x0078(0x0038) (BlueprintVisible, BlueprintReadOnly, Transient)
	class ABtlCharacterBase*                           Target;                                                   // 0x00B0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct Arise.BtlAIParameter
// 0x0088
struct FBtlAIParameter
{
	int                                                Phase;                                                    // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     MovePoint;                                                // 0x0004(0x000C) (Transient, IsPlainOldData)
	TEnumAsByte<EEnvQueryStatus>                       MovePointEqs;                                             // 0x0010(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	struct FVector                                     TargetGoal;                                               // 0x0014(0x000C) (Transient, IsPlainOldData)
	struct FName                                       RequestArts;                                              // 0x0020(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBtlActionQuery*                             QueryArts;                                                // 0x0028(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBtlActionQuery*                             QueryMove;                                                // 0x0030(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBtlActionQuery*                             QueryTurn;                                                // 0x0038(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBtlActionQuery*                             QueryStep;                                                // 0x0040(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBtlActionQuery*                             QueryGuardStart;                                          // 0x0048(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBtlActionQuery*                             QueryGuardEnd;                                            // 0x0050(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBtlActionQuery*                             QueryItem;                                                // 0x0058(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class ABtlCharacterBase*                           TargetArts;                                               // 0x0060(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class ABtlCharacterBase*                           TargetDetect;                                             // 0x0068(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                Random;                                                   // 0x0070(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     IdlePoint;                                                // 0x0074(0x000C) (Transient, IsPlainOldData)
	bool                                               bFollowingPlayer;                                         // 0x0080(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0081(0x0007) MISSED OFFSET
};

// ScriptStruct Arise.BtlActiveArts
// 0x0018
struct FBtlActiveArts
{
	class ABtlCharacterBase*                           Owner;                                                    // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class ABtlCharacterBase*                           Target;                                                   // 0x0008(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       Label;                                                    // 0x0010(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.SkillDataString
// 0x0080
struct FSkillDataString
{
	struct FDictionaryText                             SkillName;                                                // 0x0000(0x0020) (BlueprintVisible, BlueprintReadOnly)
	struct FDictionaryText                             MaxSkillName;                                             // 0x0020(0x0020) (BlueprintVisible, BlueprintReadOnly)
	struct FDictionaryText                             SkillExplanation;                                         // 0x0040(0x0020) (BlueprintVisible, BlueprintReadOnly)
	struct FDictionaryText                             MaxSkillExplanation;                                      // 0x0060(0x0020) (BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct Arise.AliasDataString
// 0x0060
struct FAliasDataString
{
	struct FDictionaryText                             Name;                                                     // 0x0000(0x0020) (BlueprintVisible, BlueprintReadOnly)
	struct FDictionaryText                             Explanation;                                              // 0x0020(0x0020) (BlueprintVisible, BlueprintReadOnly)
	struct FDictionaryText                             Locked;                                                   // 0x0040(0x0020) (BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct Arise.BtlAnimSpecialNodeMemory
// 0x0010
struct FBtlAnimSpecialNodeMemory
{
	TArray<unsigned char>                              Memory;                                                   // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct Arise.BtlSphereCollisionInfo
// 0x0014
struct FBtlSphereCollisionInfo
{
	struct FVector                                     Location;                                                 // 0x0000(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	float                                              Scale;                                                    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SphereRadius;                                             // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Arise.BtlCameraAnimStartParameter
// 0x001C
struct FBtlCameraAnimStartParameter
{
	EBtlCameraAnimStartType                            Type;                                                     // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FVector                                     OffsetLocation;                                           // 0x0004(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FRotator                                    OffsetRotation;                                           // 0x0010(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
};

// ScriptStruct Arise.AttackSphereParam
// 0x0050
struct FAttackSphereParam
{
	int                                                CollisionGroupID;                                         // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              HitIntervalSec;                                           // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                HitCountLimit;                                            // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	struct FName                                       HitStatusLabel;                                           // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       SystemEffectOnHit;                                        // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       HitDirectionLabel;                                        // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EDestructibleType                                  DestructibleType;                                         // 0x0028(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EBtlDestructFilterLevel                            DestructibleFilterType;                                   // 0x0029(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x002A(0x0006) MISSED OFFSET
	struct FName                                       ArtsLabel;                                                // 0x0030(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              HitHoldHeightSec;                                         // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PredictFrame;                                             // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsInstantDeath;                                          // 0x0040(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsAllowance;                                             // 0x0041(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsFriendlyFire;                                          // 0x0042(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUnbindAnimLocation;                                      // 0x0043(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DamageWeight;                                             // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bOverrideElement;                                         // 0x0048(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EBtlElementType                                    Element;                                                  // 0x0049(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x004A(0x0006) MISSED OFFSET
};

// ScriptStruct Arise.Btl_MagicSpawnParam
// 0x0038
struct FBtl_MagicSpawnParam
{
	bool                                               bLocationCenter;                                          // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FName                                       LocationSocket;                                           // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	EBtlMagicLocationType                              LocationType;                                             // 0x0010(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	struct FVector                                     LocationOffset;                                           // 0x0014(0x000C) (Edit, IsPlainOldData)
	struct FName                                       RotationSocket;                                           // 0x0020(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
