#pragma once

// Name: Arise, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct STR_BtlHudVisible.STR_BtlHudVisible
// 0x0013
struct FSTR_BtlHudVisible
{
	bool                                               OperationBar_12_5EEA505A4C436902CEE0C8B6EEE41597;         // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               TargetBar_13_83206C884702689F60AAC6AF3DF8818C;            // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               PartyBar_25_759288464FB4ED93215E998E9D09F40E;             // 0x0002(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               PartyPlayerBar_37_8969DF6849BC10BB4074B298A5BA4AA5;       // 0x0003(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               BossGauge_14_6933153140DB249575BE4BBD217B0D35;            // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               TP_33_A275A05A4BBC35D5C1C1C49647038B41;                   // 0x0005(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ItemGauge_29_DCEE287148E3977C6A7F96AE26F93FAD;            // 0x0006(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Strike_32_8052612B4BBB15ECB7360CA0017738D8;               // 0x0007(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               StrikePlayerFlag_49_2DB724504EBDF35AE56E718DE917454E;     // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               EscapeGauge_31_97EDCA77493A4343296408ADA8CC29A2;          // 0x0009(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ArtsHelpText_15_86BBD9224BA6A4D3FB62968F8B2CC8F8;         // 0x000A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ArtsNotifyText_17_FEEE75974EB556001ABBC0853CF42868;       // 0x000B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ComboDamage_18_17AC3403491AA797504A74B1E254563A;          // 0x000C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Damage3D_19_C3FCF4E04CDBB443540BD688B8199591;             // 0x000D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Spell_20_D12E6F7F4BD1AA5D8B0A169FDBA060D8;                // 0x000E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ShortChat_35_D41EA0134787E4390029D2BEC9A87AAC;            // 0x000F(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Tutorial_39_07C98B4A4C0ED2424E812EB3C3667E0C;             // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               BackUnderMat_43_238EE2974ED5A668FB83418B13498313;         // 0x0011(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               EncountEnemys_46_E4DC98C4464B5E4DD96879AAC6EFC53E;        // 0x0012(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
