#pragma once

// Name: Arise, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct STR_LChatGuestDefine.STR_LChatGuestDefine
// 0x0050
struct FSTR_LChatGuestDefine
{
	struct FString                                     Comment_13_9A7E06EF446944C194C38F8312E5C00C;              // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ModelId_4_2E376C724A0517D3C4858CBF431FF95B;               // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     AnimationBP_15_1C37317E4C35A0A1C211A7A514C8BF1B;          // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FVector                                     FaceOffset_8_A88CFF594177670AA59A63A61410B10D;            // 0x0030(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	struct FVector                                     BustOffset_10_ACB5E6B84E21850962B2688865DCC6FD;           // 0x003C(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	float                                              CapsuleHalfHight_19_0CE094834B2462694E6058B1AA3C169F;     // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              CapsuleRadius_21_020F61BE41A47B78FCFA1DA16FB1331A;        // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
